{
  "articles": [
    {
      "top": {
        "name": "1995級 徐瑞廷",
        "experience": ["BCG 波士頓顧問公司董事總經理"],
        "hashtags": [
          "系友專訪",
          "徐瑞廷",
          "1995級",
          "B80",
          "StanfordUniversity",
          "SantaClaraUniversity",
          "MBA",
          "史丹福大學電子工程學碩士",
          "聖塔克拉拉大學MBA",
          "BCG",
          "波士頓顧問公司合夥人暨董事總經理",
          "BCG台北辦公室負責人",
          "策略顧問方法與實務",
          "StrategyConsulting",
          "探索自己",
          "多想下一步跟下下步",
          "獨立思考"
        ]
      },
      "body": {
        "body": [
          {
            "bigtitle": "一、前言",
            "bigsections": [
              {
                "subtitle": "致謝",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "系學會很感謝 1995級林哲立系友 與 1995級丁建均教授的大力幫忙，讓我們邀請到徐瑞廷系友參加本次專訪。徐學長是史丹福大學電子工程學碩士 / 聖塔克拉拉大學 MBA，畢業後在BCG 波士頓顧問公司擔任台北辦公室負責人、合夥人暨董事總經理；除此之外，學長和 台大國企系李吉仁教授 也曾在2016年九月共同開授選修課程「策略顧問—方法與實務」 (Strategy Consulting: Approach and Practice, https://www.facebook.com/BCGinTaiwan/posts/1110247705713105 )現在讓我們一起看看徐學長的分享與心路歷程。"
              }
            ]
          },
          {
            "bigtitle": "二、碩士時期",
            "bigsections": [
              {
                "subtitle": "畢業後選擇的領域",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "從台大電機畢業以後，當時對我來說最直接的選項就是出國念研究所，就是想出國看看。我希望申請到一流的學校，所以同樣申請電機系所。在申請國外學校時，並沒有細分電磁、自動控制等領域，是在Stanford讀研究所時才確定領域。我後來是攻讀IC design，主要也是因為IC design在當時的矽谷是熱門的領域。在Stanford上課和我在台大的經驗最大的不同，是很多上課的教材直接從業界取材。比如說上電路設計的時候，我們研究的電路樣本就是來自於幾家真實的公司，像是HP、DEC(Digital Equipment Corporation)，對我的衝擊很大。我了解到原來業界很多領先的電路是長這樣子，你可以想像那跟教科書有很大的不同。同時我也認識到，畢業後如果去這些公司，大概會是做哪些事情、我需要那些技能。加上IC design本身就很有意思，後來我在研究所花了很多時間研究IC design的課，畢業以後就直接去DEC設計CPU。大概是這個樣子，可以說我的選擇是受到很多研究所課堂的影響。"
              },
              {
                "subtitle": "當年最尊敬的恩師",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我的恩師有兩位教授：其中一位教授上的是電機系一門很難的課，卻可以把很難的課用很白話的方式講解，不會一開始就進入技術的細節，而是先給大家一個大的概念框架，再深入淺出的說明。我對他印象很深刻也很喜歡聽他講課。另外一位老師則是非常關心學生，從一些小的互動可以看出他有在觀察學生，然後在其他地方顯現他的觀察並投射到他的互動中。"
              },
              {
                "subtitle": "大學的成就",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我必須承認，大學時候的環境對我來說還是相對封閉，我也不知道畢業以後要做什麼、職場的要求是什麼，所以選擇的領域主要是當時學業上比較熱門的話題。大學期間選的專題是比較像無線通訊的，在90年代，行動通訊被認為是未來的趨勢。當初選擇的原因只是因為熱門，並沒有太多的想法。"
              },
              {
                "subtitle": "出國念研究所的意義",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "這問題其實不太容易回答。很多事情沒有自己經歷過，我是不太能評論的，畢竟我只看到結果，卻沒有看到過程。我想將重點放在我自己在美國就讀研究所的過程中，遭遇到的幾個衝擊：第一個衝擊是，美國研究所的課程題材十分實用，就如先前所提，基本上是跟業界緊密相連。我後來才明白箇中緣故：因為這些研究所，尤其如Stanford，課程的修習者不單只有學生，也包括了很多業界人士。像我們當時修習的某門課程，現場修課人數約有100多位，但其實還即時與矽谷幾個大企業(如：HP辦公室)連線同步授課，因此老師實際上正向數百人授課。這個例子的意義何在呢？老師教課時傳授的知識與技術有用與否，會直接反映在學生對他的回饋上；換句話說，一門課的課程題材實用性不高，很可能會在開課幾次後因為評分過低，遭到淘汰。我覺得這樣的互動對師生都是有益的：對學校老師而言，他課上傳授的一定得朝著實用的方向去；然而在平常與學生的互動中，老師也得以了解哪些事是相關行業人士所注重的。而我們這類剛從大學部上來的學生，也能馬上跟業界接軌。總結以上所述，在我的認知中，與業界連結緊密是最大的不同。第二個衝擊則是，當時在美國念研究所，並非每間研究所都要求寫論文，甚至可以說大部分的研究所皆沒有寫論文的要求；需要寫論文的人，多半是在攻讀博士學位。所以我當時在Stanford讀了九個月左右，就拿到了碩士學位；但若在台灣的話，無論怎麼規劃，沒花上兩年大概不太容易畢業。還有很多尚未提及的差異，或大或小，畢竟美國與台灣之間有太多的不同了：地域上的變數、文化上的變數、校風的不同等，要仔細比較可能花上三個小時都還講不完呢！在我的印象中，最大的差異大概就是這兩項了。噢...對了，再提個也是令人印象深刻的差異好了！但我要再重申一次，我不知道這類的比較是否有意義。提到在美國念研究所，應該不難想像同學來自世界各國，對吧？更有趣的是，他們甚至還來自各年齡層：我那時有個同學，當時應該已經40多歲了，我跟他交情很好。他是位HP的工程師，之所以當個全職學生，來Stanford就讀研究所，純粹是因為已經在公司工作好一段時間，公司便送他來進修。相對地，我最年輕的同學似乎是15歲吧，來自中國的天才少年班。總之，同學之中有來自不同的國家、不同的年齡層，雖然可以說是反映了美國本身在人口組成上的多樣性，但也帶來了一定的刺激。然而這些差異是否會對職業生涯造成不同的影響呢？如果從結果來看，我倒不覺得有。對我自己來說，在畢業後跟行業接軌這方面，我確實是從Stanford畢業以後，才真的有一定可以找到工作的自信；相較之下，我從台大畢業時，並不是很確定能擔任哪些工作。當時還沒有104人力銀行，只能看報紙找工作。報紙上會寫出哪些大廠在徵工程師、需要哪些條件、要求懂哪些東西。我是大四時開始在關注，雖說沒有立即就業的意願，但出於好奇，都會看一下我符不符合這些企業招募人才的需求。那時候一看，感覺沒有一份工作我可以勝任，因為對於是否學過上面條列的東西，我不能確定，自然也不清楚自己是否高於徵才門檻。 但在Stanford待九個月後，情況就不同了：那時我習得的知識與技術都是行業會用到的。所以我一畢業馬上對「能去哪些公司」、「找到怎樣的工作」...等，抱有大致的了解以及強烈的預感。但是找工作只是職場上的第一步，而這第一步我到底踏得順不順、有沒有留下甚麼深遠影響，我如今已經自電機系畢業接近二十年了，現在回首仍是不好評估咧！依結果論－當然我得再三強調，以下純屬個人觀察，並非固定的通則－大致上是這樣：比較我這幾屆當初去美國念研究所的這幫人與留在台灣的人，後者反而在畢業以後有更多的機會進入上升氣流強烈的企業。譬如：聯發科大概是從1990年代後半開始崛起，我們同屆當時就有好幾位較早進入聯發科服務，甚至有人的工號是在100號以前。你可以想像他們之中，有人現在大概累積了不少的積蓄。這種實例一部分肯定得歸功於他們當初的判斷：認定那些公司前景看好，於是跟著公司一同崛起；但另一部分也不得不承認裡面有許多人生境遇與造化。回首看一看，留在台灣的人以及比較早回台灣的人，有一定比率在職場上確實取得滿大的成就，如果這問題是想要這類比較淺層的回答...。畢竟成就這件事，要看各人怎去定義與詮釋；我不想給你們不當的定義，因為人生成就不一定只能從職場獲得。雖說這類比較稍嫌淺層而狹隘，但如果繼續從職場切入，不少像我們讀完研究所後留在美國發展的人，總會遭遇一些亞洲人常常面臨的問題，這些問題不能完全貶為劣勢，但肯定讓人難以如魚得水：身處一個新的環境，語言的不通順、文化上的差異都需要你花上時間與精力來磨合。而在追求晉升的過程中，又會遇到一波障礙，像是不可避免的辦公室政治、揣摩上司與客戶的心意......等。很有可能今天同樣狀況發生在台灣，我們更容易發揮所長；但在美國卻會受到前述問題的侷限，手腳受縛。尤其身處在管理階級時，更能體會這些阻礙。所以我們這些當時在美國念了研究所，直接畢業進美國職場的人呢，隔了二十年左右來看，在企業裡很容易遇到瓶頸。在這些分享的實例中，哪些因素對於生涯有深遠影響、影響是好是壞，我始終認為不能輕易定論。因為如果單看這一代在職場上的境遇，我們很容易忽略美國本身有許多其他的優點：舉例來講，後代的教育環境、生活成長的環境...等，這方面台灣實在不能以同等級相比。所以回歸這問題的敘述，「會對生涯造成那些影響」要看你從哪些維度來觀察，但我認為在較狹隘的職場發展上，結果確實與當初所預想的不太一樣。本來想像去了國外，拿到了金飯碗，到了後來可能有更好的待遇，但是這種預期在我們這一屆看來，反而不太是這麼一回事。"
              }
            ]
          },
          {
            "bigtitle": "三、初入職場",
            "bigsections": [
              {
                "subtitle": "第一份工作",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "很幸運地，在好學校，自然常會有公司來找好人才。我的第一份工作是在DEC做工程師，主要是負責ALPHA系列CPU。當時因為Digital是很大的趨勢，在課堂上也看過DEC的設計，因緣際會得到了這個工作。做了幾個月，我才發現設計這種大電路的分工非常細，和一開始的想像不太一樣，以為能有很大的彈性，可以設計出大電路，後來才發現是做小模組中的小模組。那時做的是DLL。大電路裡面有很多clock，要想辦法讓這些clock 同步，也就是DLL的功能。我離開的原因，主要是對工作的期待不太一樣。那也是我第一次面對自己：我到底喜不喜歡當工程師？我當時也是天人交戰，因為一路求學上來，很常都是因為成績考到，就去念了大家公認的好學校、好科系，沒有認真面對自己。我一直在思考到底自己要不要當工程師，後來經過很多考慮才決定離開，大概是這個樣子。"
              },
              {
                "subtitle": "創業經歷",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我在矽谷創過幾家Internet 的公司和一些e-commerce的公司，後來不再繼續的主因是2000年的泡沫。泡沫發生後資金很難募到，氛圍也滿恐慌的，不知道Internet公司是否能繼續存活、創造價值，還是只是一個風潮、泡沫。我從工程師跳到新創公司，才發現企業的經營有太多值得學習的地方，也才發現自己沒有準備好，索性冷靜一下，重新沈澱自己。"
              },
              {
                "subtitle": "您是一個好的工程師嗎？",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "這個問題不容易回答。是不是一個好的工程師要從各種方面來看。從結果而言，應該不是太好，因為後來就沒再繼續鑽研。其實我覺得工程師最重要的就是解決問題的能力吧，只是大部分是別人已經定義好的問題，可能是PM、你的老闆給你的spec，而你的工作就是在專案裡讓產品達到這個spec。但我為什麼不是一個太好的工程師呢？我可以想像我如果在這個領域繼續待下來，應該會越來越感到不滿足。我比較喜歡看big picture的東西，看產品對客戶的影響，我比較喜歡這種東西，所以站在這角度來看，工程師可能無法滿足我這樣的需求，這是比較大的矛盾。"
              },
              {
                "subtitle": "曾經做過最好的專案",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "這個很多，但是我不太能夠講細節。我們做過的專案常常可以創造重大的impact，很多都是上頭版新聞的。但是因為我們沒辦法透露客戶資訊，我只能描述大致的內容。譬如，有客戶想知道是否應繼續投資在原本的技術， 還是改投資在新技術上，這樣的決定牽涉的投資量是極大的。我們做了很多深入的分析，與客戶進行多輪討論後，說服客戶朝往某方向走，最後客戶也往該方向走，在新技術上有很多斬獲。這不完全能歸功於顧問公司，但我相信我們的分析與討論有重大的貢獻。也有一些案例是，成立了幾十年的大型組織，公司第一次想做大型的轉型，請我們幫他們做組織設計。因為是老牌公司，組織對轉型極為抗拒，我們用很多方法，對各部門和管理層做溝通，同時列舉其他遇到相同問題而轉型成功與失敗的案例，花了很長時間讓組織認可轉型的必要，當時也上了媒體。另外有很多企業會請我們幫他們思考未來三到五年的策略。舉例來說，一家公司一直認為自身的成長來自展店，因此不斷的展店，但根據我們的分析，才了解到展店反而造成了效益遞減，他們應該耕耘其他的東西，才能在三年內保持領先。後來經過討論也說服轉型，導致今天他還是保持領先地位。我在顧問產業十年多了，很榮幸能夠為很多企業創造價值，不僅對投資人，還有員工和成千上萬的家庭，這可能是我當工程師沒辦法做到的。"
              }
            ]
          },
          {
            "bigtitle": "四、跨領域顧問生涯",
            "bigsections": [
              {
                "subtitle": "從工程師進入到顧問業：面臨的考驗",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "不知道各位對顧問這個行業理解多少？顧問跟工程師一樣，每天的工作都是在解決問題，不過解決問題的角度不太一樣。工程師大多是為了達到 spec ，而顧問要解決的是客戶的問題，也就是經營者的問題。經營者的問題很活，有時候是組織，有時候是利潤，也有時候是各種問題的綜合。例如，兩個公司合併了，然後兩邊都有不同的文化，誰都不服誰，該怎麼辦？有點像你在家裡遇到柴米油鹽醬醋茶，什麼都來。對我來說，剛進公司的大挑戰有幾個。第一個，我一開始是在北京辦公室，對我來說有很多新的東西，包括新的文化－我沒有在中國大陸工作過，一下子到北京這個全新的環境，同事大多是中國人，客戶也是，而且是國營企業的客戶，但是當時北京辦公室的老闆是個美國人。所以我一開始要學習新的文化，不僅是地區的文化，還有人的文化。我要很快速去適應那個環境，這是蠻大的挑戰。舉一些小東西，例如，打字、用詞、用語和講話的口氣，你可以想像我有多少東西要適應。再加上顧問業的步調非常快，一開始就預期你要很快有表現，就很快把你丟到很有挑戰性的專案裡，你要馬上證明你在整個專案團隊裡不是累贅，有辦法創造價值，有辦法幹活。可以想像，面對巨大的文化衝擊，還要一邊跟上工作的快節奏，你說有什麼挑戰？全部都是挑戰。一轉頭要講大陸中文，另一邊還要用英文跟老外老闆將客戶談論的東西精準傳達，左右都不是我習慣的環境。此外，身為顧問，每次的專案、每次服務的客戶，面對的問題都是全新的，我要有辦法要很快 pick up 新的知識，對工程師而言是很不太容易適應的。以前，我可以花比較長的時間針對一個問題做深入的研究，現在第一週就要你研究 供應鏈中的某個問題，你可能只看過書，沒有實務經驗，但下週就要跟客戶開會，短期內就要提出建議，這個壓力相當大，卻只是顧問業裡的常態。因此，對我來說，除了文化環境之外，顧問跟工程師工作內容的巨大差異是最大的挑戰。"
              },
              {
                "subtitle": "顧問業特質",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我覺得在顧問業，有件事情是恆久不變的，那就是學習曲線非常陡。不管你在哪裡，無論在哪一個位階，就算我今天做到這個位置，我還是要學習，我每天都在大量學習。只是我們學習的管道多一些，公司內部的知識共享做得比較好。我們公司在全球各地服務上千家公司，專案中的學習都會經過機密處理後在內部分享，也讓我們了解在各行各業、各個經營層最關心的議題是什麼，我們可以如何去幫助這些客戶。除了內部大量的學習途徑，我自己每周五會和很多組織領導人，包括來自企業、自政府等的領導者交流意，這些機會對我來說也是很好的學習。有些時候，和這些檯面上的人物交換意見，聽取他們的想法，和這些一流經營者面對面學習，超過讀十本經營的書。再加上公司同事其實都很聰明，內部不斷會研究最新的趨勢，對不同行業的衝擊提出看法，我有時也會加入討論去跟全世界一流的經營人才學習。所以有太多太多的機會可以學習。只要待在這個行業一天，你就不會停止學習，你可以說這一個挑戰，這也是一個好處。"
              },
              {
                "subtitle": "工作、家庭與娛樂",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "關於work life balance，每個人怎麼去抓工作和家庭的平衡，因為每個人的環境不同，我不太有辦法去分享什麼。當然， work life balance 肯定是很重要的，每個人必須要花力氣想。我覺得電機系有一些人可能不喜歡輸，所以在職場上過度投入，忽略家庭這個要素。我不知道你們身旁有沒有這些人，這不能小看，一定要花心思時間去做，至於要怎麼做，我只能就我的狀況做分享，不確定能不能對大家帶來幫助。但是蠻奇妙的一點，有時候工作上無法突破之處，他的答案會在家庭，我的意思是說把這個平衡做好對你是有幫助的。可能你在家庭中，跟家人小孩相處的過程裡面，可以對公司的一些事情看得更清楚。有些時候是心態的轉換，對工作不這麼執著，反而能夠度過難關。工作和家庭是一體兩面，要花一點心思去想要扮演什麼角色，家庭可以給什麼樣的支援，你在工作之餘可以給家庭什麼。"
              },
              {
                "subtitle": "給學弟妹想要進入顧問業的建議",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "首先，我們這行主要分三個主軸，我大概簡單講一下。第一個就是區域軸，我們在全球有超過80幾個辦公室，包括像台北、香港、北京、東京、名古屋等。另一個是行業軸，像我專精於科技業，有些人主要看消費品產業，有些人是工業品。還有一個軸是功能軸，與企業內部的職能較相關。我在功能軸上的專業是策略，有些人是組織，也有人是銷售與行銷，其中，有人更專精在更細的主題上，專門在做定價。另外也有科技優勢小組，主要與 IT 、數位相關的。這是比較大型的顧問公司裡常見的分工。在這個分工之下，台灣的求職者有什麼優勢與劣勢呢？我覺得實際上是沒有直接關係的， 因為這個行業要求的，以一個單純的管理諮詢顧問來講，不一定要求在某個地域、某個行業，或是某個功能裡面有深入的研究才能進來。我們其實要求在決問題能力上或領導力上或是團隊能力上要有很大潛力，再加上要跟我們公司的文化相適應。 當然前提是過去的學業及職場表現頂尖。在這個前提之下，能夠展現團隊、領導及問題解決能力，這些人我們都很歡迎。你說台灣求職者有什麼優勢劣勢，我覺得很多時候是個人。因此台灣求職者不是有太多優勢劣勢。當然，我是以顧問業的角度來回答的。"
              },
              {
                "subtitle": "顧問業近五年來的變化",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "過去這幾年來最大變化在於，第一，環境變動越來越大，各行各業的環境變動劇烈。第二個就是我們的客戶進化很多，越來越強。客戶的公司裡有越來越多頂尖的 MBA人才進入，我們公司的顧問也有許多後來進入客戶的公司工作。現在管理顧問業越來越難靠方法論、靠工具在賣錢。 基本上，我們的方法論和工具都是半買半送，我們真正為客戶創造的價值反而在於剛剛講的那三個軸的深度。這個深度就是說，你是不是對某個議題有深入的看法，可能是某個產業的議題、某個功能或是某個區域的議題，這種深度是非常重要的。換句話說，你今天一定要 outsmart 你的客戶，你一定要比你的客戶更懂。舉例來說，假設你今天的客戶是一家中國的互聯網公司，他很懂中國互聯網。你如果要有辦法幫他做事情，你也要懂更多，比如美國的網路發展，或是你還懂日本和其他先進國家的發展，甚至印度、東南亞等比中國落後地區的互聯網發展。你的客戶今天可能在某個特定的領域是全世界最懂的，你很難outsmart 他，但是你要在其他地方 outsmart 他，才有辦法讓他覺得請你來有價值。 這種對知識寬度與深度的要求，是過去十年很難想像的。這對我們這個行業的影響就是，你今天的公司規模一定要夠大，才能夠在各種議題上面涵蓋地更廣更深。這對我們業界最立即的衝擊，就是對中小型的顧問公司帶來極大的壓力極大。最近幾年，很多小型的顧問公司被併購，成為大者恆大的趨勢，這是目前為止發生較大的變化。對於五年後十年後的未來，有很多不確定因素。另外很明顯的趨勢就是新科技的興起，包括大數據、AI 。很多人在思考是不是以後這些新科技會取代諮詢顧問？我個人是覺得機會不大。當然科技的某些部分對我們來講是威脅，但是更大的部分對我們來講是機會。我們有更強的定位基礎來利用這些科技幫助客戶解決問題。那客戶是不是未來就不需要管理顧問，而可以直接利用這些技術來解決問題呢？這個可能性不是不存在，但是比較小。原因是，在很多客戶縱使已具備這些科技，有很多基本的問題是不能用科技解決的。我隨便舉個例：透過不同的部門之間或人跟人之間的競爭、互動，怎麼樣讓一個組織更有效率，很難純粹從科技來解決。另外要怎麼去駕馭這些科技，不管是 AI 、 VR 、 AR，到底怎麼用，從哪個應用下手，要怎麼架構你的組織，才能讓你的組織接受這些科技。這是科技不會告訴你答案，需要人去思考的問題。此外，因為我們做了大量的研究，也和互聯網公司有大量的互動，我們知道這些新型的公司怎麼運用這些科技，可以將這些經驗應用在比較傳統的產業裡。另一方面，顧問公司身為公正的第三方，我們在幫客戶做組織變革的時候，會比較有超然的立場。如果今天是人事部來做變革，通常會遇到最大的阻礙就是，人家會說「你今天為什麼不先刮自己的鬍子，為什麼來刮我這個部門的」，這提供了外部顧問公司一個進入的機會。只是以上所述的趨勢，對顧問公司也是挑戰。如果你還是套用傳統架構來解決問題，不一定可以成功運用這些新型的科技。以 BCG 的例子來講，這幾年其實為了未來做了很多佈局。我們在建立很多傳統沒有的能力。例如，公司內部成立了數據分析團隊，這個團隊現在以一個瘋狂的速度在成長，其背景和我們傳統的諮詢顧問有很大的不同，很多是數學相關領域或是數據科學家出身的，也有些人是在搞新創的。你可以想像我們公司裡面有些像矽谷裡面的創業家，在幫助我們大型的客戶創業。我們也有一幫人在搞投資的。像這種跟傳統顧問不一樣 背景的人才，是我們現在透過各種組織一直在建立的。可以想像五年後、十年後的 BCG 會長什麼樣子，一定會很不同。 現在是以諮詢顧問為中心，身旁有很多組織來支持核心，讓我們來服務客戶，像是一個同心圓。十年後公司更像聯合國，有一幫人專門做顧問，跟客戶接觸然後解決問題的，一些人做分析等等，會像我剛剛講的聯合國的概念。 我認為必須這樣做，未來才能適應這些新科技、不確定性的環境，繼續幫助企業客戶成長，這是我的看法。"
              },
              {
                "subtitle": "是否該繼續進修",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "這個問題很難回答。像我剛剛說的，因為公司越來越像聯合國，我們招募人才時很看重diversity 。我們非常需要各種不同背景的人進來，這裡面包括 PhD 、在工作職場上有五到十年經驗的，甚至有些是在職場上待了二三十年的資深專家，我們也很歡迎。我們雇用的人才背景越來越多樣化。你說 PhD 還是職場經驗重要，兩者對我們來說都重要，只是進來後的角色會不一樣，職涯發展和訓練也會不一樣。博士生可能頭腦非常好，思路非常清晰，邏輯能力非常強，但是對產業背景相對不熟悉，可能需要商業上的培訓，或是給他更長的時間去適應整個顧問環境。另外針對一些資深的職場人士，他可能花了十五年在做數位行銷，他進來我們可能會給他比較專職的，可能一進來就是數位行銷專家，而不是單純的顧問，會有不同的職涯路徑，扮演不同角色。因此你問題哪個重要，其實都很重要，只是不同背景的人，他的職涯發展、角色以及受到的訓練等都不同。"
              }
            ]
          },
          {
            "bigtitle": "五、結語",
            "bigsections": [
              {
                "subtitle": "給大學部的建議",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "可以說是我的私心的偏見，對我來說，對於台大電機，我還是相信你們是全台灣最優秀的其中一群人，不是說其他人不優秀，只是你們一定是裡面最聰明的一部份。我不知道你們這屆是不是還有一些人，是因為分數才選擇電機的。我假設還是有一部份的人，並不是因為真的很愛電機才進來的。我想經過高中的教育，大概很多人都還不清楚什麼是電機，我想你們不是每個人都是經過深思熟慮的結果，是分數夠就進來了。我的意思是，你們其實可以在大學階段多去探索不同的路，可以是在電機領域，或這個領域之外，早點去面對自己。現在很多學生會延畢、出國交換，也許就是其中的一個表現。 我會蠻鼓勵你們多去探索自己，不要太受限於我們傳統教育體制之下給我們的結果，因為到一個時間點，一定會後悔，不知道是什麼時候，也可能是三四十歲，你開始想「我的人生到底在幹嘛？」，那個時候才要把過去的人生打翻，我覺得就有點可惜了。這是我的建議，多去探索自己。第二步就是，提早去為下一步或下下步打算。大學時期，很容易被眼前的課業限制住。大家都是好學生，不想輸別人，因此花很多時間把眼前的功課弄好，可是沒有花時間思考自己下一步是什麼。下一步是什麼？中期可能就是研究所，長期可能就是你的職涯選擇。以中期來說，我舉例，假設你大一大二 就決定要去 MIT 或是某學校繼續念電機，為了達到這個目標，你需要做什麼事情，大學的成績是怎麼算的，學校的要求是什麼，這類的事情你要提早弄清楚。像我們當年算 GPA ，發現國外的學校只看 GPA ，不看原始分數，然後我們那個時候 80 分以上就是 4.0 ，下面開始有 3.7 ， 3.3 等等。我發現原來我只要每科都考 80 分以上就好，但我自己雖然有不少科目90幾分，卻因為一些沒有興趣的科目只有60分而拉低平均。我的重點是，早點知道遊戲規則，你就會有更多的時間去準備，而非時間快到了才趕著去看。我後來最大的反省就是，我當年花太少時間去研究我下一步要幹嘛。 現在我在世界各地做招募活動，發現很多大學生從大一大二就開始思考他們的職涯，而我也遇過一些台大學生已經大四了，都還沒開始想這個問題。這是一樣的邏輯。舉例來說，如果你對顧問業有興趣，你可以先去了解這個行業在人才招募上在乎的因素是什麼，如果顧問公司看重實習經驗，你卻在大四時才發現這件事情，你就很難去和同儕競爭，很可惜。所以我給的第二個建議就是，提早為下一步做準備。這不會花很多時間，早點去探索未來職業的要求是什麼，早點去準備。最後，我覺得電機系的學生，相較於其他系的學長比起來，就是 … 比較乖了些。好學生嘛。我不是要你們做壞學生，但是我要建議的事情跟你們做壞學生有點類似。不要去太相信一些人家給你的規則。電機系很強的一點，就是你把規則講出來，他可以在規則之內做的最好。但是有些特質你們是沒有被測試的，就是破壞規則的能力。放眼望去，那些在科技行業成功的人，每個人都是破壞規則才成功的 。我覺得你們在學生時代，可以開始思考，並不是要你們到處破壞系上的規則，甚至上街頭抗議什麼的，我不是這個意思。我覺得要做的是獨立思考，你要去挑戰很多事情，包括學業，學校的導師跟你講的規則，你的學長跟你講的規則，譬如說潛規則是怎麼樣，怎麼樣才有辦法進哪個學校，怎麼樣才能進哪間公司，都聽一半就好。聽一半的意思不是不尊重對方，而是你要思考，真的是這個樣子嗎，為什麼是這樣子呢，是不是有其他方法等等，就是獨立思考的能力。我覺得電機系的同學腦筋都很好，只是有時候你的思考結果好不好，不是在於你的腦筋好，而是在於心態。如果覺得老師講的就是王道，學長講的就是王道，就像一隻牛，從小把牠放在牛圈裡面，將圍籬通電。老牛被電了幾次後，跟小牛說，欸這個圍籬不要碰，會被電到。然後你就相信了，你沒有去嘗試被電過，怎麼知道這個電了會不會痛，或者這個圍籬是不是 24 小時都通電？說不定被電的同時你能突破，衝出圍籬獲得自由，有自己的一片天地。很多時候時空環境在變，只會給不斷挑戰現狀的人機會， 挑戰現存的事實跟常識，然後大步的向前走。這個當然也是管理顧問其中一個挑戰，因為我們工作的一部分就是去挑戰客戶的常識，所以我們的行業經常得這麼做。不過另外一方面，我會希望跟你們共勉，就是我相信在電機系，很多人有機會在本行領導台灣，走向下一個階段，而不是背負著很大的 legacy，覺得台灣的行業一直走向 成本削減。台灣的電機行業走向低成本代表著一個階段，理論上這是你們的機會，你們是有機會跟未來的，你們應該反過來看這件事情，前提是不能被過去的常識、慣習，或是大家認為的東西綁住。所以第三個就是獨立思考。所以，我的建議總共有三個，一、探索自己，二、多想下一步跟下下步，三、獨立思考。主要就是這三個吧，希望對你們有幫助。"
              },
              {
                "subtitle": "一句話談談電機系給您的歸屬感",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "歸屬感不敢說，但是我以身為台大電機的一份子為榮。我真心覺得台大電機得天獨厚。以台灣來說，電機是特別值得向世界驕傲的產業，那麼在電機領域，全台灣最好的學校就是台大電機。我相信現在台灣在世界上取得的很多地位，跟台大電機密不可分，我想我不需要一一去談有哪些偉大的前輩為我們打下的基礎。總之，能夠沾點光，能夠身為台大電機一份子，是我一輩子的榮耀，哪怕我現在做的事情跟電機沒有直接的關係，我覺得這個是我永遠不會忘記的。"
              }
            ]
          }
        ]
      },
      "annotation": {
        "annotation": [
          {
            "job": "特別感謝：",
            "contributer": "徐瑞廷"
          },
          {
            "job": "撰寫：",
            "contributer": "廖宜倫 黃暐倫 楊耀程 孫裕修 林恆陞"
          }
        ]
      },
      "id": "1601"
    },
    {
      "top": {
        "name": "1992級 梁維仁",
        "experience": ["元大證券香港區總經理", "花旗環球證券臺灣區總經理"],
        "hashtags": [
          "系友專訪",
          "梁維仁",
          "1992級",
          "B77",
          "金融工程",
          "CarnegieMellonUniversity",
          "ComputationalFinance",
          "MS",
          "MBA",
          "元大證券",
          "花旗環球證券",
          "總經理",
          "外資交易",
          "optionpricingmodel",
          "跨領域",
          "justdoit"
        ]
      },
      "body": {
        "body": [
          {
            "bigtitle": "一、Emphasize",
            "bigsections": [
              {
                "subtitle": "多才多藝的人",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我從台南北上讀書，鄉下人進城，覺得系上每個人都好厲害。很會讀書是基本功夫，其他課外活動例如搞社團的、運動的，連打電動都打到極致，覺得系上的高手實在太多了，讓我大開眼界，這也是念電機最大的收穫，每個人在不同領域都很厲害，真的蠻佩服同學們的。台大是一個非常棒的地方，高手雲集，從別人身上看到自己不足的地方，也更有機會找到自己的優勢。“人”是我覺得念電機系這段時光最寶貴的經驗。"
              },
              {
                "subtitle": "各式各樣的課",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我現在的專業算是金融業，在大學時的課外活動跟金融都非常遙遠，電機系本身的課業就已經很繁重。當時有參加一些社團，基本上是吃喝玩樂團之一。不過多辦活動，觸及到流程的安排與管理也對於自己的成長有所幫助。大三大四的時候已經打算出國，不像其他同學需要全心準備碩士班考試，於是我花了很多時間去修了其他學院開給自己系上的課，例如經濟系的經濟學原理跟個經，心理系的普通心理學、社會心理學，財金系的投資學，擴增了自己的眼界。 至於為什麼會走到金融這一行，說來也是誤打誤撞。大四時去修了財金系必修的投資學，開始接觸到例如CAPM等財金學的重要理論，需要統計與其他數理概念。我發現我相當喜歡運用數學去解決財金領域的問題，也就帶領我先走上碩士班雙修MBA與MS in Computational Finance的路子。衍生性金融商品需要處理許多非線性的問題，同時需要數理和金融知識，畢業後也就順理成章地走上當時投資銀行界中最夯的幾個領域之一，數理也成了我最重要的核心技能，電機系的訓練非常的 crucial。隨著年資的增長逐漸走上管理職，還是深覺除了數理的的核心技能之外，培養全方位能力的重要性，變得更為明顯。至於大學推薦的課程，我個人覺得理則學或是語言邏輯之類的很值得推薦。過去我們年代有哲學系老師開的課，不知道現在還有沒有。歷史系呂世浩老師的課非常熱門，引導大家如何思考與判斷，都是屬於這類的基本功夫。無論科學或文史，邏輯思考都會是一個最基本的訓練，萬流歸宗。最後，有一句廣告標語我相當認同，｢ just do it ｣，不要｢ just talk ｣。"
              }
            ]
          },
          {
            "bigtitle": "二、Explore",
            "bigsections": [
              {
                "subtitle": "畢業方向",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "其實那時候也沒有很確定。我知道自己的抽象思考 (電磁學，哈!) 比較弱，實作是明顯的強項，個性上比較喜歡廣而淺、而不是鑽而深。所以那時候決定去讀商學院，不過又選擇了數理比較強的CarnegieMellon，拿了兩個碩士，除了MBA，另外一個degree是財務數學，發揮我們在數理的所長。幸好這樣的academic background支持我進入金融業，說來也是有些運氣成份。"
              },
              {
                "subtitle": "申請困難",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "CMU接受了我的申請，我還是被一些名校例如MIT，Stanford，Harvard 等reject。我覺得很公平，畢竟很多申請人的學經歷都超強的，GPA 4.0、GMAT 780、工作超過五年的，只能儘量修練自己。"
              },
              {
                "subtitle": "跨領域",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "專領域跟跨領域都要克服很多挑戰。跨領域中，整合可以算是最大的挑戰。儘管無法所有相關的領域都能精通，但至少有幾個領域必須是自己的核心技能。其他領域至少也必須能夠與專業人士溝通。"
              },
              {
                "subtitle": "出國環境",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "融入當然還是會有一定難度啦，我們本來就是外國人的身分，不過還是個性因素主導。脫離了舒適圈，大家還不都適應過來了，時間一久自然就習慣了。缺點就是花很多錢吧，優點的話主要還是眼界。我們電機系真的很棒，有一流的師資陣容跟研究環境，全球的排名也是很前面。留在系上繼續深造，一來省錢，二來可以跟著熟識的老師不間斷地繼續深入作研究。但是國外唸書的話，可以體驗不同的文化、同學，然後又遇到一群也是很厲害的人。外國的好手也多，到美國之後也能了解不同環境做人做事的方法。只能說各有優缺點，有時還是要靠一點運氣，可能幾年後或幾十年後才會證明當初的選擇。"
              },
              {
                "subtitle": "先備知識",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "書本上資源很多，不過以初學而言，自修的方式比較不容易有系統性。因此我更推薦去修課，例如修財金或經濟系必修的核心課程，包括投資學、公司理財、經濟學原理這類課程。我大學時期其實不太認同“玩”股票，但卻投入了證券業，依靠的還是金融相關學歷跟工程上興趣。我在美國讀書時，一時覺得好玩，用C++ coding了option pricing model，再用當時流行的JavaCafe設計了介面將這個model放到網路上。畢業前曾飛到新加坡面試工作，看到主管桌上厚厚一疊履歷原本覺得沒有希望了，但是跟主管吃飯的時候突然想到自己寫過一些程式，在公司電腦上的IE示範給主管看，主管眼睛一亮，他也成了我第一位主管。基於興趣，我努力的把一件事做好，幸運降臨，就這麼簽了我第一份聘僱合約。"
              }
            ]
          },
          {
            "bigtitle": "三、Establish",
            "bigsections": [
              {
                "subtitle": "金融工程概念",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "金融工程是用數學方法去解決金融界實際遇到的問題。以選擇權 (認購權證) 為例，選擇權的payout是非線性的，要做定價時需要一些數學模式，像是stochastic calculus、boundary condition。這些演算也會牽涉到programming、algorithm。如同我們用數學解決電機中的問題，金融工程是以數學與電腦解決金融上的問題。"
              },
              {
                "subtitle": "金融工程前景",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "很可惜，我覺得在台灣前景不佳。主要是規管限制金融商品在台灣的發行，因此金融工程人員多數在香港、新加坡、東京、上海等地發展。台灣的金融業還停留在手工階段，沒有連結科技、效率、與系統化，所以常常出紕漏。這方面要進步不是那麼容易，特別是已經落後了許多，而全球各金融中心也持續進步。這是對於台灣本地的金融工程發展前景而言。對於對金融工程有興趣的同學，發展的前景還是不錯的。"
              }
            ]
          },
          {
            "bigtitle": "四、Expand",
            "bigsections": [
              {
                "subtitle": "工作態度",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "進入職場之前，我對於股票債券期貨等等金融商品完全沒有經驗，進入職場後才開始學習如何當交易員。對新入行員工面對一個新工作，態度還是最重要，必須要努力創造自己的價值。我在做第一份工作的時候，覺得公司真好，竟然付我薪水讓我進公司來學習，當然很快地我也開始直接幫公司增加收入，相對應地公司也很慷慨地支付我工作獎金，這完全是一個互贏的概念。"
              },
              {
                "subtitle": "累積經驗",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "在證券公司工作，每個部門的專業分界非常大。我覺得總經理只是一個管理職的頭銜，以調合部門運作為主。在管理職之前的交易員資歷，在業界的影響力其實更大。當時我手上的台股交易量，大到全市場的百分之五。當時的主管也很信任，在買賣的時候他不會過問，就是一個互相的信任。但是我也必須要完全按照公司的規範去進行，每年的利潤相當不錯，也很穩定。大家如果真的有心要往金融界發展，還是要找到自己的興趣。總經理這種職位無法強求，價值也比不上某個領域的專精。當初剛入行時對於這個行業也是一知半解，進去之後才慢慢學，積極去expose yourself讓別人來認可自己的價值，要differentiate yourself。"
              },
              {
                "subtitle": "適應壓力",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "金融交易是個壓力極大的工作，如果神經太小條，太容易被情緒影響，做這行也許不是那麼適合。做事要仔細，心則要放寬一點，看到漲跌不能太緊張，不然身體受不了。交易員這種高壓行業也做不了多久，大概就是十幾二十年了。外資交易員手頭上都有幾十億幾百億的資金，純粹是按照我們的判斷去建立投資部位，目標在儘量降低風險的情況之下增加交易獲利。當然這樣的授權金額相當大，在台灣的公司不太可能發生。"
              },
              {
                "subtitle": "享受辛苦",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "1997年來到香港，剛去的時候舉目無親，廣東話不會講，一直到一年後才第一次跟在港台灣人一起吃飯聚會，和現在香港到處都是台灣人的情況是完全不同。每天的生活就是早上七點出發，路上買一個麵包和咖啡到公司；中午在公司吃便當；晚上八點下班，路上順便買個便當打發晚餐，每天就這樣的routine。連週末都拼命看書補充不足，研究公司的文件。辛苦是辛苦，不過還是很enjoy這份工作，值得付出很多的心力。"
              }
            ]
          },
          {
            "bigtitle": "五、Encourage",
            "bigsections": [
              {
                "subtitle": "給大學部的建議",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "基本上還是希望能夠 Follow your heart 之餘，還是要 Just do it，不要虛擲光陰。再來就是健康很重要，無論是什麼工作，心臟要夠強、體力要夠好。"
              }
            ]
          }
        ]
      },
      "annotation": {
        "annotation": [
          {
            "job": "特別感謝：",
            "contributer": "梁維仁"
          },
          {
            "job": "撰寫：",
            "contributer": "藍珮瑜 Steven Huang 林昱嘉 陳柏瑞"
          }
        ]
      },
      "id": "1602"
    },
    {
      "top": {
        "name": "2008級 趙式隆",
        "experience": ["台灣矽谷創業家協會理事長"],
        "hashtags": [
          "系友專訪",
          "首PO",
          "趙式隆",
          "2008級",
          "B93",
          "創業就像搶銀行",
          "台灣矽谷創業家協會理事長",
          "學悅科技Zuvio創辦人",
          "台灣虛擬及擴增實境產業協會共同發起人",
          "網路與多媒體實驗室助教",
          "台大創創學程",
          "保持好奇心勇於嘗試"
        ]
      },
      "body": {
        "body": [
          {
            "bigtitle": "一、談創業經驗",
            "bigsections": [
              {
                "subtitle": "台灣矽谷創業家協會",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "台灣矽谷創業家協會，是一個非營利組織。過去台灣有很多人到了矽谷去，然後在RCA（編按：Radio Corporation of America，美國無線電公司）的訓練下回來，創造了今天的新竹科學園區。那當然現在的台灣，其實在新創產業這一塊遇到了一些瓶頸，就是我們有人才可是沒有市場跟資金。在現在這個時代，政府也送一些團隊到矽谷去，但是到達矽谷的時候我們就會發現，台灣團隊要存活下來不是那麼容易。所以我們希望能夠做出一些橫向連結，也許可以增強台灣在矽谷的生存機會。另一方面我們也希望，不見得能夠活下來的團隊，可以將一些矽谷的精神帶回台灣。例如，在矽谷他們非常鼓勵失敗的經驗，然後你再重新站起來，但在台灣其實沒有成為一個共識，這是在這個環境上面一個很辛苦的地方。我現在做的事情蠻雜的，基本上就分成這幾個面向。"
              },
              {
                "subtitle": "Zuvio",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "Zuvio做的是一個教學互動系統。一開始，大概三四年前在葉丙成老師協助下和幾個學弟一起做的一個專案，這專案主要解決的問題是，上課時老師和同學的互動問題，老師在上課問問題，學生都不見得會回答；或者學生心裡可能有些想法，但是不敢跟老師說。那時候我們就想說讓學生可以透過他們的手持裝置跟老師互動，從原本一個OPEN-SOURCE project做到現在。這間公司最開始的時候狀況是這樣：就是當年我在教的一些課遇到一些問題，可能當我在帶各式各樣的課程，例如機率與統計、微分方程，我問學生：有沒有人有問題？即使在教了幾年經驗之後，知道這個段落大家都會有問題，但大家也都不會發問。一到下課的時候，你知道台灣人就很喜歡偷偷來，然後大家都會圍過來，結果每個人問的問題都一樣，然後助教我就走不了，就會很不爽！很多人心裡有問題不問，考試的時候才不會寫，我覺得這件事情非常不行。當時我們從來沒有想過這個事情可以成為一個business。直到第一個學弟跟我們說，他要離開去上班了，但可能還是可以fully-support這個project。那時候我們就說：「好啊、你就去上班、有空來support這個project。」然後你會發現當人去了台灣的科技公司上班之後，上班以外的時間不是在加班就是在睡覺，所以基本上他是沒有時間來support這個事情的。那後來第二、第三個學弟再跟我們提一樣的事情的時候，我就知道這時候不行了，我們要有一個若干的Business model。所以那時候我們就把公司開起來，很幸運地一直做到今天。我們的初衷很簡單，就是解決老師和學生之間的互動問題。當學生和老師之間沒辦法透過語言來做很自然的溝通的時候，我們希望透過手持裝置來改善。我們現在仍然一直專注在這個點上面，這是一個問題，我們相信我們能提供最好的一個解決方案。"
              },
              {
                "subtitle": "創業的挫折",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我覺得正常在創業的人不會講挫折，因為創業必然要是樂觀的。每天都會遇到一堆很糟的事情，如果沒有很好的調適，通常無法繼續往下。我們公司有遇到一些小挫折，就是基本上是獲利了，但主要的客戶是學校和大型公司，開票期的匯款interval是很長的。這就很常遇到一件事情：下個月大家要領薪水，沒有錢怎麼辦？這時候你就要自己從口袋掏錢出來把這個事情墊掉，那你有沒有這個Guts？這種事情一開始做會覺得天啊！怎麼是這樣。但後來久了之後會覺得創業這樣是常態嘛。也常常會被罵，被員工、使用者、各式各樣的人罵，但被罵久你就會習慣了。剛開始會覺得說生活中的每件事都是挫折，而現在已經是生活的一部份了。"
              },
              {
                "subtitle": "創業像甚麼？",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "創業這件事情很像搶銀行。怎麼說？大家應該看過一些電影，就籌備過程而言，通常主角需要很棒的團隊，技術高超的駕駛、開鎖專家、爆破專家...各式各樣的人；再來會需要一個很縝密的計畫，去想每一步要幹嘛；第三件事情是計畫永遠趕不上變化，當企劃看似完美的時候，永遠不知道中間會遇到哪些突發狀況。就結果來看，創業跟搶銀行一樣，如果成功，會變得很有錢，當你的公司被併購或上市的時候，你會變得很有影響力，做到任何你想做的事情…但是，他也很容易失敗。我覺得創業跟搶銀行最像的事情是，他的成功機率非常非常低，而且創業成功的機率可能不比搶銀行的高。我們很常看到非常有潛力的新創團隊，在短短三年內就消失了。"
              },
              {
                "subtitle": "電機系學生的特質與創業",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我自己最欣賞的一類創業者是所謂技術型創業者，他們有著一個靈魂，叫做駭客精神。我講的駭客不是這些搞破壞的駭客，駭客是一群能自己打造工具的人，當一個問題在你前面時，你又沒有工具可以用的時候，你會去想怎麼樣有能力去把它打造出來，所以我最欣賞的是有技術背景的一群人，可以自己打造工具。我想電機系的人大部分都有這樣的條件，為什麼？因為我們都看到電機系的學生在這裡受到四年的摧殘，如果能順利畢業的話，這群人就算一開始不聰明，到最後你也必須學會在很短的時間學會一樣東西，即使你學不會也要有辦法在答案上寫出來。我覺得在臺大電機系這個高壓力的環境下，人的能力是志不在話下。還有第二個很大的優勢，我們有非常多優秀的同學，在一起可以做很酷炫的事情。我們每一年電機之夜就是辦得超盛大，讓大家以為我們花很多錢（還是真的花很多錢這我不清楚）。最後一個事情是，在這個人脈網絡裡面，台大電機系佔了一個很重要的角色。很多人大學的時候功課非常爛，大學畢業之後轉換跑道，我們有人在華爾街、在矽谷、在各式各樣的產業，甚至有人是書法家或作家，台大電機系有非常多，你可以想到做各式產業的人都有。甚至像我今天早上跟我們配合的會計師事務所開會，那邊的會計師就是台大電機系畢業的學長。所以我覺得，台大電機系有各種面向，當你想要走任何一條路的時候，都有一個模範可以去參考。回頭說明，為什麼這對創業有幫助？我覺得創業有兩個要件：第一個是所有的事情都有一個死線。你必須要在死線之前完成所有事情，所以你快速學習的能力很重要，而抗壓的能力很重要。十天前公布的作業，你可能前面九天都在打電動，最後一天要把事情做完，當有個死線、你就可以把事情完成、而且是完美的完成，而你前天晚上沒睡覺，隔天上去發表，還是可以講得像前一天睡得很飽一樣。我覺得在臺大電機系這個訓練在人的素質上是一個非常重要的要件。再來是一個統合型的能力，因為任何一間startup都跟大公司一樣，只是startup比較小。大公司每一件事情都不能省略，法務、財務、稅務...所有事情，只是startup人比較少，所以每個都要會。那在台大電機系，你有豐富的學長資源，或是你在大學的時候，如果你願意你可以做很多的事情，在大學就可以很早的體驗到這些事情的重要性，特別像台大電機系活動辦得這麼多，可能是拉贊助之類的，我覺得這些事情都非常重要。我覺得這些都是台大電機系未來要創業一個很重要的基礎，因此在這邊我不會不鼓勵大家創業，如果連台大電機系都不創業，那其實台灣沒有希望了。"
              }
            ]
          },
          {
            "bigtitle": "二、人生迄今的里程碑",
            "bigsections": [
              {
                "subtitle": "求學時期",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我現在三十歲，過去不同階段有不一樣的想法。小學的時候打籃球，而且打到全國冠軍，以為未來會成為運動員。後來家裡要我讀書，我就讀書。從國中讀到建中資優班，比奧林匹亞保送進電機系，中間的過程也有很多想法，像比奧林匹亞會覺得自己是不是該對基礎科學有偉大的貢獻。可是那時也學習寫程式，覺得寫程式也是超級有趣的事情。後來在家教的過程，開始對於教書有興趣，教到別人學會是非常有成就感的，所以那時候我想當大學教授。當時聽說要出國回來才能當，所以那時候有準備出國，但因為家裡有點狀況，最後就留在這裡讀博士班，希望留在這裡當教授。但是當真的開始在學術界，我前前後後在台大電機系待了12年，我發現所謂這樣的學術圈跟我想像的不太一樣，我就開始想像這到底是不是我要的生活？"
              },
              {
                "subtitle": "創業與目標",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "因為Zuvio也開始在動，我就想說不如就先作為一個創業家、繼續做這樣的事情。但是開始作為創業家這個事情後，我就回歸到去思考我這個人想做什麼事情，我覺得我終其一生在追求的目標，其實是讓這個世界不要再有階級複製，去解決階級複製這個問題。當一個社會沒有辦法提供一個扭轉的機會，沒有辦法讓社會底層的人能抓到一條線去提升自己的社會地位是不合理的。舉例來說，賈伯斯是來自於相對地位比較低的地方，但他在美國能夠成功，於是很多人講美國夢，講得就是當下在美國這樣的環境，不管你的出生是什麼，都有機會可以成功。我就開始思考，這背後的原因到底是什麼？我發現，其實要打破階級複製的兩個最重要的要素：第一個叫做教育，所以那時候我想要教書，現在創業也是做教育相關的；第二個叫做醫療，當大家有健康身體的時候，才能夠在一個合理的水平線上做競爭，但醫療是一個資金密集的產業，我自己的想法是，當我把現在做的這些微創新、小玩具，得到初步的成功之後，我希望把這個東西投注在醫療上面，試著去改變、讓這個世界變得更好。這是我最想要做的事情，人生是個最佳化的過程，你永遠不知道絕對的最佳化是什麼，但當你走每一步的時候，你可以針對下一步做最佳化，我們叫他做Greedy Algorithm，其實你走出來的路不會太差。這是我現在三十年一點點的經歷、能夠分享的差不多是這樣。"
              }
            ]
          },
          {
            "bigtitle": "三、給大學部的建議",
            "bigsections": [
              {
                "subtitle": "保持好奇心、勇於嘗試",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "對於一般的大學生，我通常會給一個建議「保持好奇心、勇於嘗試」。大學是人生中成本最低的階段，過了這階段，會發現每一件事的成本都非常高。假如你已經結婚了，還有小孩，你敢不敢再去做一件很冒險、可能讓你傾家蕩產的事情？不見得敢。當你年紀越大，擁有得越多，就會越害怕。特別是在這個資訊爆炸的時代，所有的事情都是透明的，可以看到很多機會，但你會不知道這些是不是真正很好的機會，不知道自己是不是真正喜歡，那我覺得應該是加法模式，而不是減法，看到這東西覺得喜歡，就嘗試看看，覺得不好就趕快換掉，在這一個過程裡面，保持對很多事的好奇心是很重要的，很多事情不試著做，就不會知道事情最後會怎樣。"
              },
              {
                "subtitle": "一句話談談電機系？",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "對我來說，電機系像是一個家，我在電機系待了非常久，從大學到現在12年，幾乎是我人生一半的時間了。所以，這邊的每一樣東西我都很熟悉，哪邊改變過了我都知道，看過很多很多事情。這裡對我來說是一個歸屬感很強的地方、我覺得對於很多電機系的學生來說，在這邊待了大學四年，其實你在系館花掉的時間遠比其他系的人多，因為你熬夜的時間很多、你在這邊半夜做作業的時間很多、然後你在這邊為了要跟同學討論、你不得不去學校做很多很多事情。我覺得相較於很多系來說，電機系是個向心力很強的地方。即使我在大學的時候不太參加系上活動，到現在這邊畢業的每一個學弟妹，名字可能叫不出來，但是臉都熟悉啦。我覺得自己對這裡有非常深刻的感情。"
              }
            ]
          }
        ]
      },
      "annotation": {
        "annotation": [
          {
            "job": "特別感謝：",
            "contributer": "趙式隆"
          },
          {
            "job": "撰寫：",
            "contributer": "許秉鈞 袁培傑 劉禹辰 曾耕森"
          }
        ]
      },
      "id": "1603"
    },
    {
      "top": {
        "name": "2000級 胡一天",
        "experience": ["源鉑資本Kyber Capital執行長", "專業投資人與金融觀察家"],
        "hashtags": [
          "系友專訪",
          "胡一天",
          "ThomasHu",
          "2000級",
          "B85",
          "Blockchain區塊鏈",
          "Ethereum以太坊",
          "KyperCapital",
          "源鉑資本執行長",
          "InfiniteStudio無限工作室",
          "FinancialEingeering",
          "哥倫比亞大學金融工程",
          "ColumbiaUniversity",
          "電機系與法律系財經法學組雙主修",
          "跨領域",
          "Hongkong",
          "金融觀察家",
          "專業投資人",
          "先進到適合發展的環境再積極創造機會"
        ]
      },
      "body": {
        "body": [
          {
            "bigtitle": "一、求學相關",
            "bigsections": [
              {
                "subtitle": "Why NTUEE?",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "喜歡人文科學，也認為了解基礎科學和新科技很重要（民國96年入學時，互聯網、高科技已開始發展）所以選擇了綜合型大學的台大。而在電機系的選擇很多、可以認識的人也很多。電機系跨界的特性，可以在廣泛接觸各種知識後，深入研究。"
              },
              {
                "subtitle": "目標：投資強者同學",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "自己在電機系不一定能特別出類拔萃（成績、興趣…），而大學時認識很多強者同學，將來很多會研發東西、發展事業，我就作投資他們的人。因此，大學時的關鍵放在找到有革命情感、志同道合的同學。不斤斤計較分數，也不以到園區當科技新貴為目標。"
              },
              {
                "subtitle": "大學生活：雙主修電機、法律",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "自己有英語優勢，當時想多修個財金方面的專業，（但是財金系無法雙修，自己又不想只有輔系），所以選了法律系財法組。當時讀了華爾街Robert Rubin的故事：Robert Rubin耶魯大學法學院畢業後，當了兩年律師便進入Goldman Sachs從riskarbitrage 做起，待了二十七年，之後在柯林頓時期擔任財政部長。有了這個故事在心裡後，更加堅定自己念法律系的動機。法律系的課程多以面對國考為教學目標，自己的目標不是國考，所以在念的時候會多搭配相關的資料閱讀。例如修憲法課的時候，自己閱讀政治學、歷史、英美憲法相關的文獻。(P.S. 美國憲法起草人之一Hamilton是Columbia University的校友)大學時用空閒時間多學了一些法律知識，多了這方面的素養。現在做生意、投資、收購融資的時候，自己就有相關的法律概念。像是之前在香港做收購、在紐約做融資看一家公司的時候，看上市公司的財報，決定在什麼時間點買，需要相關的金融常識、法律素養，綜合判斷。"
              },
              {
                "subtitle": "系上印象最深刻的課：微分方程─以物理模型思考",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "系上印象最深的一門課，是「工程數學─微分方程」（林清富教授）。修習這門課時，我和另一位同學找了兩本教科書自行研讀。其中一本是關於微方題目與物理意義的連結。印象最深刻的是學習的態度：課堂上教了很多解題技巧，所以個人更要重視學習的紮實度，例如了解微方背後物理模型的建構。將「空的」數學賦予實質的物理意義，才是學工程的人該有的態度。其實金融中可以被量化的面向，也可藉由這類物理模型，加入邊界條件 (Boundary Conditions)解決。但商業投資上更看重直覺與悟性。"
              },
              {
                "subtitle": "探索興趣：Keep yourself open-minded, no stereotypes",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "保持開闊的心胸接受事物，不要受到主流價值觀、刻板印象影響，十年前、十年後流行的東西不一樣。台積電很熱門、可以賺不少錢，但不是大家都需要去台積電。所以不要為自己設下限制，大學時多方嘗試，找想做的事。讀完該讀的基本資料，問不懂的問題，找出答案，進而為自己創造機會。"
              }
            ]
          },
          {
            "bigtitle": "二、台大電機畢業之後",
            "bigsections": [
              {
                "subtitle": "Going abroad： 接近國際金融市場",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "金融中心是一個情報集散地（像是臺灣的新竹科技園區，相同類型的產業高密度聚集）。我前兩個工作的地點（紐約、香港）便是世界的金融中心。讓自己置身國際大市場，獲得的體驗跟在臺北差異甚大。以國際大市場而言，身在臺北有個先天的劣勢，現在跨國金融機構很難把臺北年輕的學生視為招募高端的金融、商管儲備人才的首要目標。也建議未來想從事傳統金融產業（即不包含Fintech等新興產業）的新鮮人，不要將自己侷限在台灣。"
              },
              {
                "subtitle": "Why Columbia University?",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "退伍後申請了五所學校(Stanford, MIT, Cornell, U Penn, Columbia)的電機研究所，Columbia當初不是我的首選，因為他的電機不是最好的。不過電機不是我考量的重點，關鍵是要出國，先到那裡再說。我想去紐約，所以就選了Columbia。事實上，當初申請U Penn上的System Engineering，Cornell沒有拿到獎學金，而Columbia本來沒有上，但是另外寫信給教授後，教授看了我的背景，覺得我是個有趣的人，決定讓我去當PhD學生。開學前去辦公室找他，教授表示他當時對電機沒有興趣，正在研究神經科學相關的領域，他說我先看看，一年之後再決定是否跟他做研究，想轉到別的地方他也會支持。Columbia的制度是PhD student學籍是掛在GSAS (Graduate School of Arts andSciences)，而非自己原本的工學院。只要能負荷，修什麼課都可以。我利用這段自由的時間，大量地累積金融相關的知識與人脈，也積極參與大型金融機構的校園徵才。在GSAS的一年，我努力轉到Financial Engineering，因為知道華爾街是很現實的，沒有對的資歷、關係，連面試的機會都不會有。像我這樣剛來到美國，沒有身分，大學部也不是唸本科，一定要有別的策略。所以我決定拉長戰線，除了學習之外，更要多接觸可以幫助自己找到工作的人。這一年修了很多FE領域博士班等級（比較難）的課，想說對之後轉系可能有幫助。後來我也以財務工程碩士畢業。總而言之，學校、都市、所選的內容，跟你的個性、能力是否匹配，非常重要。在對的環境，自然會遇到對的人，而這些好的關係也能從學校延續到職場上。我在紐約的第一份工作，也是哥倫比亞大學一個教授推薦的。"
              },
              {
                "subtitle": "Why Financial Engineering?",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "大學時買過國外股票、基金，在dot com泡沫爆破前有賺到一些錢，覺得投資有趣。金融 (Finance) 是一個可以學以致用的領域，學原理、實戰、有基本素養後入行。金融業的本質其實也是科技業，因為科技的進步，創造出新的金融服務。此外，金融很刺激，每天都有新的事情發生，每天都要閱讀大量資訊、快速學習，否則難以應付競爭激烈的市場。"
              },
              {
                "subtitle": "同學的互動",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "經常追蹤同學們做的領域、事情，知道現在最新的東西是什麼，以及他們對這個領域的其他想法。另外，自己本身的知識背景，也能容易的了解他們討論的內容，對選擇投資目標幫助很大。"
              }
            ]
          },
          {
            "bigtitle": "三、工作相關",
            "bigsections": [
              {
                "subtitle": "畢業後第一份工作─紐約",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我在商學院修了好幾門，其中一門是關於槓桿收購，學到很多與華爾街相關的實務知識，很實用。當時的教授的老朋友在紐約剛成立了新的基金公司，教授推薦我去試試，後來面試很順利，先從實習開始，後轉正職。一開始是做計量選股模型的工作，後來開始參與基金操盤。一開始是專注全球價值股，2008年時與另一名資深分析師接手一檔中小型成長股基金負責看全亞洲（包含日本）的股市，也有參與大老闆的旗艦基金操盤，最高曾負責過2億5千萬美元的部位，也親身經歷了百年難得一次的全球金融海嘯。"
              },
              {
                "subtitle": "從紐約到香港",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "當初覺得在紐約繼續做的話，薪水越來越高，但人生不會有太多變化。後來因緣際會，認識了中華開發的高層，決定在2011年離開紐約，加入開發在香港成立的新部門，與另一位新加入的香港同事一起經營高收益收購融資的業務。從2011年到2015年，陸續評估了一百多個融資案，做了十二件，覺得自己在公開市場與私募市場都有相當程度的歷練了，而且自己一直有在關注新創投資，也有天使投資出場的經驗（台大電機學弟沈育德創辦的StorySense Computing），看到金融科技與區塊鏈（blockchain）應該會有巨大商機，於是跳出來成立源鉑資本。"
              }
            ]
          },
          {
            "bigtitle": "四、給學弟妹的建議",
            "bigsections": [
              {
                "subtitle": "培養跨界能力",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "「跨界」愈來愈重要，例如：區塊鏈（Blockchain）需要懂法律、財金、科技，非常值得關注。職場分工因應工業走向後工業的過程，資源不夠，為了效率而集中化管理。然而現在環境改變，教育模式卻沒變，職場分流沒變，人的觀點也沒變，就會被時代拋棄。台灣目前需要突破的就是這類思維的問題。大學時要花時間做紮實的事，在一兩個領域紮根，也不要侷限在電機系。電機系課程設計使我們可以看更多的領域，雖然都是在電機的領域，也需要多用心才能看出課程間連結的意義。此外，修課需有長期的策略，但仍需留有彈性，隨著時間修正，因為自己的預測不一定正確。"
              },
              {
                "subtitle": "累積實戰經驗",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "台灣學生基礎很好，但需要更多實戰經驗。進入好的公司，會給你很多學習資源，然後拋問題給你想。以石化業為例：怎麼搞懂化工廠？業界怎麼看、投資界怎麼評估？要看一整個產業的股票，包含同行當中的競爭者，也需要分析原料成本。每個地區（北美、中國、日本...）都有它自己的邏輯。這些無法透過課本得來，需要實際跟業界專家與資深分析師學習，自己再多做功課。"
              },
              {
                "subtitle": "一定要去美國？",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "金融的話，第一份工作在面向大型市場（e.x. 中國或美國）、跟國際接軌（e.x. 紐約或香港）的金融中心做，會比較好。台灣公司無論是本土或外商，對國際市場的關注不夠，專案接觸面不夠廣，不容易學到正確的基本動作。有心在中國發展的話，到北美去留學、工作有好有壞。中國大陸市場瞬息萬變，很多訊息需要在當地才知道。紐約的高度比較高，是好平台，但真的要做到很「接地氣」（ on the ground） 的東西、做大事業，比較難。大部分人在那邊可能當小螺絲釘，但是能有相對單純的工作環境貢獻專業。亞洲市場複雜很多，有機會迅速竄升。上海以後會更加重要，香港有獨特地位，但重要性逐漸下降，北京平衡兩者，都是不錯的選擇。"
              }
            ]
          }
        ]
      },
      "annotation": {
        "annotation": [
          {
            "job": "特別感謝：",
            "contributer": "胡一天"
          },
          {
            "job": "撰寫：",
            "contributer": "吳奕萱 楊程皓 毛弘仁 江庭瑋 蘇峯廣"
          }
        ]
      },
      "id": "1604"
    },
    {
      "top": {
        "name": "2006級 高奕豪",
        "experience": ["Quantitative Researcher @Two Sigma Investments"],
        "hashtags": [
          "系友專訪",
          "高奕豪",
          "2006級",
          "B91",
          "計量金融",
          "Stanford",
          "InformationSystems",
          "TwoSigmaInvestments",
          "QuantitativeResearcher",
          "Google",
          "Yahoo",
          "McKinsey",
          "GoldmanSachs",
          "ACM_ICPC",
          "數學與資訊奧林匹亞競賽"
        ]
      },
      "body": {
        "body": [
          {
            "bigtitle": "一、序言",
            "bigsections": [
              {
                "subtitle": "序言",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "因為台灣的產業結構和升學制度，使得電機系收納了全國理工科學生中的菁英。這種同儕關係是個得天獨厚的資源、讓我在電機系四年從同學身上學到的不比從教授身上學到的來得少。到了美國後，在史丹佛求學的日子，又讓我再次見識到台大電機四十年來累積的龐大人際網路，也因此不管是在校內校外都得到很多系友前輩的幫助提攜，受益非常多。"
              }
            ]
          },
          {
            "bigtitle": "二、大學時期",
            "bigsections": [
              {
                "subtitle": "大學時期的成就",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我在大二那年跟兩位資訊系的朋友參加ACM主辦的程式設計比賽，一路拿到了全球第六名。這個過程中讓我學到不少團隊合作的技巧，也讓我看到世界之大，加深了我日後想要出國唸書的決心。另外就是我很會考試，所以成績很好，大學拿了八次書卷，但這是一個出了社會就沒用的技能。事實上，這是個上了研究所就沒有用的技能。（問：所以，做研究的能力相較比較重要嗎？）是的。還有我是電機營的教學組組長，我認為是一個滿好玩也滿有收穫的經驗。另外我是系泳的，那時候有一群熱血的人在弄，我們也在想萬一有一天這一群熱血的人不見了，那還會不會有系泳。"
              },
              {
                "subtitle": "最深刻的一門課",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "因為後來博士研究的關係，大學部對我而言最有用的是工程數學方面的訓練，尤其是線性代數和統計機率。這種理論的課，通常比較雋永，不太會隨時代而汰換。另外就是我修了當年的網路與多媒體實驗。那是個非常辛苦的過程，但我學到了兩樣很重要的東西。一個是上網讀說明文件來寫程式，另一個是工程團隊的分工。這兩者讓我後來受用很多。外系方面，我修了不少資訊系的課，都非常有用，但那應該不能算外系。真正的外系，我想到的是我修了經濟學當通識，這個在生活中非常實用。此外就是我去修了國企系的管理學。那門課雖然沒有太多硬知識，但讓我見識到了另一種思維，並結識了很多商學院的朋友，我從他們身上學到很多。我在大學的最後一年有幸被選進一個McKinsey的訓練計畫，也是受了他們的啟發。不過如果能讓我再來一遍的話，我會想多修一些理學院和文學院的課。我當年修課太重實用性，其實很多文理方面的知識對人生影響很深遠。我一直覺得身在台大最大的好處就是我們是一個綜合性的大學，什麼系都有，而且幾乎都是全國最好的。當年應該多把握這方面的資源。我後來選擇去Stanford唸博士，也有部份是受此啟發，希望能到一個綜合大學去繼續學習。"
              },
              {
                "subtitle": "關於專題研究",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我當年做過兩個專題研究。第一個是跟 李琳山教授做的，用機器學習的方法來判斷中文語音中的情緒。第二是個和 陳宏銘教授做的，如何用光場信號來偵測實景中的深度。兩個都是非常好的經驗，讓我在畢業前就大概知道做研究是什麼樣子。跟一般修課寫作業考試不一樣，做研究沒有明確的路徑，也沒有明確的終點，投入的時間也可以沒有止境。我後來博士論文做的是機器學習，現在的工作是在做統計信號處理，都跟大學專題有關。"
              },
              {
                "subtitle": "國外研究所 CS v.s. EE",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "當初的考量除了申請難易度外，主要是我還沒有確定要專攻的子領域，而覺得選擇EE可以保持更大的彈性。但其實美國科系間分界比較模糊，所以選哪個系影響不大。我當年的指導教授有三個系的身份，分別是電機系、工管系和資訊系，同時還指導過統計系的博士生，所以非常多元。"
              }
            ]
          },
          {
            "bigtitle": "三、博士碩士時期",
            "bigsections": [
              {
                "subtitle": "PhD及MS間做選擇？",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "在我那個年代，我非常崇拜Google的兩個創辦人Larry Page和Sergey Brin。他們把在Stanford念博士時的研究拿來創業，我當時非常崇拜這種路線。所以覺得如果我念博士也可以做到這樣就太好了。（問：可是博士不是會念比較久嗎？有些人會因為花比較多時間（在唸書）就比人家晚幾年出去工作。）這是沒錯。如果是從長遠來考量，你可以想像這是一個比較長期的投資，希望十年二十年以後能夠回報。但這的確是一個有風險的投資，畢竟你比別人多花了3、4年（一般碩士1～2年，博士5～6年），要有把握這3～4年對於你的職涯是有加分的，要真的學到東西，而不是在混學位。"
              },
              {
                "subtitle": "對Stanford的印象",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "首先是，這裡的教授非常沒架子。舉例來說，有些大牌教授會去旁聽其它系的課。這種精神我覺得在亞洲文化裡比較難見到。第二是見識到東西教育著重的不同。舉例來說，我當年修機器學習這門課，我發現考試的時候亞洲來的留學生都可以輕鬆電爆美國同學，但到期末專題時美國同學的成果卻可以狂電我們。這反應出兩者著重的地方不一樣。另外就是對研究興趣的強調。有一位我很尊敬的教授跟我說，如果你找到一個適合你的博士論文題目，你應該要常常嘆口氣說，唉，人為什麼要吃飯睡覺上廁所？要是可以不用做那些事，讓我專心研究這個題目，該有多好啊。至於Stanford，我前面有提到它是個綜合大學，而我很喜歡這樣的環境，在這種環境裡你可以認識很多領域的人才，有時候我甚至覺得，在宿舍餐廳裡面聊天所學到的不比在教室裡面上課來的少。（問：那會不會有人多花好幾年在探索要做什麼題目，就念很久？）會，所以我也有認識幾個待比較久的博士生，因為他們想多做點事情。（問：那學長是領獎學金出去的，會不會在探索過程中花太多時間，最後學校就不給你獎學金？）在美國他們會覺得，收一個博士生其實有點像是僱傭的關係，而不只是師生關係，所以你必須要有產出、要有表現，他們才會願意維持你的獎學金資格。"
              },
              {
                "subtitle": "赴美留學的文化衝擊",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "其實我待在美國那麼久，基本上沒感覺到我有被歧視過，倒是有發生過一件事情讓我見識到美國人對於「尊重不同族群」是很堅持的：有一次耶誕節的前夕去學校餐廳買午餐，為了要增添過節的氣氛，那位結帳的阿姨戴了一個麋鹿的帽子。要結帳的時候，她跟我說：「Merry Christ…」在還沒講完 Merry Christmas 之前，她就改口說「Happy Holiday」，為什麼呢？後來我跟美國朋友討論，覺得應該是她看到我是亞洲人，可能不是基督教徒，她如果祝我耶誕節快樂，其實是有可能冒犯我的，所以她改變成祝我佳節快樂，她覺得這樣才是一個尊重不同文化的做法。（問：會不會因為學長是在Stanford這個充滿知識份子的環境，所以沒感受到歧視？）的確有美國朋友跟我說，我覺得沒有受到歧視是因為我在Stanford，周遭大多知識份子，與人相處比較溫和，他說如果我到別的地方就不一定了。"
              },
              {
                "subtitle": "求學與工作",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我在畢業前總共做過三個實習，一個在台灣兩個在美國，一個在金融業兩個在網路業，所以其實畢業前就大概知道職場長什麼樣。現在台灣的暑期實習機會比我們當年多很多，我覺得學弟妹可以多試試。另外在美國唸博士本身就蠻像一種工作，再加上我後來從事的工作也是研究導向，所以兩者間的差距不大。（問：那在讀博士的過程中去實習，會不會對學校進度有影響？）會，所以都要先和指導教授討論，有些指導教授很能夠接受學生做實習，有些不能接受，這跟科系也很有關係，像工學院都還滿鼓勵學生做實習，在博士的五六年間至少會做一次吧，但在理學院就不太流行，生醫方面也比較不喜歡學生做實習，這跟老師和科系都有關係。但的確在博士生的時候，最重要的工作還是把研究做好，這是一種長遠的投資。"
              },
              {
                "subtitle": "當初在那麼多教授中，是怎麼作選擇的？",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我這個指導教授非常吸引我是因為他的背景非常多元，他是電機系、資工系、工管系的合聘教授，也有收過統計系的學生，專門研究數學模型在各方面的應用，我覺得跟他會學到很多很廣的東西。另外我印象滿深刻的是，當我還在台灣申請的時候，他曾打手機給我，讓我覺得他很沒架子，我們也很有緣分。只是到Stanford之後，也不是說想跟他就能跟他。他說那陣子大概有30位學生找他，但他只能收1~2個，不然我們先試做看看。這有點類似試用期，大約試用一學期左右，這是滿常見的模式。（問：30個只能收1~2個，那會不會有人一直換，最後找不到教授？）這也算是Stanford教我的第一件事情，就是他們很鼓勵這種開放的競爭，他們覺得如果你有本事就會找得到教授，到現在Stanford電機系還是維持這種模式。不過有些學校不會喜歡這種模式，而希望進去之前教授學生就配對好。（問：學長之前在台大電機系找的教授，也是對他們的研究領域比較有興趣？）對，我記得一方面我對他們研究領域有興趣，另一方面那時候陳宏銘教授特別幫我挑了一個數學比較重的題目讓我研究。電機系是一個非常大的領域，有偏應用物理的一端和偏應用數學的一端，那我興趣就是比較偏向應用數學的一端。"
              }
            ]
          },
          {
            "bigtitle": "四、就業後",
            "bigsections": [
              {
                "subtitle": "轉換跑道",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "（問：實習生涯中，是否遇到一些挫折？從2007年在McKinsey，2009年去Yahoo，2010年再去Goldman Sachs實習，是否有些關於跑道轉換的心路歷程能夠分享？）其實這些公司對實習生都很好，所以我並沒有遇到什麼挫折。不過我在2009年實習的中間Yahoo決定要把搜尋外包給微軟，而2010年時Goldman被美國證交會指控詐欺。這兩件事都對士氣有不小的影響，也讓我學到很多經驗。至於轉換跑道，其實我覺得我的跑道一直都是同一條，也就是以數學和寫程式的技巧為基礎，建構統計模型的能力。這在不同的產業有不同的應用，但核心知識是差不多的。"
              },
              {
                "subtitle": "接觸到金融業的契機",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "其實在美國的理工博士中，從事計量金融的比例一直都不低。舉例來說，我在Stanford的那間實驗室裡，我是第三位加入我現在這家公司的博士畢業生，所以口耳相傳自然會接觸到。不過這幾年因為矽谷景氣很好，科技股高漲，所以進入金融業的人少了很多。（問：那些金融知識呢？畢竟是兩個不同專業領域，你原本是讀EE博士，後來才進金融業。）如果你是要走計量金融的話，大部份在招計量金融人才的公司，其實不太在意你有沒有金融背景，比較在乎的是你數理的背景有沒有很紮實，以及會不會寫程式。"
              },
              {
                "subtitle": "金融業 - 理工背景的優勢與劣勢",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "我所知道理工背景進入金融業的大概分兩種：一種是以他對科技的了解，轉化為對產業的投資判斷，例如在投資銀行研究哪家半導體公司的前景比較好。對於這種路線，理工人的優勢在於把技術的了解轉化為對產業的了解。第二種是做計量金融，也就是用他的理工背景，去建構各種數理模型來分析金融市場的走勢。對於這種路線，最重要的就是數學技術和寫程式的能力。但不管是哪一種路線，很多理工背景的人容易執著於細節，而見樹不見林。（問：那金融市場還是有很多人為操作因素，建構出來的數學模型會不會和它相左？）我想你的意思是說，不同領域有他所謂的domain knowledge，譬如說你在農業用的模型和在金融業用的模型絕對是不一樣的，這是合理的。所以進入這個領域後，不可避免的你還是要去了解這個產業、這個領域到底是在關注什麼樣的問題、他們有什麼樣的假設，這都是進去產業後要努力的部分。"
              },
              {
                "subtitle": "華爾街的印象",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "（問：有不少人對於華爾街的印象就是「黑」，例如電影《The Big Short》裡所描繪（若電影內容屬實）：CDO本身就有問題，市場開始瓦解後CDO價值急速下降，銀行仍維持原本報價，想把它們賣出去，然後去另一間銀行做空他們剛賣出去的CDO（希望沒表達錯誤，btw我們很喜歡這部電影），請問學長對於這既定印象有什麼看法？）我想到之前高盛的CEO在接受訪問的時候說過一段話：「有人覺得我們高盛是開賭場的，我不同意，但如果你們硬要說我們是賭場，那我們也是一個對社會很重要的賭場。」這句話我自己的解讀是說，金融是現代經濟的潤滑劑，其中的投機性又是難以避免的必要之惡，我覺得是需要靠嚴格的監管機制來讓過程更公平透明，但沒有辦法讓它從現代經濟中消失。我之前還聽過一種有趣的理論，聲稱房貸債券促進了美國的地方自治。為什麼會這麼說呢？因為這種債券的發行，大幅增加了債權的流動性，降低了放貸銀行的風險，進而壓低了房貸利率，而使房屋自有率提高很多。而通常當一個人在一個地區擁有了房產後，會更關心這個地區的與衰，也更熱衷參與當地的公共事務。這是一種金融對社會的正面影響。我之前的博士指導老師，還跟我講過一種很特別的觀念來比較金融跟科技業：假設今天你想改善世界上缺水的問題，你可以發明一種新的水龍頭技術，使得全世界的每個水龍頭都省了一滴的水，加起來就省了幾十萬公噸的水，這是一種貢獻。或者，你可以選擇去建一個水庫，水庫建完可以多生產幾十萬公噸的水，這也是一種貢獻。前者屬於金融業的做法，後者屬於科技業的做法。金融業的做法比較著重效率，改善小小部分，但當它放大之後，其實對於社會的影響力也滿大的。這就是解決問題時兩種不同的想法和思維。"
              },
              {
                "subtitle": "計量金融的故事",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "因為我本身從事計量金融，就跟你們分享幾個我在計量金融所看到的故事。首先，這個領域充滿了科學家，有很多理工博士。我之前聽過一個有趣的故事， 2012年時歐洲有人宣稱他們找到比光速更快的粒子，後來雖然證明是實驗錯誤，但那時候就有人說，如果這個發現是真的，真的找到了比光速更快的粒子，那華爾街會人才大失血，因為會有非常多華爾街的物理博士離開計量金融，回去做物理學研究，因為一個新的物理時代開始了。所以你可以想像在這邊有很多人沒有忘記他們做為科學家的本心。在美國有一家很有名的計量型避險基金叫Renaissance Technologies，他們的創辦人James Simons投入了非常多的金錢做自閉症的研究，MIT的認知科學中心就大大受益於很他的捐獻。2012年時，它們公司還有一個員工在紐約成立了全國唯一一家數學博物館，推廣數學知識。另外還有一位有名的計量型避險基金創辦人叫David Shaw，他目前已經很少參與金融領域，而是專心在做分子生物學的研究。他希望以後所有分子生物學的研究都能以電腦模擬來完成，在這方面也投入非常多金錢。這些人為什麼要做這些研究？很明顯和金融業無關，但他們在功成名就後沒有忘記科學家的本心，希望能繼續推動人類知識前進。（James Simons本來是位數學教授，而David Shaw本來是位電腦教授）（問：所以華爾街其實有不少科學家？）計量金融的領域是這樣沒錯，但這是華爾街的小部分，華爾街最常見的人，還是商管背景的人。"
              }
            ]
          },
          {
            "bigtitle": "五、給學弟妹的建議",
            "bigsections": [
              {
                "subtitle": "給學弟妹進入金融業的建議",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "這取決於你想走我剛剛提到的那兩種路線中的哪一種。如果是第一種比較常見的市場研究路線，這種路線最重要的是把基礎的東西搞懂，至少要知道什麼是半導體，無線通訊在幹麻，如果把這些東西搞懂的話，以後在研究產業趨勢時會有紥實的技術底子。另外，我覺得如果有機會，可以接觸一些商學院課程，例如會計學或經濟學，學習別人對於商業判斷是抱什麼樣的觀點。如果是要走第二種路線，也就是計量金融這塊，就還是數學跟寫程式。在這個領域裡數學程度決定你可以走多遠，而寫程式的能力決定你可以走多快。程式語言部分我大學主要是用C跟C++，研究所就用很多Matlab，但其實我覺得如果你能把C++練熟的話要學其它語言都很容易。（問：那電磁學呢？）電磁學有很多物理跟數學，而計量金融業有非常多物理學家，他們很懂得如何描述世界運行的方式，而電磁學會培養你這方面的直覺。"
              },
              {
                "subtitle": "財金知識來源",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "（問：有推薦的財金知識補充來源嗎？如Bloomberg、Harvard Business Review等）我自己每天早上都會一邊吃早餐一邊看Bloomberg新聞台。除此之外我有時候也會看經濟學人和時代雜誌。前者比較全球也比較財經，後者比較美國中心也比較廣。另外如果對於科技創投有興趣的話，可以看一下TechCrunch。這些資源在中文的世界裡其實都有相對應的網站，所以對於剛入門的學生而言，看那些相對應的中文網站也不錯。"
              },
              {
                "subtitle": "金融業需要的心理建設",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "工程師講究和諧文化，非常重視團隊合作，因為再厲害的工程師也無法離開團隊而做出好的成績。這跟金融業有些不一樣，金融業在個性上比較現實，很多零和思維，這是需要適應的文化。"
              },
              {
                "subtitle": "給大學部的建議",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "利用台大是綜合大學的優勢，多增廣見聞，多接觸外系知識。近年來很流行一個詞叫「T型人才」，指的是對於一個專業非常深入了解，同時也對很多領域有初步認識的人才。如果你具備這樣的條件會非常吃香。但電機系本業其實很重，所以要去接觸系外的話就要額外花一些時間。（問：那學長大學的時候有考慮雙主修嗎？）沒有，我那時候修滿多資工系的課，但沒有考慮雙主修。另外也有修很多其他的系的課，但都沒有雙主修，我當時覺得這樣修課比較有彈性。"
              },
              {
                "subtitle": "一句話，談談電機系給的歸屬感",
                "degree": "Masters in Beer tasting",
                "graduated": "April 2007",
                "subsection": "這是我想最久的一題。我覺得台大電機系可能是目前台灣最有國際影響力的校系，而身為其中一份子，我不管在知識上或是事業上都得到很多前輩的幫助。我也是到美國之後才知道台大電機系在美國的人際網絡滿有影響力的。這當然是來自於很多前人的努力。我覺得自己很幸運，也希望能繼續努力維持這個聲譽。"
              }
            ]
          }
        ]
      },
      "annotation": {
        "annotation": [
          {
            "job": "特別感謝：",
            "contributer": "高奕豪"
          },
          {
            "job": "撰寫：",
            "contributer": "蔡忠紘 林怡廷 陳鴻智 蔡承佑"
          }
        ]
      },
      "id": "1605"
    }
  ]
}
