import React, { Component } from 'react';
import Column_content from './component/column_content';
// import './column_text.css';


class Column_1605 extends Component{
    render(){
        const column_1605_article = {
			title:['2006級 高奕豪（Quantitative Researcher @Two Sigma Investments）'],
			hashtags:['系友專訪' ,'高奕豪', '2006級', 'B91', '計量金融', 'Stanford', 'InformationSystems',  'TwoSigmaInvestments', 'QuantitativeResearcher', 'Google', 'Yahoo', 'McKinsey', 'GoldmanSachs', 'ACM_ICPC', '數學與資訊奧林匹亞競賽' ],
			sections:[
				{
					bigtitle:'一、序言',
					sections:[
						{
							title:'序言',
							section:'因為台灣的產業結構和升學制度，使得電機系收納了全國理工科學生中的菁英。這種同儕關係是個得天獨厚的資源、讓我在電機系四年從同學身上學到的不比從教授身上學到的來得少。到了美國後，在史丹佛求學的日子，又讓我再次見識到台大電機四十年來累積的龐大人際網路，也因此不管是在校內校外都得到很多系友前輩的幫助提攜，受益非常多。'
						}
					]
				},
				{
					bigtitle:'二、大學時期',
					sections:
					[
						{
							title:'大學時期的成就',
							section:'我在大二那年跟兩位資訊系的朋友參加ACM主辦的程式設計比賽，一路拿到了全球第六名。這個過程中讓我學到不少團隊合作的技巧，也讓我看到世界之大，加深了我日後想要出國唸書的決心。另外就是我很會考試，所以成績很好，大學拿了八次書卷，但這是一個出了社會就沒用的技能。事實上，這是個上了研究所就沒有用的技能。（問：所以，做研究的能力相較比較重要嗎？）是的。還有我是電機營的教學組組長，我認為是一個滿好玩也滿有收穫的經驗。另外我是系泳的，那時候有一群熱血的人在弄，我們也在想萬一有一天這一群熱血的人不見了，那還會不會有系泳。'
				        },
						{
							title:'最深刻的一門課',
							section:'因為後來博士研究的關係，大學部對我而言最有用的是工程數學方面的訓練，尤其是線性代數和統計機率。這種理論的課，通常比較雋永，不太會隨時代而汰換。另外就是我修了當年的網路與多媒體實驗。那是個非常辛苦的過程，但我學到了兩樣很重要的東西。一個是上網讀說明文件來寫程式，另一個是工程團隊的分工。這兩者讓我後來受用很多。外系方面，我修了不少資訊系的課，都非常有用，但那應該不能算外系。真正的外系，我想到的是我修了經濟學當通識，這個在生活中非常實用。此外就是我去修了國企系的管理學。那門課雖然沒有太多硬知識，但讓我見識到了另一種思維，並結識了很多商學院的朋友，我從他們身上學到很多。我在大學的最後一年有幸被選進一個McKinsey的訓練計畫，也是受了他們的啟發。不過如果能讓我再來一遍的話，我會想多修一些理學院和文學院的課。我當年修課太重實用性，其實很多文理方面的知識對人生影響很深遠。我一直覺得身在台大最大的好處就是我們是一個綜合性的大學，什麼系都有，而且幾乎都是全國最好的。當年應該多把握這方面的資源。我後來選擇去Stanford唸博士，也有部份是受此啟發，希望能到一個綜合大學去繼續學習。'
						},
						{
							title:'關於專題研究',
							section:'我當年做過兩個專題研究。第一個是跟 李琳山教授做的，用機器學習的方法來判斷中文語音中的情緒。第二是個和 陳宏銘教授做的，如何用光場信號來偵測實景中的深度。兩個都是非常好的經驗，讓我在畢業前就大概知道做研究是什麼樣子。跟一般修課寫作業考試不一樣，做研究沒有明確的路徑，也沒有明確的終點，投入的時間也可以沒有止境。我後來博士論文做的是機器學習，現在的工作是在做統計信號處理，都跟大學專題有關。'
						},
						{
							title:'國外研究所 CS v.s. EE',
							section:'當初的考量除了申請難易度外，主要是我還沒有確定要專攻的子領域，而覺得選擇EE可以保持更大的彈性。但其實美國科系間分界比較模糊，所以選哪個系影響不大。我當年的指導教授有三個系的身份，分別是電機系、工管系和資訊系，同時還指導過統計系的博士生，所以非常多元。'
						}
					]
				},
				{
					bigtitle:'三、碩士博士時期',
					sections:
					[
						{
							title:'PhD及MS間做選擇？',
							section:'在我那個年代，我非常崇拜Google的兩個創辦人Larry Page和Sergey Brin。他們把在Stanford念博士時的研究拿來創業，我當時非常崇拜這種路線。所以覺得如果我念博士也可以做到這樣就太好了。（問：可是博士不是會念比較久嗎？有些人會因為花比較多時間（在唸書）就比人家晚幾年出去工作。）這是沒錯。如果是從長遠來考量，你可以想像這是一個比較長期的投資，希望十年二十年以後能夠回報。但這的確是一個有風險的投資，畢竟你比別人多花了3、4年（一般碩士1～2年，博士5～6年），要有把握這3～4年對於你的職涯是有加分的，要真的學到東西，而不是在混學位。'
						},
						{
							title:'對Stanford的印象',
							section:'首先是，這裡的教授非常沒架子。舉例來說，有些大牌教授會去旁聽其它系的課。這種精神我覺得在亞洲文化裡比較難見到。第二是見識到東西教育著重的不同。舉例來說，我當年修機器學習這門課，我發現考試的時候亞洲來的留學生都可以輕鬆電爆美國同學，但到期末專題時美國同學的成果卻可以狂電我們。這反應出兩者著重的地方不一樣。另外就是對研究興趣的強調。有一位我很尊敬的教授跟我說，如果你找到一個適合你的博士論文題目，你應該要常常嘆口氣說，唉，人為什麼要吃飯睡覺上廁所？要是可以不用做那些事，讓我專心研究這個題目，該有多好啊。至於Stanford，我前面有提到它是個綜合大學，而我很喜歡這樣的環境，在這種環境裡你可以認識很多領域的人才，有時候我甚至覺得，在宿舍餐廳裡面聊天所學到的不比在教室裡面上課來的少。（問：那會不會有人多花好幾年在探索要做什麼題目，就念很久？）會，所以我也有認識幾個待比較久的博士生，因為他們想多做點事情。（問：那學長是領獎學金出去的，會不會在探索過程中花太多時間，最後學校就不給你獎學金？）在美國他們會覺得，收一個博士生其實有點像是僱傭的關係，而不只是師生關係，所以你必須要有產出、要有表現，他們才會願意維持你的獎學金資格。'
						},
						{
							title:'赴美留學的文化衝擊',
							section:'其實我待在美國那麼久，基本上沒感覺到我有被歧視過，倒是有發生過一件事情讓我見識到美國人對於「尊重不同族群」是很堅持的：有一次耶誕節的前夕去學校餐廳買午餐，為了要增添過節的氣氛，那位結帳的阿姨戴了一個麋鹿的帽子。要結帳的時候，她跟我說：「Merry Christ…」在還沒講完 Merry Christmas 之前，她就改口說「Happy Holiday」，為什麼呢？後來我跟美國朋友討論，覺得應該是她看到我是亞洲人，可能不是基督教徒，她如果祝我耶誕節快樂，其實是有可能冒犯我的，所以她改變成祝我佳節快樂，她覺得這樣才是一個尊重不同文化的做法。（問：會不會因為學長是在Stanford這個充滿知識份子的環境，所以沒感受到歧視？）的確有美國朋友跟我說，我覺得沒有受到歧視是因為我在Stanford，周遭大多知識份子，與人相處比較溫和，他說如果我到別的地方就不一定了。'
						},
                        {
							title:'求學與工作',
							section:'我在畢業前總共做過三個實習，一個在台灣兩個在美國，一個在金融業兩個在網路業，所以其實畢業前就大概知道職場長什麼樣。現在台灣的暑期實習機會比我們當年多很多，我覺得學弟妹可以多試試。另外在美國唸博士本身就蠻像一種工作，再加上我後來從事的工作也是研究導向，所以兩者間的差距不大。（問：那在讀博士的過程中去實習，會不會對學校進度有影響？）會，所以都要先和指導教授討論，有些指導教授很能夠接受學生做實習，有些不能接受，這跟科系也很有關係，像工學院都還滿鼓勵學生做實習，在博士的五六年間至少會做一次吧，但在理學院就不太流行，生醫方面也比較不喜歡學生做實習，這跟老師和科系都有關係。但的確在博士生的時候，最重要的工作還是把研究做好，這是一種長遠的投資。'
						},
						{
							title:'當初在那麼多教授中，是怎麼作選擇的？',
							section:'我這個指導教授非常吸引我是因為他的背景非常多元，他是電機系、資工系、工管系的合聘教授，也有收過統計系的學生，專門研究數學模型在各方面的應用，我覺得跟他會學到很多很廣的東西。另外我印象滿深刻的是，當我還在台灣申請的時候，他曾打手機給我，讓我覺得他很沒架子，我們也很有緣分。只是到Stanford之後，也不是說想跟他就能跟他。他說那陣子大概有30位學生找他，但他只能收1~2個，不然我們先試做看看。這有點類似試用期，大約試用一學期左右，這是滿常見的模式。（問：30個只能收1~2個，那會不會有人一直換，最後找不到教授？）這也算是Stanford教我的第一件事情，就是他們很鼓勵這種開放的競爭，他們覺得如果你有本事就會找得到教授，到現在Stanford電機系還是維持這種模式。不過有些學校不會喜歡這種模式，而希望進去之前教授學生就配對好。（問：學長之前在台大電機系找的教授，也是對他們的研究領域比較有興趣？）對，我記得一方面我對他們研究領域有興趣，另一方面那時候陳宏銘教授特別幫我挑了一個數學比較重的題目讓我研究。電機系是一個非常大的領域，有偏應用物理的一端和偏應用數學的一端，那我興趣就是比較偏向應用數學的一端。'
						}
					]
				},
				{
					bigtitle:'四、就業後',
					sections:
					[
						{
							title:'轉換跑道',
							section:'（問：實習生涯中，是否遇到一些挫折？從2007年在McKinsey，2009年去Yahoo，2010年再去Goldman Sachs實習，是否有些關於跑道轉換的心路歷程能夠分享？）其實這些公司對實習生都很好，所以我並沒有遇到什麼挫折。不過我在2009年實習的中間Yahoo決定要把搜尋外包給微軟，而2010年時Goldman被美國證交會指控詐欺。這兩件事都對士氣有不小的影響，也讓我學到很多經驗。至於轉換跑道，其實我覺得我的跑道一直都是同一條，也就是以數學和寫程式的技巧為基礎，建構統計模型的能力。這在不同的產業有不同的應用，但核心知識是差不多的。'
						},
						{
							title:'接觸到金融業的契機',
							section:'其實在美國的理工博士中，從事計量金融的比例一直都不低。舉例來說，我在Stanford的那間實驗室裡，我是第三位加入我現在這家公司的博士畢業生，所以口耳相傳自然會接觸到。不過這幾年因為矽谷景氣很好，科技股高漲，所以進入金融業的人少了很多。（問：那些金融知識呢？畢竟是兩個不同專業領域，你原本是讀EE博士，後來才進金融業。）如果你是要走計量金融的話，大部份在招計量金融人才的公司，其實不太在意你有沒有金融背景，比較在乎的是你數理的背景有沒有很紮實，以及會不會寫程式。'
						},
                        {
							title:'金融業 - 理工背景的優勢與劣勢',
							section:'我所知道理工背景進入金融業的大概分兩種：一種是以他對科技的了解，轉化為對產業的投資判斷，例如在投資銀行研究哪家半導體公司的前景比較好。對於這種路線，理工人的優勢在於把技術的了解轉化為對產業的了解。第二種是做計量金融，也就是用他的理工背景，去建構各種數理模型來分析金融市場的走勢。對於這種路線，最重要的就是數學技術和寫程式的能力。但不管是哪一種路線，很多理工背景的人容易執著於細節，而見樹不見林。（問：那金融市場還是有很多人為操作因素，建構出來的數學模型會不會和它相左？）我想你的意思是說，不同領域有他所謂的domain knowledge，譬如說你在農業用的模型和在金融業用的模型絕對是不一樣的，這是合理的。所以進入這個領域後，不可避免的你還是要去了解這個產業、這個領域到底是在關注什麼樣的問題、他們有什麼樣的假設，這都是進去產業後要努力的部分。'
						},
                        {
							title:'華爾街的印象',
							section:'（問：有不少人對於華爾街的印象就是「黑」，例如電影《The Big Short》裡所描繪（若電影內容屬實）：CDO本身就有問題，市場開始瓦解後CDO價值急速下降，銀行仍維持原本報價，想把它們賣出去，然後去另一間銀行做空他們剛賣出去的CDO（希望沒表達錯誤，btw我們很喜歡這部電影），請問學長對於這既定印象有什麼看法？）我想到之前高盛的CEO在接受訪問的時候說過一段話：「有人覺得我們高盛是開賭場的，我不同意，但如果你們硬要說我們是賭場，那我們也是一個對社會很重要的賭場。」這句話我自己的解讀是說，金融是現代經濟的潤滑劑，其中的投機性又是難以避免的必要之惡，我覺得是需要靠嚴格的監管機制來讓過程更公平透明，但沒有辦法讓它從現代經濟中消失。我之前還聽過一種有趣的理論，聲稱房貸債券促進了美國的地方自治。為什麼會這麼說呢？因為這種債券的發行，大幅增加了債權的流動性，降低了放貸銀行的風險，進而壓低了房貸利率，而使房屋自有率提高很多。而通常當一個人在一個地區擁有了房產後，會更關心這個地區的與衰，也更熱衷參與當地的公共事務。這是一種金融對社會的正面影響。我之前的博士指導老師，還跟我講過一種很特別的觀念來比較金融跟科技業：假設今天你想改善世界上缺水的問題，你可以發明一種新的水龍頭技術，使得全世界的每個水龍頭都省了一滴的水，加起來就省了幾十萬公噸的水，這是一種貢獻。或者，你可以選擇去建一個水庫，水庫建完可以多生產幾十萬公噸的水，這也是一種貢獻。前者屬於金融業的做法，後者屬於科技業的做法。金融業的做法比較著重效率，改善小小部分，但當它放大之後，其實對於社會的影響力也滿大的。這就是解決問題時兩種不同的想法和思維。'
						},
						{
							title:'計量金融的故事',
							section:'因為我本身從事計量金融，就跟你們分享幾個我在計量金融所看到的故事。首先，這個領域充滿了科學家，有很多理工博士。我之前聽過一個有趣的故事， 2012年時歐洲有人宣稱他們找到比光速更快的粒子，後來雖然證明是實驗錯誤，但那時候就有人說，如果這個發現是真的，真的找到了比光速更快的粒子，那華爾街會人才大失血，因為會有非常多華爾街的物理博士離開計量金融，回去做物理學研究，因為一個新的物理時代開始了。所以你可以想像在這邊有很多人沒有忘記他們做為科學家的本心。在美國有一家很有名的計量型避險基金叫Renaissance Technologies，他們的創辦人James Simons投入了非常多的金錢做自閉症的研究，MIT的認知科學中心就大大受益於很他的捐獻。2012年時，它們公司還有一個員工在紐約成立了全國唯一一家數學博物館，推廣數學知識。另外還有一位有名的計量型避險基金創辦人叫David Shaw，他目前已經很少參與金融領域，而是專心在做分子生物學的研究。他希望以後所有分子生物學的研究都能以電腦模擬來完成，在這方面也投入非常多金錢。這些人為什麼要做這些研究？很明顯和金融業無關，但他們在功成名就後沒有忘記科學家的本心，希望能繼續推動人類知識前進。（James Simons本來是位數學教授，而David Shaw本來是位電腦教授）（問：所以華爾街其實有不少科學家？）計量金融的領域是這樣沒錯，但這是華爾街的小部分，華爾街最常見的人，還是商管背景的人。'
						}
					]

				},
				{
					bigtitle:'五、給學弟妹的建議',
					sections:
					[
						{
							title:'給學弟妹進入金融業的建議',
							section:'這取決於你想走我剛剛提到的那兩種路線中的哪一種。如果是第一種比較常見的市場研究路線，這種路線最重要的是把基礎的東西搞懂，至少要知道什麼是半導體，無線通訊在幹麻，如果把這些東西搞懂的話，以後在研究產業趨勢時會有紥實的技術底子。另外，我覺得如果有機會，可以接觸一些商學院課程，例如會計學或經濟學，學習別人對於商業判斷是抱什麼樣的觀點。如果是要走第二種路線，也就是計量金融這塊，就還是數學跟寫程式。在這個領域裡數學程度決定你可以走多遠，而寫程式的能力決定你可以走多快。程式語言部分我大學主要是用C跟C++，研究所就用很多Matlab，但其實我覺得如果你能把C++練熟的話要學其它語言都很容易。（問：那電磁學呢？）電磁學有很多物理跟數學，而計量金融業有非常多物理學家，他們很懂得如何描述世界運行的方式，而電磁學會培養你這方面的直覺。'
						},
						{
							title:'財金知識來源',
							section:'（問：有推薦的財金知識補充來源嗎？如Bloomberg、Harvard Business Review等）我自己每天早上都會一邊吃早餐一邊看Bloomberg新聞台。除此之外我有時候也會看經濟學人和時代雜誌。前者比較全球也比較財經，後者比較美國中心也比較廣。另外如果對於科技創投有興趣的話，可以看一下TechCrunch。這些資源在中文的世界裡其實都有相對應的網站，所以對於剛入門的學生而言，看那些相對應的中文網站也不錯。'
						},
                        {
							title:'金融業需要做的心理建設',
							section:'工程師講究和諧文化，非常重視團隊合作，因為再厲害的工程師也無法離開團隊而做出好的成績。這跟金融業有些不一樣，金融業在個性上比較現實，很多零和思維，這是需要適應的文化。'
						},
                        {
							title:'給大學部的建議',
							section:'利用台大是綜合大學的優勢，多增廣見聞，多接觸外系知識。近年來很流行一個詞叫「T型人才」，指的是對於一個專業非常深入了解，同時也對很多領域有初步認識的人才。如果你具備這樣的條件會非常吃香。但電機系本業其實很重，所以要去接觸系外的話就要額外花一些時間。（問：那學長大學的時候有考慮雙主修嗎？）沒有，我那時候修滿多資工系的課，但沒有考慮雙主修。另外也有修很多其他的系的課，但都沒有雙主修，我當時覺得這樣修課比較有彈性。'
						},
                        {
							title:'一句話，談談電機系給的歸屬感',
							section:'這是我想最久的一題。我覺得台大電機系可能是目前台灣最有國際影響力的校系，而身為其中一份子，我不管在知識上或是事業上都得到很多前輩的幫助。我也是到美國之後才知道台大電機系在美國的人際網絡滿有影響力的。這當然是來自於很多前人的努力。我覺得自己很幸運，也希望能繼續努力維持這個聲譽。'
						}
					]
				}

			],
			
			
			annotation:['特別感謝：高奕豪','撰寫：蔡忠紘 林怡廷 陳鴻智 蔡承佑'],
			id:'column_1605'
		}
		return (
			<div>
				<Column_content content = {column_1605_article}/>
			</div>
        )
    }
}

export default Column_1605;
