import React, { Component } from 'react';
import Column_content from './component/column_content';
import './column_text.css';

class Column_1907 extends Component{
    render(){
        const column_1907_article = {
			title:['2012級 王易如 （行動貝果共同創辦人）'],
			hashtags:['系友專訪', '王易如', '2012級', 'B96', 'Stanford', 'MoBagel', 'Silicon_Valley', 'Automatic_Machine_Learning', 'Advanced_Preprocessing_Unit', '行動貝果', '自動化機器學習引擎', '資料前處理'],
			sections:[
				{
					bigtitle:'一、大學生涯',
					sections:[
						{
							title:'跨出電機，創業心的萌芽',
							section:'與歷屆學生相同，我在大學期間參與了電夜、系學會等系上活動，然而在加入台大創意創業學程 (NTUCEP) 後，我有了不同的視野。相較於電機系上的強人文化，埋頭苦幹為了學業拚搏，在創創學程來自各系的人中，我彷彿看到社會的縮影，學習如何溝通協調、引用各方資源、完成專題。從一開始完全不知道“創業”是什麼，單純被“創意”所吸引，到後來經過學程中黃鐘揚教授與陳良基教授的不斷創業灌輸下，我開始有了創業的想法。這時的想法很簡單：我要改變世界，我要創業。'
						}
					]
				},
				{
					bigtitle:'二、赴美攻讀碩士',
					sections:
					[
						{
							title:'選擇MS或PhD？',
							section:'當初申請研究所時為了選擇Stanford MS 自費還是Princeton PhD全獎而與家人有一番激烈的爭執。雖然家人尊重我的決定，金錢上支持我去Stanford，但其實至今家人依然無法理解。因為金錢的因素，我只能加倍的努力，學期間在NVIDIA暑期實習，並且最後一學期找到TA獎學金，這才減少家裡的經濟壓力。除了因Stanford為創業聖地而選擇它以外，選MS也是因為覺得自己個性不適合長時間做研究。我喜歡跟人接觸溝通、進行team building、打造團隊合作；而PhD必須抱持著要做到某個領域的頂尖的心，埋首於研究多年。因此，MS跟PhD出社會後做的工作性質也差很多，MS畢業後主要是做engineer，而PhD主要是做research。'
						},
						{
							title:'在美國經歷的文化衝擊',
							section:'在臺大電機裡，充斥著強人文化，大家都會去跪拜所謂的神人，寫作業讀考試時也是一直圍繞在那些神人旁邊，不斷的抱大腿、問問題，大家一起寫作業，所以感情很好。但在Stanford不一樣，那裡主要的校規就是honor code – 用榮譽感來規範。他們不太抱大腿，堅持要自己完成作業、不要求分數一定要很高，所以會花大量時間做一個作業。最令我震驚的是，在Stanford期末考時，助教發完考卷便直接離開教室了，完全沒有要監考的意思，而我也從來沒聽過有人作弊。因為堅持每一份作業全部都要自己寫，大部分學生週一到週五幾乎全部在圖書館或是宿舍讀書、寫作業，沒時間社交，導致週末便要辦party大放縱。Stanford學生報紙指出：大部分學生不想交男女朋友，因為覺得交男女朋友的時間成本太高，需要花大量時間維繫感情。週末一夜情是常態，很多人都會交砲友。另外也觀察到他們非常強調團隊合作，不過一旦任務結束，就不太會聚在一起，所以他們會覺得亞洲人很像sticky rice (天天黏在一起)。對於課程內容，Stanford的程式課程基礎打得非常好，我原本沒有打算走CS，因為大學時期的強人文化，讓自己對寫程式這塊非常沒信心，但進入Stanford之後我把CS的課重新修了一次，對寫程式這塊也改觀了。'
						},
                        {
							title:'文化衝擊後的改變',
							section:'臺灣和美國的法律制度是不同的，臺灣是以法條為主，法條沒有寫大家就會想怎麼鑽漏洞，而美國是強調case by case，凡事追求有正確的初衷、有榮耀感。不需太多獎懲制度，也沒有要一定去遵守什麼規定。這方面讓我學會突破框架思考。原本的我，很容易被考試的標準答案所束縛，遇到問題的解決辦法就是想到訂規則。在這些衝擊之後，我學習用初衷、榮譽來解決問題。我帶著這個榮譽制度進入我們公司讓大家守時，結果是非常驚人的，沒有任何獎賞或懲罰，大家便準時出現在會議室裡。這世界不是什麼都可以拿法條來定義與衡量的，要生存在這世界重要的是人與人之間的溝通，所以不要跟著別人的期待走，或許有更好的方式是別人沒有想到的。'
						},
                        {
							title:'Stanford培養的思考模式',
							section:'Stanford的Design School(創意思考學院)對我影響很大，他們強調短時間的Brainstorm不做任何Judgement。在提出問題或解決上，先有一段時間發散思考，最後收斂階段時再剃除不好的選項。如此我們比較容易在發散階段逐漸找到global maxima，如果一開始直接否定掉一些可能性，最後討論的共識通常就會只是大家尚能接受的local maxima。這套發想的思考模式也應用在我們公司每季訂定的目標和關鍵結果(OKR)，如此可以讓所有與會員工參與並提出最好的方案。'
						}
					]
				},
				{
					bigtitle:'三、共創MoBagel',
					sections:
					[
						{
							title:'MoBagel團隊的建立',
							section:'我原先與一些朋友著手Social App時有認識一個台灣在矽谷的天使投資人。有次投資人說有一群前來矽谷參Salesforce $1Million Hackathon的年輕人，他們需要英文上的協助，希望可以找一個能幫忙確認賽會要求與發表成品的成員，於是我加入了他們。在比賽現場我才認識後來MoBagel的CEO與CIO，那時我們做的主題與現在完全不同，那是一個設計師供應鏈廠商的平台，幫助hardware designer找到合適的suppliers。比賽中我們得到評審青睞拿到第六名，也認為團隊默契絕佳，向性挺合的，決定一起創業。這場比賽無疑是我人生的轉捩點！'
						},
						{
							title:'MoBagel團隊的運作',
							section:'「人」其實是創業過程中最重要的，要有一個團隊共同相信的東西(相信商業、相信邏輯、相信技術)，也要有相應性，我們的CIO的技術很強，CEO的資源多，因為他的家人開工業傳產上市公司，比較知道投資人想聽什麼。而我比較想認識了解一個人知道每個人的熱情在哪裡，什麼核心持續驅動人去做一件事，這麼多人又如何組成交響樂奏出和諧的曲子。我很在乎找到團隊中每個人的核心，然後怎麼驅動這個團隊持續營運，所以現在擔任的是COO(營運長)。'
						},
						{
							title:'物聯網起家，逐步轉型成自動機器學習平台',
							section:'我們最初是物聯網數據分析平台。自詡為Google Analytic for IoT，每個物聯網設備都可以串接到此平台。我們有一個dashboard可以呈現每個設備的狀態，也有偵錯系統。後來客戶希望我們能預測每個設備接下來可能發生的事情，希望不要僅限於一般的數據分析，如此便需導入Machine Learning與Time Series的預測。在這塊投入越來越多資源後，發現我們的預測引擎(Automatic Machine Learning，給Data就能自動建模型)其實不用侷限於物聯網，可以跨足更多應用場域。即是我們現在做的：自動機器學習預測引擎。'
						},
						{
							title:'讓機器學習落地，人工智慧普及化',
							section:'我們與微軟Azure的願景不同，更注重應用。我們將 AI 的演算法實際落地到生活中，像是預測大樓用電量來制定省電策略。KDNuggets指出，世界上僅有20萬人真正了解ML，這與世界需要的大量AI人才有很大的落差，因此很多應用無法實現，解決這個問題是我們的使命！我們正在做APU (Advanced Preprocessing Unit)，根據AI的應用類別來進行資料前處理，增加預測準確度，並且跟產業有更深的合作。我們的工具也比Azure更簡單、快速與準確！'
						},
						{
							title:'新創的困難與學習',
							section:'我們的強項大多在技術方面，相對上商業即是罩門，團隊一開始對業務部分比較沒經驗，不了解如何讓商品落地，做了很多的嘗試，目前我們已經打入台灣產業龍頭如中華電信、友達等。歷經15年創立到18年才逐漸商業落地，現在的小成功是因為不停trial and error，才找到合適業務。'
						},
                        {
							title:'新創V.S.大公司',
							section:'我不是鼓勵大家都去創業，是希望大家可以培養leadership，組織團隊一起完成一個目標，我認為這是在大公司或新創都可以學習與挑戰的。一般而言，在大公司工作相對穩定且分工明確，大家的工作範圍是一個個方塊，拼起來就是全部的事情，所以只要每個人做好份內的事情，產出就會完整；而新創在高速成長期，相對分工較不明確，所以大家的工作範圍較從自己出發，是一個個圓圈，拼起來時中間會有縫隙，能夠接受這樣的情況並且帶領團隊將縫隙填滿是成功的關鍵。當然在大公司也有新創事業群，所以上述情況也要看單位。建議依照你對自己的了解來決定去大公司或是新創工作。在大公司通常會有mentor可以帶你，而在新創有自己摸索的挑戰。不過只要在學習，之後轉換跑道都是有機會的。新創也需要待過大公司的資深人才，同樣地，大公司也有新創事業群尋找愛冒險的人才。'
						}
					]
				},
				{
					bigtitle:'四、人生規劃',
					sections:
					[
						{
							title:'學姐的人生哲學',
							section:'年輕的時候，往往會看到別人做得比自己好的一面，便開始有比較的心態。這樣的心態可以成為一種驅動力，讓自己不斷地進步。然而，我曾經深陷於比較之中，而變得憤世嫉俗。柯文哲說：「不要羨慕別人的成功，因為你付不起那個代價。」後來才發現陷於比較是沒有意義的，因為大家終究也只看到表面，並沒有看到成功人士的背後到底犧牲了甚麼。現在回頭看年輕的自己，我希望更早的我內心能更定地好好做事情，不要太浮躁。「每個人都有自己的時鐘。」我覺得人生應該視為一種累積，不管失敗或成功都會成為生命中成長的養分，不要太在意當下前進幾步、後退幾步。'
						},
						{
							title:'對於MoBagel與臺灣新創的期許',
							section:'對於未來，我希望能讓MoBagel成為臺灣軟體大廠的模範，並且帶動臺灣人投入創業與領導能力的培養。如果只是著眼於眼前的工作，往往就只會成為一個小螺絲而已，應該要學習怎麼看得更長遠，因此領導力是非常重要的。領導能力可以透過投入project來培養，過程中你可以練習怎麼說出自己的願景、找到自己需要的夥伴，甚至像是負責系上的活動也可以培養領導能力，而這些練習的機會可以靠自己去創造。'
						},
                        {
							title:'給學弟妹規畫人生目標的方向',
							section:'談到如何規劃自己的人生，我覺得有兩個方向。第一，相信自己獨一無二，不要害怕挫折。每個人的出發點不同，特質也不同，因此要相信自己的與眾不同。世界上有很多創業成功的例子，這些人會成功的原因就在於，他們不會因為一個題目已經有其他人做了而認為機會消失，而是相信自己能夠做出與他人不一樣的風格。事業有很多可能，不要受限於框架內。第二、有個值得一生去追尋的志業。如果有一件事值得用一生去追尋，我覺得那會是很棒的事情，因為那就是一個人的使命。如果有，千萬不要放棄它。沒有也沒關係，可以先著眼於比較短暫的目標，重點是知道活著的意義與價值。'
						}
					]

				},
                {
					bigtitle:'五、給大學部的建議',
					sections:
					[
						{
							title:'假如重新進入大學生涯，學姊會如何規劃？',
							section:'我想要在大學的時候接觸更多人並更深入的了解他們，因為其實人脈最後都會變成你的資產。所以如果時間能倒流，我會去組織一些我在乎的事情，然後認識一些有才幹的人。'
						},
						{
							title:'學姊推薦畢業生投入的領域',
							section:'我覺得還是要看自己喜歡什麼，如果已經有志業的話，就follow你的志業，勇敢投入、不要怕。如果沒有的話，那大方向的話學習AI、機器學習基本上還是不會錯，因為現在會的人還是太少，而且目前各行各業大公司都在招募這樣的人才。所以如果是快要或剛畢業，我覺得找個可以學習這些事的工作會很棒。'
						},
                        {
							title:'有什麼座右銘或可以提點學弟妹的嗎？',
							section:'不要活在過去，不要活在未來，活在當下。不要活在過去意思是，不要困在過去的成功或失敗中走不出來；不要活在未來，則是很多人常常會有一個虛幻的目標，但是覺得時間過去目標自動就會達成，造成現階段卻擺爛、沒有在做能幫助達成目標的事情。若有現在讓你非常不舒服的事情，請改變它，不然就是接受它，並好好活出當下。'
						},
                        {
							title:'最後，一句話談談電機系給您的歸屬感？',
							section:'每個人都有追求卓越的心，會把有興趣的事情做到最好，且沒那麼功利主義，這樣的電機魂是我所感到共鳴的。'
						}
					]

				}


			],
			
			
			annotation:['特別感謝： 王易如','撰寫： 鄭謹譯、李筠婕、戴慕潔、吳建翰','校稿彙整： 鄭謹譯'],
			id:'column_1907'
		}
		return (
			<div>
				<Column_content content = {column_1907_article}/>
			</div>
        )
    }
}

export default Column_1907;
