import React, { Component } from 'react';
import Column_content from './component/column_content';
// import './column_text.css';

class Column_1606 extends Component{
    render(){
        const column_1606_article = {
			title:['2007級 謝沛倫（Ambidio Inc. 共同創辦人）'],
			hashtags:['系友專訪', '謝沛倫', '2007級', 'B92', 'Ambidio', 'AdventuresInSound', 'LosAngelesStartup', '聲音革命', 'Bloomberg媒體報導', 'Billboard', '讓筆電喇叭變百萬音響', '80年來最偉大的聲音革命', '李嘉誠與黑眼豆豆搶投資', 'HorizonsVentures', 'ColumbiaUniversity', 'ComputerGraphics', 'MusicTech', '大腦和耳朵重新連結的Ambidio時代'],
			sections:[
				{
					bigtitle:'一、Ambidio快問快答',
					sections:[
						{
                            title:'Ambidio有何神奇？',
							section:'使用者只要一指按下電腦、手機等播放鍵，便可享有具空間感的聲音效果。有效音場寬度是目前市面上其他技術的至少三倍以上。'
						},
                        {
                            title:'Ambidio的好處？',
							section:'重視音效的人不必再買一堆設備，就可用最低成本，體驗沉浸式音效。'
						},
                        {
                            title:'Ambidio運用方式？',
							section:'有兩種，一是直接將Ambidio技術直接嵌入影音或聲音檔案中，另一是透過程式即時將技術加入正在播放的聲音中。'
						},
                        {
                            title:'Ambidio運用管道？',
							section:'可廣泛應用在任何有立體聲揚聲器或耳機的硬體設備，包括筆記型電腦、電視及部分手機和平板電腦等，已有美國電影採用。（資料來源：BUSINESSDREAM經營夢想, https://goo.gl/T32Zyt）'
						}
					]
				},
				{
					bigtitle:'二、前言',
					sections:
					[
						{
							title:' 前言',
							section:' 「想像一下，打開電腦或是手機觀看影片或玩電動，就能感受到360度逼真的立體音效，彷彿賽車就從身旁呼嘯而過、恐龍就從眼前磅礡踩過的震撼聲音。」創辦於2014年，四名來自台灣的年輕人在洛杉磯，把心力傾注在聲音科技公司Ambidio上，得到七屆葛來美獎得主歌手will.i.am及李嘉誠先生旗下維港投資挹注支持。結合大腦感知模式和聲音科技，重塑大腦對聲音的解碼功能，創造出高質的聽覺體驗，透過一般立體聲揚聲器的平板電腦和手機，也能享受更勝環繞音效的聲音饗宴，如同身歷其境。Ambidio透過兩種方式改變對聲音的體驗：一種是直接將Ambidio技術直接嵌入影音或聲音檔案中，另一種是透過程式即時將技術加入正在播放的聲音中。一旦配備Ambidio技術，只需按下播放鍵，便可享擁奇幻兼具空間感的聲音效果。Ambidio可廣泛應用在任何有立體聲揚聲器的硬體設備，包括筆電、電視及部分手機和平板等。系學會很榮幸能夠聯絡上學長，讓我們來聽聽Ambidio Inc. 的Co-founder 謝沛倫學長為我們帶來的分享～'
						}
					]
				},
				{
					bigtitle:'三、Ambidio 創業甘苦談',
					sections:
					[
						{
							title:'您是如何與其他co-founders相識並有共同創業的idea？可以敘述一下這段歷史嗎？',
							section:'Co-founders認識很久，在台灣就認識了。我們不是為了創業而想idea，而是有另外一個co-founder之前就在做這方面的研究，而且成果不錯，想讓更多人使用和體驗。我也有幫他debug和brainstorm，之後思考如何推廣並且問其他人的意見。每個人因為過去經驗不同，都有不同的想法，但這些人的意見的共同交集就是成立一個公司，再想辦法搞定專利，之後甚麼都好說。成立公司比較簡單，但專利就需要寫一堆繁瑣的文件。'
						},
						{
							title:'做研究與創業有什麼不同？',
							section:'做研究比較focus在跟專業領域有關的事情，但成立公司就會需要處理很多雜事，我們每個月都在處理不同的事情，每件都是新的，只要發生事情就要趕快學，每週都有不同的情況。'
						},
                        {
							title:'Ambidio跟別人做的環繞聲是差在哪裡呢？',
							section:'我們的優點在於，有許多Artist在做創造聲音，他要作混音、幫電影配聲音，要花很多時間。我們能夠打破物理的限制，就像在自然的情況下聲音是從四面八方來的一樣。我們不會讓聲音失真，不管用耳機或喇叭都可以，但耳機本來就滿有環繞感。如果你看到兩個喇叭在前面，但發現聲音從不同方向來，感覺會很神奇。'
						},
                        {
							title:'目前還沒有看到Ambidio出產品，只有看到demo，請問大約何時會出呢？你們未來的策略是？',
							section:'目前ambidio會跟製作content的公司合作，像是做電影或音樂，所以我們做的東西通常不會直接deliver到個體客戶的手上，但我們客戶的產品你們會看到，只是目前還沒有，希望可以讓你們趕快看到。'
						},
                        {
							title:'有沒有因為這樣的產業，認識音樂人？',
							section:'認識黑眼豆豆的Will.I.Am，他是我們的投資人。在我們的投資顧問室skywalker sound，也就是做星際大戰的公司，可以看到很多人，像是侏儸紀的混音師、星際大戰的混音師，在交流的時候會認識到很多音樂的魔術師。他們或許大眾面前不有名，但在幕後混音界很厲害。'
						},
                        {
							title:'創業至今遇到最大的挫折？',
							section:'創業至今覺得會的東西太少，因為新開的公司會有很多方面的事，像是法律和會計，哪有可能知道那麼多事情，或是在專業領域上，其實也是學不完的，所以要趕快學然後趕快趕上。另外就是花太多時間在等待，就像是你等學校申請也要等待，我們創業要等專利等等。'
						}
					]
				},
                {
					bigtitle:'四、大學時期',
					sections:
					[
						{
							title:'談談電機系的歸屬感',
							section:'我不太確定什麼是歸屬感，不過在國外留學會覺得很多人是從同一個地方來的，比方說從台灣、台大或是電機系，比較會相互照應。除了生活以外，在工作上也會因為做的領域比較接近，可以相互建議。可能台大電機出國的比例比其他學校或學系還高一點，所以在這邊會有比較多同學。不過在台灣應該也是這樣子吧，很容易跟大學同學hangout。'
						},
						{
							title:'當年最喜歡的教授',
							section:'資工系的莊永裕老師。我上過他兩門課，分別是數位視覺效果與數位影像生成。那時候就啟發了我對computer graphics這個領域的興趣，想深入瞭解做特效、動畫背後的原理是什麼。電機系的話，應該是李琳山吧！我沒有上過他的信號系統，我上的是數位語音處理。他不是只有傳授這個學科的知識，他對學生怎麼做研究或做事的方法比較注重。我印象中他的課程設計就是以這個為出發點，並不只是把數位語音處理的不同component教給你。'
						},
                        {
							title:'當年電機系系上的神人？',
							section:'我也是想了一下。其實應該大家都是奇才啦，有點官方說法。不過我想到的是會一邊打太極拳一邊踢足球的同學。'
						},
                        {
							title:'大學時期特別的成就或經歷',
							section:'呃...沒有成就（笑）我沒參加系學會，沒拿書卷獎也沒社團。我大部分時間都在打系籃啦！對未來的影響就是到現在還是只會交籃球場上認識的人當朋友而已，沒有什麼正面的影響。'
						},
                        {
							title:'系上 / 系外對你最有幫助的一門課',
							section:'系外就是剛剛說的數位視覺效果，系上是線性代數。我覺得工程數學對之後的很多進階學科都很有幫助。後來在學其他的東西的時候都會發現:哦!原來是這樣!可是真的要用的時候才發現沒學好然後又要複習。我的教授應該是馮蟻剛。也是要看你之後做什麼啦!如果你要做電波的話，那可能就是微方比較重要。'
						},
                        {
							title:'關於專題選擇',
							section:'我跟過兩位老師。一位是鄭士康，當時我做電腦音樂相關的專題。因為我之前彈吉他所以就研究效果器的原理，再用code寫出來。另外一位是簡韶逸，那時候是做image based rendering。比如說你在動畫裡面看到的東西都是你有一個model然後貼一些texture上去然後把他render出來。那image based就是他可以拍很多很多的照片，然後用一些數學進行處理。比如說某一個視角的時候是用某一張圖的某些東西。可能跟幾何比較有關吧！但是也是多少有點關係啦。不過我的專題就是把當時已存在的方法實做出來。'
						}
					]
				},
                {
					bigtitle:'五、美國念研究所時期',
					sections:
					[
						{
							title:' 留學讀研究所',
							section:'我覺得最大的差別大概就是在美國唸研究所比較多就是在美國工作，多數人的目的一開始也是想在美國工作才來念研究所。我們那屆出國的比例、我猜大概有三四十個人吧，沒有非常多，可是到今年都還有人出國，就是工作了一下，但還想再念一點書，就再申請出國唸書，所以不一定要一畢業就出國。'
						},
						{
							title:'出國前準備',
							section:'（從台大電機畢業到去哥倫比亞大學中間隔了三年，請問除了當兵跟準備出國考試資料等等，還有在做什麼嗎？）我當時去中研院做研究，中研院那時好像是快要出國之前的人的臨時棲息地，因為像剛剛說大學專題就是實作一些已存在的東西，好像沒有一些厲害的paper，所以想說去中研院做一下研究，除了要增加publication之外，也學習做研究。其實我也不太確定幫助有多少，因為那時候我原本要念computer graphics，但我大學念電機系，關聯不大，所以我申請國外的CS沒上而EE有上。所以不敢說那段時間對申請多有幫助，不過對自己的學習是很有幫助的。'
						},
                        {
							title:'中研院的研究內容',
							section:'我那時候去中研院是去資訊所、做跟電腦圖學相關的東西。那時候是跟廖弘源老師做偏視覺的研究，他做比較多視覺多媒體方面的research。（所以學長還是心繫CS嗎？）對，最後博班還是去念cs了（笑）因為在columbia念EE master的時候，他們很鼓勵去修一些其他所的課。畢業標準是修30學分，我那時只修了10學分電機所的課，其他都跑去修資工所的。Columbia畢業標準不需要一些發表，其實滿多學校不用的，我自己認為美國滿多學校對master的定位只是修一些比較進階的課，並不需要有論文。台灣就比較不一樣，有點像phd之前的預備，而美國就比較像就業導向，沒有很注重論文。'
						},
                        {
							title:'在美國的RA經驗',
							section:'我有待過兩個實驗室，比較有趣的是我有做一個physical simulation，就是電腦動畫模擬衣服。那個時候他們有一個現成的系統，可以real time design衣服，像是可以改肩線等等，改2d的design時可以即時轉換成3d的圖show出來。以前的作法可能就是真的找一個假人偶，然後把布料釘上去。那樣子很麻煩，有個模擬軟體就比較好。（聽到現在感覺學長的經歷都跟聲音方面的研究沒什麼相關？比較多影像耶）剛剛那個鄭士康老師的專題，他其實就是跟聲音相關的，而且我在columbia也有修些跟聲音相關的課，不過沒有這方面的研究就是了。'
						},
                        {
							title:'Gramercy Surgery Center 工作經驗',
							section:'（看到學長有在Gramercy Surgery Center當軟體工程師。Gramercy Surgery Center 是個醫療急救單位，那軟體工程師的任務為何？）它就是手術中心，那裡跟台灣的醫療系統不太一樣。在美國，醫生判斷你要做手術，那個醫生可能會在那個醫院幫你做，或是病人自己去外面的手術中心找外科醫生幫你做。那這種手術中心可以提供器材、護理人員等等。因為有各種不同的醫生來request他要在什麼時間做什麼手術，可是他們現成的管理系統很不方便，比較偏像會議管理那種，我就幫他們重寫一個系統安排手術時間。（那學長在美國是看到有一個機會，就去做，還是說這些研究助理，幫手術中心寫系統都是計劃好的？）當然不是，如果有計畫就不會做這些了（笑）。這些是剛好有認識的人介紹，然後就去了。'
						},
                        {
							title:'Disney Research - Capture & Effect Internship',
							section:'（學長有在disney research 的Capture and effect部門實習過，請問大概是在做什麼?）Disney下面很多不同公司，有做特效、電影或disney world的等等，而disney research就是做很多公司需要的東西，所以做的東西很雜。我加入的是capture and effect，他們有一個系統可以拍很多照，然後reconstruct被拍的東西的3D model，接下來就是我就不能講了。'
						}
					]
				},
                {
					bigtitle:'六、創業時期與未來展望',
					sections:
					[
						{
							title:'電機系學生  v.s.  創業',
							section:'（電機系的學生需要什麼特質，才適合創業？何時開始？又，怎樣的個性不適合創業？）要喜歡自己做的事，因為會把所有時間都花在上面。（平常如何分工呢？）沒有明確的分工模式，我們有辦公室，但我們沒有住在一起，還有一個人在台灣。（假設有學弟妹很早就決定要創業，怎麼學習創業？）我自己是沒有準備過創業。我是在過程中學習，但是我也不能說你不需要準備，現在不是有什麼創業學程嗎？不過我也沒有上過這個學程，所以我也沒辦法說什麼。'
						},
						{
							title:'未來聲音科技的突破？',
							section:'其實現在很多聲音的公司，趨勢都是希望可以用更方便的方式讓客戶體驗更immersive的東西，可能還要考量到大家都在mobile上面使用。對我們來說就是希望可以成為下一個大家體驗聲音的方式。我們認為單聲道(mono)發明了很久，過了二三十年之後變成stereo，照理說接下來大家會想要環繞聲(surround sound)，然而卻沒有很普及。這個東西並不是每個人都會一直在使用，但我們希望能夠把體驗聲音的方式從stereo變成ambidio。'
						},
                        {
							title:'未來規劃',
							section:'希望是可以繼續做自己喜歡的事，並沒有說幾年之後在變什麼，幾年之後要變什麼。Ambidio短期的計畫就是要讓大家都聽到。（像是現在這樣每天都聽ambidio的聲音出去外面聽會不會覺得怪怪的？）沒有啊，目標就是要讓聽的人回到原始聲音該有的方式，所以如果我的目標就是要讓你自然的聽聲音，那不就和你平常走在馬路上聽聲音一樣嗎？'
						},
                        {
							title:'在美國和台灣軟體工程師的差別',
							section:'薪水是不一樣，但花費也不一樣。最主要還是看自己喜歡怎麼樣，並不是說你一定要去美國。最大的不同應該還是美國講英文吧。總之還是要做自己喜歡的事情，像是喜不喜歡在美國生活也很重要。（那學長你認為你會一直待在美國嗎）短期之內應該會吧。'
						},
                        {
							title:'多媒體產業',
							section:'學弟妹想走這行的話，有需要特別增進哪方面的知識嗎？就是，假設想要做類似ambidio這種事情的話，除了顧本科之外，還要做什麼？）這很難講出來，我自己覺得你吸收的知識越廣越好，然後你可以很快的在不同的主題之間移動。（那應該問說，要怎麼吸收這些知識？就是在求學，大學的階段的時候，可能是有什麼雜誌嗎？網站，還是要看論文？）如果是要找新的研究，那就是看最新的論文，例如一個陌生的領域，你會去找這個領域大家最新都在做什麼。當然你很可能看不懂，看不懂的時候就會去找它引用的東西，慢慢一個一個往前找，其實李琳山老師教的課大概就是這個概念。這些知識就是一個金字塔，新的東西都在上面，那你可能會需要很多很多基礎知識才可以達到最上面的東西，但是你沒有辦法去準備把所有基礎知識都弄好。當然基礎知識是學越多越好，不過學最新的科技的方式，就是你要會去找最新的東西，然後慢慢的往回，找出一條路。'
						},
                        {
							title:'如果再讀一次大學？',
							section:'我如果再讀一次大學，老實說我就不會念電機系，因為如果我知道之後的路，我就不會去念。不過我覺得還是要增加基礎能力，像我剛才講的，你需要有足夠的基礎能力，你會比較容易pick-up之後的東西，因為現在的科技變化很快，但是像數學物理或是邏輯等等是不會改變的，可能就是要更廣泛接觸吧。（所以你想要做computer graphics是大學之後才確定的嗎？）是的。（有考慮過轉去資工系嗎？）可是我那時候已經大三了，來不及了，只好研究所再轉。'
						}
					]
				},
                {
					bigtitle:' 七、結語',
					sections:
					[
						{
							title:'往後5-20年有哪些產業是值得學弟妹投入？',
							section:'我覺得這個有點難預測，如果你現在去看二十年前的預測就知道了，所以我也不想要二十年後回頭來看，才發現當初自己亂講話。'
						},
						{
							title:'一句話談談電機系給您的感覺',
							section:'我覺得同學都非常厲害，所以你可以從同學中學到很多。聽起來很勢利，但未來對你的生涯都有幫助。'
						}
					]
				},
			],
			
			
			annotation:['特別感謝：謝沛倫','撰寫：鍾興寰 Paulsu Su 陳威成 孫凡耕'],
			id:'column_1606'
		}
		return (
			<div>
				<Column_content content = {column_1606_article}/>
			</div>
        )
    }
}

export default Column_1606;
