import React, { Component } from 'react';
import Column_content from './component/column_content';
// import './column_text.css';


class Column_1604 extends Component{
    render(){
        const column_1604_article = {
			title:['2000級 胡一天（源鉑資本Kyber Capital執行長，專業投資人與金融觀察家）'],
			hashtags:['系友專訪' ,'胡一天', 'ThomasHu', '2000級', 'B85', 'Blockchain區塊鏈', 'Ethereum以太坊', 'KyperCapital', '源鉑資本執行長',  'InfiniteStudio無限工作室', 'FinancialEingeering', '哥倫比亞大學金融工程', 'ColumbiaUniversity', '電機系與法律系財經法學組雙主修', '跨領域',  'Hongkong', '金融觀察家', '專業投資人', '先進到適合發展的環境再積極創造機會' ],
			sections:[
				{
					bigtitle:'一、求學相關',
					sections:[
						{
							title:'Why NTUEE?',
							section:'喜歡人文科學，也認為了解基礎科學和新科技很重要（民國96年入學時，互聯網、高科技已開始發展）所以選擇了綜合型大學的台大。而在電機系的選擇很多、可以認識的人也很多。電機系跨界的特性，可以在廣泛接觸各種知識後，深入研究。'
						},
                        {
							title:'目標：投資強者同學',
							section:'自己在電機系不一定能特別出類拔萃（成績、興趣…），而大學時認識很多強者同學，將來很多會研發東西、發展事業，我就作投資他們的人。因此，大學時的關鍵放在找到有革命情感、志同道合的同學。不斤斤計較分數，也不以到園區當科技新貴為目標。'
						},
                        {
							title:'大學生活：雙主修電機、法律',
							section:'自己有英語優勢，當時想多修個財金方面的專業，（但是財金系無法雙修，自己又不想只有輔系），所以選了法律系財法組。當時讀了華爾街Robert Rubin的故事：Robert Rubin耶魯大學法學院畢業後，當了兩年律師便進入Goldman Sachs從riskarbitrage 做起，待了二十七年，之後在柯林頓時期擔任財政部長。有了這個故事在心裡後，更加堅定自己念法律系的動機。法律系的課程多以面對國考為教學目標，自己的目標不是國考，所以在念的時候會多搭配相關的資料閱讀。例如修憲法課的時候，自己閱讀政治學、歷史、英美憲法相關的文獻。(P.S. 美國憲法起草人之一Hamilton是Columbia University的校友)大學時用空閒時間多學了一些法律知識，多了這方面的素養。現在做生意、投資、收購融資的時候，自己就有相關的法律概念。像是之前在香港做收購、在紐約做融資看一家公司的時候，看上市公司的財報，決定在什麼時間點買，需要相關的金融常識、法律素養，綜合判斷。'
						},
                        {
							title:'系上印象最深刻的課：微分方程─以物理模型思考',
							section:'系上印象最深的一門課，是「工程數學─微分方程」（林清富教授）。修習這門課時，我和另一位同學找了兩本教科書自行研讀。其中一本是關於微方題目與物理意義的連結。印象最深刻的是學習的態度：課堂上教了很多解題技巧，所以個人更要重視學習的紮實度，例如了解微方背後物理模型的建構。將「空的」數學賦予實質的物理意義，才是學工程的人該有的態度。其實金融中可以被量化的面向，也可藉由這類物理模型，加入邊界條件 (Boundary Conditions)解決。但商業投資上更看重直覺與悟性。'
						},
                        {
							title:'探索興趣：Keep yourself open-minded, no stereotypes',
							section:'保持開闊的心胸接受事物，不要受到主流價值觀、刻板印象影響，十年前、十年後流行的東西不一樣。台積電很熱門、可以賺不少錢，但不是大家都需要去台積電。所以不要為自己設下限制，大學時多方嘗試，找想做的事。讀完該讀的基本資料，問不懂的問題，找出答案，進而為自己創造機會。'
						}
					]
				},
				{
					bigtitle:'二、台大電機畢業之後',
					sections:
					[
						{
							title:'Going abroad： 接近國際金融市場',
							section:'金融中心是一個情報集散地（像是臺灣的新竹科技園區，相同類型的產業高密度聚集）。我前兩個工作的地點（紐約、香港）便是世界的金融中心。讓自己置身國際大市場，獲得的體驗跟在臺北差異甚大。以國際大市場而言，身在臺北有個先天的劣勢，現在跨國金融機構很難把臺北年輕的學生視為招募高端的金融、商管儲備人才的首要目標。也建議未來想從事傳統金融產業（即不包含Fintech等新興產業）的新鮮人，不要將自己侷限在台灣。'
				        },
						{
							title:'Why Columbia University?',
							section:'退伍後申請了五所學校(Stanford, MIT, Cornell, U Penn, Columbia)的電機研究所，Columbia當初不是我的首選，因為他的電機不是最好的。不過電機不是我考量的重點，關鍵是要出國，先到那裡再說。我想去紐約，所以就選了Columbia。事實上，當初申請U Penn上的System Engineering，Cornell沒有拿到獎學金，而Columbia本來沒有上，但是另外寫信給教授後，教授看了我的背景，覺得我是個有趣的人，決定讓我去當PhD學生。開學前去辦公室找他，教授表示他當時對電機沒有興趣，正在研究神經科學相關的領域，他說我先看看，一年之後再決定是否跟他做研究，想轉到別的地方他也會支持。Columbia的制度是PhD student學籍是掛在GSAS (Graduate School of Arts andSciences)，而非自己原本的工學院。只要能負荷，修什麼課都可以。我利用這段自由的時間，大量地累積金融相關的知識與人脈，也積極參與大型金融機構的校園徵才。在GSAS的一年，我努力轉到Financial Engineering，因為知道華爾街是很現實的，沒有對的資歷、關係，連面試的機會都不會有。像我這樣剛來到美國，沒有身分，大學部也不是唸本科，一定要有別的策略。所以我決定拉長戰線，除了學習之外，更要多接觸可以幫助自己找到工作的人。這一年修了很多FE領域博士班等級（比較難）的課，想說對之後轉系可能有幫助。後來我也以財務工程碩士畢業。總而言之，學校、都市、所選的內容，跟你的個性、能力是否匹配，非常重要。在對的環境，自然會遇到對的人，而這些好的關係也能從學校延續到職場上。我在紐約的第一份工作，也是哥倫比亞大學一個教授推薦的。'
						},
						{
							title:'Why Financial Engineering?',
							section:'大學時買過國外股票、基金，在dot com泡沫爆破前有賺到一些錢，覺得投資有趣。金融 (Finance) 是一個可以學以致用的領域，學原理、實戰、有基本素養後入行。金融業的本質其實也是科技業，因為科技的進步，創造出新的金融服務。此外，金融很刺激，每天都有新的事情發生，每天都要閱讀大量資訊、快速學習，否則難以應付競爭激烈的市場。'
						},
						{
							title:'同學的互動',
							section:'經常追蹤同學們做的領域、事情，知道現在最新的東西是什麼，以及他們對這個領域的其他想法。另外，自己本身的知識背景，也能容易的了解他們討論的內容，對選擇投資目標幫助很大。'
						}
					]
				},
				{
					bigtitle:'三、工作相關',
					sections:
					[
						{
							title:'畢業後第一份工作─紐約',
							section:'我在商學院修了好幾門，其中一門是關於槓桿收購，學到很多與華爾街相關的實務知識，很實用。當時的教授的老朋友在紐約剛成立了新的基金公司，教授推薦我去試試，後來面試很順利，先從實習開始，後轉正職。一開始是做計量選股模型的工作，後來開始參與基金操盤。一開始是專注全球價值股，2008年時與另一名資深分析師接手一檔中小型成長股基金負責看全亞洲（包含日本）的股市，也有參與大老闆的旗艦基金操盤，最高曾負責過2億5千萬美元的部位，也親身經歷了百年難得一次的全球金融海嘯。'
						},
						{
							title:'從紐約到香港',
							section:'當初覺得在紐約繼續做的話，薪水越來越高，但人生不會有太多變化。後來因緣際會，認識了中華開發的高層，決定在2011年離開紐約，加入開發在香港成立的新部門，與另一位新加入的香港同事一起經營高收益收購融資的業務。從2011年到2015年，陸續評估了一百多個融資案，做了十二件，覺得自己在公開市場與私募市場都有相當程度的歷練了，而且自己一直有在關注新創投資，也有天使投資出場的經驗（台大電機學弟沈育德創辦的StorySense Computing），看到金融科技與區塊鏈（blockchain）應該會有巨大商機，於是跳出來成立源鉑資本。'
						}
					]
				},
				{
					bigtitle:'四、給學弟妹的建議',
					sections:
					[
						{
							title:'培養跨界能力',
							section:'「跨界」愈來愈重要，例如：區塊鏈（Blockchain）需要懂法律、財金、科技，非常值得關注。職場分工因應工業走向後工業的過程，資源不夠，為了效率而集中化管理。然而現在環境改變，教育模式卻沒變，職場分流沒變，人的觀點也沒變，就會被時代拋棄。台灣目前需要突破的就是這類思維的問題。大學時要花時間做紮實的事，在一兩個領域紮根，也不要侷限在電機系。電機系課程設計使我們可以看更多的領域，雖然都是在電機的領域，也需要多用心才能看出課程間連結的意義。此外，修課需有長期的策略，但仍需留有彈性，隨著時間修正，因為自己的預測不一定正確。'
						},
						{
							title:'累積實戰經驗',
							section:'台灣學生基礎很好，但需要更多實戰經驗。進入好的公司，會給你很多學習資源，然後拋問題給你想。以石化業為例：怎麼搞懂化工廠？業界怎麼看、投資界怎麼評估？要看一整個產業的股票，包含同行當中的競爭者，也需要分析原料成本。每個地區（北美、中國、日本...）都有它自己的邏輯。這些無法透過課本得來，需要實際跟業界專家與資深分析師學習，自己再多做功課。'
						},
                        {
							title:'一定要去美國？',
							section:'金融的話，第一份工作在面向大型市場（e.x. 中國或美國）、跟國際接軌（e.x. 紐約或香港）的金融中心做，會比較好。台灣公司無論是本土或外商，對國際市場的關注不夠，專案接觸面不夠廣，不容易學到正確的基本動作。有心在中國發展的話，到北美去留學、工作有好有壞。中國大陸市場瞬息萬變，很多訊息需要在當地才知道。紐約的高度比較高，是好平台，但真的要做到很「接地氣」（ on the ground） 的東西、做大事業，比較難。大部分人在那邊可能當小螺絲釘，但是能有相對單純的工作環境貢獻專業。亞洲市場複雜很多，有機會迅速竄升。上海以後會更加重要，香港有獨特地位，但重要性逐漸下降，北京平衡兩者，都是不錯的選擇。'
						}
					]

				}
			],
			
			
			annotation:['特別感謝：胡一天','撰寫：吳奕萱 楊程皓 毛弘仁 江庭瑋 蘇峯廣'],
			id:'column_1604'
		}
		return (
			<div>
				<Column_content content = {column_1604_article}/>
			</div>
        )
    }
}

export default Column_1604;
