import React, { Component } from 'react';
import Column_content from './component/column_content';
// import './column_text.css';

class Column_HungMingJiun extends Component{
    render(){
        const column_HungMingJiun_article = {
			title:['2014級 洪銘駿（RobotArt 國際機器人藝術大賽首獎）'],
			hashtags:['系友專訪', '洪銘駿', '2014級', 'B99', 'RobotArt', 'Painting', 'ArtandTechnology', 'Robot', '機器人繪圖', '藝術', '台大山服', '系藍', '臺大電機所控制組', '不要想太多全心全力的投入', '多嘗試抬起頭來看外面的世界' ],
			sections:[
				{
					bigtitle:'一、大學課業',
					sections:[
						{
							title:'當初對電機的想法以及改變',
							section:'其實高中的時候也不知道大學科系是在幹嘛，也沒有認真去了解。然後那時候對理工蠻有興趣也看到一些很崇拜的學長往這個目標邁進。比如説有一個學長他是建中熱音社，打鼓的，成發完然後只用一年就上台大電機，就覺得這樣真的太猛了。因此也以台大電機當一個目標。在讀了之後，覺得最有興趣的是可以自己做一些東西這樣。理論上的東西可能就不太有興趣，比較喜歡實作。比如説有一些project，想一些點子然後把他實做出來。'
						},
                        {
							title:'最深刻的一門課',
							section:'系上的話，比如説大三的資料結構，很痛苦。每天作業都要寫幾十個小時，期末project甚至不眠不休寫了七十幾個小時，但就是一個印象深刻的過程。反正都過去了，那時候大家都覺得很痛苦，但是現在就覺得反正都過去了。修完對你的程式一定是有幫助的。系外的就還蠻多的，我修過一門「電影藝術與當代議題」，就是你要看一部電影，然後去分析它的拍攝手法、光線、或是劇情、或是從各個面向去分析一部電影，那是期末作業，要寫七千字以上。因爲我也很喜歡看電影，所以你就可以挑一部你喜歡的電影然後好好的去研究這些，就要去想它鏡頭、場景的轉換，背後有什麽可能的想法，或是他這個光線怎麽打會有什麽意涵這樣。'
						}
					]
				},
				{
					bigtitle:'二、課外活動',
					sections:
					[
						{
							title:'機器人繪圖及其商業應用',
							section:'機器人繪畫其實就是從我繪畫的經驗來的。我想要做出一個像人一樣的繪畫機器人。人在作畫的時候會用眼睛看，然後腦袋會去思考怎麽畫。可能第一次畫不會成功，但是你可能會去修正它。經過修正的這些動作，再把它畫出來。機器人看、感知的部分就是需要sensor，利用相機去偵測影像。然後機器人要用它的腦袋去想要怎麽畫，就是我們需要設計一套演算法。那這些演算法的概念大概就是從我自己繪畫的經驗去想的，比如説調色只需要五種顔色，就可以混合出大部分的顔色。這其實也是因為我在學畫畫的時候老師一開始只給我用基本的顔色，所以看到這個顔色你就要去想，它是怎麽組成的。然後如果比例不能一次做到位，就需要，一直去修正他、補償他。那機器人其實也是在做這件事情。對，所以這就是一種視覺的回授這樣子。我自己認定這是一個科技跟藝術結合的例子。現在有一些公司有在做一些科技跟藝術的展覽。以往這兩個領域是分得蠻開的，藝術純藝術，繪畫、雕刻那些的，然後科技就是科技產品，然而現在有一種趨勢就是把這兩個領域做整合，那我現在做的可能就是類似這種概念，可能是一種形式的娛樂吧。'
				        },
						{
							title:'藝術學習歷程',
							section:'畫畫的學習就是一種感受吧，比如説顏色這件事情，老師不會跟你說這個是什麽加什麽，你就是要去感受，這可能有什麽顔色，然後去嘗試。那可能這個顔色可能這次調不對，那下次怎麽調，就是一個慢慢摸索的一個過程。剛開始學的時候，看的東西很少，一開始在學的時候，可能看到一張照片就想要把它畫得很細很像這樣。但是學到後來會看到更多，比如説我要表達什麽樣的感覺，不一定要畫得很像，可能會用一些筆法讓它變得有我要的感覺這樣子。那可能到後來會有一些取捨，就是重要不重要的，慢慢有自己的特色出來。我是很享受這個過程。如果你今天在學一個興趣，不要給自己太大壓力，例如說我畫畫一定要當畫家這樣。我是沒有這樣給自己壓力，畫畫的時候是很輕鬆的，因此在累的時候也不會說我要放棄。如果今天不想畫，那就不要畫啦！今天想畫我就去畫啊！就是一個我想要做什麽就做什麽，不用給自己壓力。其實我畫室的夥伴年紀都比我大，蠻多長輩的。我們畫室裡面有一個長輩就是八十歲了，是個很酷的人。他一生不斷地去嘗試各種的東西，還學國畫，也是書法老師。他畫的時候還是不斷的在嘗試新的東西，他已經八十幾歲了，然後可能身體也不是那麽好，手可能也不太能舉，所以他有時候畫一畫可能就休息一下，但他就是一生不斷地去嘗試，他説畫畫是一個建構再破壞的過程，比如説你在畫油畫，你把它畫上去就是在建構。那破壞是你又加了另外一層把它蓋過去或是什麽的，慢慢的去疊到最後的樣子。我自己覺得人生可能也就是這樣，去建構一些你的人格特質，並破壞一些你覺得不好的或是不重要的東西。然後慢慢的，這些過程一直重複之後就會變成你這個人。'
						},
                        {
							title:'山服社團',
							section:'其實在參加社團之前大概就是一個電機系學生，看到的很小。機緣下才去參加山服。但我去參加服務性社團，也不是像一些很有服務熱忱的人，一開始就是要去幫助小朋友。我其實是因為服務學習缺學分，便跟朋友一起去，在山服體會到的影響我很大。都是一個機緣之下這樣。其實我們就是寒暑假辦夏令營跟冬令營，會有一些課程，要準備教案，比如説數學的教案，大家就可能就會想一些有趣的方法讓小朋友去學數學、英文或是學語文那類的。主要是啓發他們對學習的興趣，還有陪伴他們長大這樣子。其實我在研究所還是常常會回去幫忙啊！沒辦法整個營期全部參與，但有機會就會回去。也不一定要跟著社團回去，有時候跟朋友就是想要回去山上看那邊的人那我就回去。其實對我們來説那是另外一個很像家的地方。我覺得參加社團是讓我變成是一個完整的人一個很重要的過程。因爲我覺得一個完整的人不是只有你學到的知識那部分，是你懂得關心別人或是懂得去照顧其他需要幫助的人。這個是我覺得很重要的人格。比如説山上的小朋友，他們其實非常天真，很直覺、真誠地去對待人。有什麽想法就展現出來，那對我來説是蠻感動的。因爲我第一次去山上的時候很緊張，可是看到小朋友他們就直接很熱情的爬到你背上然後跟你玩。那時候我覺得非常感動這樣。'
						},
                        {
							title:'關於興趣＆人格特質',
							section:'比如説更懂得去關心身邊的人之類的。多去感受身邊的事情，這是一個我覺得很重要的一個特質，同理心。可能就是需要經過一些事情，你就漸漸覺得這個很重要。我覺得我很幸運有這方面的感覺、感知，而我會希望朝這個方向繼續努力這樣。這其實蠻困難的，但是你可以挑出你不喜歡的。這個領域我絕對不行，那就找一個不是這樣的。那其他部分的話，除非你很確定嘛，不然的話你不試你就不知道喜不喜歡啊。如果你覺得好像不排斥，就可以再繼續嘗試這樣。我自己也是覺得很難很快的就知道自己怎麽做才是對的。我自己是覺得不一定一定有一條最完整的，或是最完整的路或是最好的路。或是你其實你已經在完整的路上，可是你覺得你會不會有其他更好的選擇。因爲你沒有那麽多的時間，所以就是你嘗試的這條路你可以接受，那你就走。那如果你想換跑道那你就換。就是找一個相對正確的路這樣子。我的感覺啦。多去體驗不一樣的東西，多去嘗試。因爲不管你做哪一件事情你一定都會有一些收穫。那這些收穫拼凑起來就是變成一個完整的。你在做某一些事情的時候就是很認真的去做，然後很認真地去感受，你就會有收穫這樣子。多嘗試你就會有不一樣的可能。就不要想太多，全心全力的投入'
						}
					]
				},
				{
					bigtitle:'三、挫折與夢想',
					sections:
					[
						{
							title:'求學瓶頸',
							section:'瓶頸...倒還好，但一定有挫折。比如說，我有一個很好的麻吉，我們常常一起讀書，一起玩，但他就是天才。我們明明讀書的時間都差不多，喔沒有，他應該比我少，但他就是很強，這種人就超討厭的。然後我自己覺得我不是很聰明啦，相對那些天才而言啦，但就是換個心態啦！幹嘛跟他們比呢(笑)。每個人都有他比較擅長的部分啦。'
						},
                        {
							title:'未來願景',
							section:'我想弄一些結合科技跟藝術的project。然後我也想把一些我覺得重要的價值觀，透過這樣的方式去呈現。譬如說，環境保育，覺得很重要，就想說怎麼把他放進去，還有教育，小孩教育的那部分，我能不能用這東西去給小朋友去學一些東西這樣。我有跟朋友在想一些project，想弄一個互動方式讓小朋友知道，種樹會讓地球變得更好之類的。那我可能就會透過一些，比如說，sensor讓他能夠有互動，然後有，種樹，地球會變得很美好，這個概念把它顯現出來。'
						}
					]
				},
                {
					bigtitle:'四、給學弟妹的話',
					sections:
					[
						{
							title:'給大學部的建議',
							section:'多嘗試，抬起頭來看外面的世界，這很重要，看你周遭的人，不要只有看到自己的事。然後也不要太急，人生很長，你有時候太趕，我這個階段一定要做什麼事情，我下個階段一定要做什麼事情，太急或是太確定，也不是說太確定不好，就是給自己的範圍太小了，那你可能就會錯過一些體驗其他事情的機會，那我覺得很可惜。所以，我自己是覺得，人生很長，我之前修的那門課的老師有講，他說：『人生很長，給自己三五年去探索自己，或是摸索人生，是沒有關係的。』你不用一定找到一個最正確的路，但你用這個時間更了解自己的話，那你之後可能會走得更明確。另外如果你會想要做類似我在做的這件事情的話，一定就是你對藝術是有興趣的嘛，通常你自己有一些背景，比如説像我有一個同學他鋼琴彈得很强，他其實也想要做一些音樂跟科技結合的技術這樣子。學習上的建議，就是你盡可能把你自己的一些專業知識結合你現在學的東西，然後往這個方向去想去發展。'
						},
                        {
							title:'一句話，談談電機系給的歸屬感',
							section:'在電機系真的是認識到一群很厲害的人，很有想法，可以從他們的一些觀點去看同一件事情的各個面向，認識這群朋友本身就是很大的收穫。我覺得電機系對我來說最有印象的歸屬感應該是系籃吧，大家能夠這樣一起走下來，感情變得非常好，很難得。'
						}
                    ]
                }
			],
			
			
			annotation:['特別感謝：洪銘駿','撰寫：劉衡謙 賴明緯 潘彥銘 葉加祈 Sasa Chen'],
			id:'column_HungMingJiun'
		}
		return (
			<div>
				<Column_content content = {column_HungMingJiun_article}/>
			</div>
        )
    }
}

export default Column_HungMingJiun;
