import React, { Component } from 'react';
import Column_content from './component/column_content';
// import './column_text.css';


class Column_1603 extends Component{
    render(){
        const column_1603_article = {
			title:['2008級 趙式隆（台灣矽谷創業家協會理事長）'],
			hashtags:['系友專訪', '首PO', '趙式隆', '2008級', 'B93', '創業就像搶銀行', '台灣矽谷創業家協會理事長', '學悅科技Zuvio創辦人', '台灣虛擬及擴增實境產業協會共同發起人', '網路與多媒體實驗室助教', '台大創創學程', '保持好奇心勇於嘗試' ],
			sections:[
				{
					bigtitle:'一、談創業經驗',
					sections:[
						{
							title:'台灣矽谷創業家協會',
							section:'台灣矽谷創業家協會，是一個非營利組織。過去台灣有很多人到了矽谷去，然後在RCA（編按：Radio Corporation of America，美國無線電公司）的訓練下回來，創造了今天的新竹科學園區。那當然現在的台灣，其實在新創產業這一塊遇到了一些瓶頸，就是我們有人才可是沒有市場跟資金。在現在這個時代，政府也送一些團隊到矽谷去，但是到達矽谷的時候我們就會發現，台灣團隊要存活下來不是那麼容易。所以我們希望能夠做出一些橫向連結，也許可以增強台灣在矽谷的生存機會。另一方面我們也希望，不見得能夠活下來的團隊，可以將一些矽谷的精神帶回台灣。例如，在矽谷他們非常鼓勵失敗的經驗，然後你再重新站起來，但在台灣其實沒有成為一個共識，這是在這個環境上面一個很辛苦的地方。我現在做的事情蠻雜的，基本上就分成這幾個面向。'
						},
                        {
							title:'Zuvio',
							section:'Zuvio做的是一個教學互動系統。一開始，大概三四年前在葉丙成老師協助下和幾個學弟一起做的一個專案，這專案主要解決的問題是，上課時老師和同學的互動問題，老師在上課問問題，學生都不見得會回答；或者學生心裡可能有些想法，但是不敢跟老師說。那時候我們就想說讓學生可以透過他們的手持裝置跟老師互動，從原本一個OPEN-SOURCE project做到現在。這間公司最開始的時候狀況是這樣：就是當年我在教的一些課遇到一些問題，可能當我在帶各式各樣的課程，例如機率與統計、微分方程，我問學生：有沒有人有問題？即使在教了幾年經驗之後，知道這個段落大家都會有問題，但大家也都不會發問。一到下課的時候，你知道台灣人就很喜歡偷偷來，然後大家都會圍過來，結果每個人問的問題都一樣，然後助教我就走不了，就會很不爽！很多人心裡有問題不問，考試的時候才不會寫，我覺得這件事情非常不行。當時我們從來沒有想過這個事情可以成為一個business。直到第一個學弟跟我們說，他要離開去上班了，但可能還是可以fully-support這個project。那時候我們就說：「好啊、你就去上班、有空來support這個project。」然後你會發現當人去了台灣的科技公司上班之後，上班以外的時間不是在加班就是在睡覺，所以基本上他是沒有時間來support這個事情的。那後來第二、第三個學弟再跟我們提一樣的事情的時候，我就知道這時候不行了，我們要有一個若干的Business model。所以那時候我們就把公司開起來，很幸運地一直做到今天。我們的初衷很簡單，就是解決老師和學生之間的互動問題。當學生和老師之間沒辦法透過語言來做很自然的溝通的時候，我們希望透過手持裝置來改善。我們現在仍然一直專注在這個點上面，這是一個問題，我們相信我們能提供最好的一個解決方案。'
						},
                        {
							title:'創業的挫折',
							section:'我覺得正常在創業的人不會講挫折，因為創業必然要是樂觀的。每天都會遇到一堆很糟的事情，如果沒有很好的調適，通常無法繼續往下。我們公司有遇到一些小挫折，就是基本上是獲利了，但主要的客戶是學校和大型公司，開票期的匯款interval是很長的。這就很常遇到一件事情：下個月大家要領薪水，沒有錢怎麼辦？這時候你就要自己從口袋掏錢出來把這個事情墊掉，那你有沒有這個Guts？這種事情一開始做會覺得天啊！怎麼是這樣。但後來久了之後會覺得創業這樣是常態嘛。也常常會被罵，被員工、使用者、各式各樣的人罵，但被罵久你就會習慣了。剛開始會覺得說生活中的每件事都是挫折，而現在已經是生活的一部份了。'
						},
                        {
							title:'創業像什麼？',
							section:'創業這件事情很像搶銀行。怎麼說？大家應該看過一些電影，就籌備過程而言，通常主角需要很棒的團隊，技術高超的駕駛、開鎖專家、爆破專家...各式各樣的人；再來會需要一個很縝密的計畫，去想每一步要幹嘛；第三件事情是計畫永遠趕不上變化，當企劃看似完美的時候，永遠不知道中間會遇到哪些突發狀況。就結果來看，創業跟搶銀行一樣，如果成功，會變得很有錢，當你的公司被併購或上市的時候，你會變得很有影響力，做到任何你想做的事情…但是，他也很容易失敗。我覺得創業跟搶銀行最像的事情是，他的成功機率非常非常低，而且創業成功的機率可能不比搶銀行的高。我們很常看到非常有潛力的新創團隊，在短短三年內就消失了。'
						},
                        {
							title:'電機系學生特質與創業',
							section:'我自己最欣賞的一類創業者是所謂技術型創業者，他們有著一個靈魂，叫做駭客精神。我講的駭客不是這些搞破壞的駭客，駭客是一群能自己打造工具的人，當一個問題在你前面時，你又沒有工具可以用的時候，你會去想怎麼樣有能力去把它打造出來，所以我最欣賞的是有技術背景的一群人，可以自己打造工具。我想電機系的人大部分都有這樣的條件，為什麼？因為我們都看到電機系的學生在這裡受到四年的摧殘，如果能順利畢業的話，這群人就算一開始不聰明，到最後你也必須學會在很短的時間學會一樣東西，即使你學不會也要有辦法在答案上寫出來。我覺得在臺大電機系這個高壓力的環境下，人的能力是志不在話下。還有第二個很大的優勢，我們有非常多優秀的同學，在一起可以做很酷炫的事情。我們每一年電機之夜就是辦得超盛大，讓大家以為我們花很多錢（還是真的花很多錢這我不清楚）。最後一個事情是，在這個人脈網絡裡面，台大電機系佔了一個很重要的角色。很多人大學的時候功課非常爛，大學畢業之後轉換跑道，我們有人在華爾街、在矽谷、在各式各樣的產業，甚至有人是書法家或作家，台大電機系有非常多，你可以想到做各式產業的人都有。甚至像我今天早上跟我們配合的會計師事務所開會，那邊的會計師就是台大電機系畢業的學長。所以我覺得，台大電機系有各種面向，當你想要走任何一條路的時候，都有一個模範可以去參考。回頭說明，為什麼這對創業有幫助？我覺得創業有兩個要件：第一個是所有的事情都有一個死線。你必須要在死線之前完成所有事情，所以你快速學習的能力很重要，而抗壓的能力很重要。十天前公布的作業，你可能前面九天都在打電動，最後一天要把事情做完，當有個死線、你就可以把事情完成、而且是完美的完成，而你前天晚上沒睡覺，隔天上去發表，還是可以講得像前一天睡得很飽一樣。我覺得在臺大電機系這個訓練在人的素質上是一個非常重要的要件。再來是一個統合型的能力，因為任何一間startup都跟大公司一樣，只是startup比較小。大公司每一件事情都不能省略，法務、財務、稅務...所有事情，只是startup人比較少，所以每個都要會。那在台大電機系，你有豐富的學長資源，或是你在大學的時候，如果你願意你可以做很多的事情，在大學就可以很早的體驗到這些事情的重要性，特別像台大電機系活動辦得這麼多，可能是拉贊助之類的，我覺得這些事情都非常重要。我覺得這些都是台大電機系未來要創業一個很重要的基礎，因此在這邊我不會不鼓勵大家創業，如果連台大電機系都不創業，那其實台灣沒有希望了。'
						}
					]
				},
				{
					bigtitle:'二、人生迄今的里程碑',
					sections:
					[
						{
							title:'求學時期',
							section:'我現在三十歲，過去不同階段有不一樣的想法。小學的時候打籃球，而且打到全國冠軍，以為未來會成為運動員。後來家裡要我讀書，我就讀書。從國中讀到建中資優班，比奧林匹亞保送進電機系，中間的過程也有很多想法，像比奧林匹亞會覺得自己是不是該對基礎科學有偉大的貢獻。可是那時也學習寫程式，覺得寫程式也是超級有趣的事情。後來在家教的過程，開始對於教書有興趣，教到別人學會是非常有成就感的，所以那時候我想當大學教授。當時聽說要出國回來才能當，所以那時候有準備出國，但因為家裡有點狀況，最後就留在這裡讀博士班，希望留在這裡當教授。但是當真的開始在學術界，我前前後後在台大電機系待了12年，我發現所謂這樣的學術圈跟我想像的不太一樣，我就開始想像這到底是不是我要的生活？'
				        },
						{
							title:'創業與目標',
							section:'因為Zuvio也開始在動，我就想說不如就先作為一個創業家、繼續做這樣的事情。但是開始作為創業家這個事情後，我就回歸到去思考我這個人想做什麼事情，我覺得我終其一生在追求的目標，其實是讓這個世界不要再有階級複製，去解決階級複製這個問題。當一個社會沒有辦法提供一個扭轉的機會，沒有辦法讓社會底層的人能抓到一條線去提升自己的社會地位是不合理的。舉例來說，賈伯斯是來自於相對地位比較低的地方，但他在美國能夠成功，於是很多人講美國夢，講得就是當下在美國這樣的環境，不管你的出生是什麼，都有機會可以成功。我就開始思考，這背後的原因到底是什麼？我發現，其實要打破階級複製的兩個最重要的要素：第一個叫做教育，所以那時候我想要教書，現在創業也是做教育相關的；第二個叫做醫療，當大家有健康身體的時候，才能夠在一個合理的水平線上做競爭，但醫療是一個資金密集的產業，我自己的想法是，當我把現在做的這些微創新、小玩具，得到初步的成功之後，我希望把這個東西投注在醫療上面，試著去改變、讓這個世界變得更好。這是我最想要做的事情，人生是個最佳化的過程，你永遠不知道絕對的最佳化是什麼，但當你走每一步的時候，你可以針對下一步做最佳化，我們叫他做Greedy Algorithm，其實你走出來的路不會太差。這是我現在三十年一點點的經歷、能夠分享的差不多是這樣。'
						}
					]
				},
				{
					bigtitle:'三、給大學部的建議',
					sections:
					[
						{
							title:'保持好奇心、勇於嘗試',
							section:'對於一般的大學生，我通常會給一個建議「保持好奇心、勇於嘗試」。大學是人生中成本最低的階段，過了這階段，會發現每一件事的成本都非常高。假如你已經結婚了，還有小孩，你敢不敢再去做一件很冒險、可能讓你傾家蕩產的事情？不見得敢。當你年紀越大，擁有得越多，就會越害怕。特別是在這個資訊爆炸的時代，所有的事情都是透明的，可以看到很多機會，但你會不知道這些是不是真正很好的機會，不知道自己是不是真正喜歡，那我覺得應該是加法模式，而不是減法，看到這東西覺得喜歡，就嘗試看看，覺得不好就趕快換掉，在這一個過程裡面，保持對很多事的好奇心是很重要的，很多事情不試著做，就不會知道事情最後會怎樣。'
						},
						{
							title:'一句話談談電機系？',
							section:'對我來說，電機系像是一個家，我在電機系待了非常久，從大學到現在12年，幾乎是我人生一半的時間了。所以，這邊的每一樣東西我都很熟悉，哪邊改變過了我都知道，看過很多很多事情。這裡對我來說是一個歸屬感很強的地方、我覺得對於很多電機系的學生來說，在這邊待了大學四年，其實你在系館花掉的時間遠比其他系的人多，因為你熬夜的時間很多、你在這邊半夜做作業的時間很多、然後你在這邊為了要跟同學討論、你不得不去學校做很多很多事情。我覺得相較於很多系來說，電機系是個向心力很強的地方。即使我在大學的時候不太參加系上活動，到現在這邊畢業的每一個學弟妹，名字可能叫不出來，但是臉都熟悉啦。我覺得自己對這裡有非常深刻的感情。'
						}
					]
				}
			],
			
			
			annotation:['特別感謝：趙式隆','撰寫：許秉鈞 袁培傑 劉禹辰 曾耕森'],
			id:'column_1603'
		}
		return (
			<div>
				<Column_content content = {column_1603_article}/>
			</div>
        )
    }
}

export default Column_1603;
