{
  "top": {
    "experience": ["17直播 技術副總"],
    "hashtags": [
      "系友專訪",
      "李昀樵",
      "2012級",
      "B97",
      "Harvard",
      "MBA",
      "新創",
      "創業",
      "語音處理",
      "17直播"
    ],
    "name": "2012級 李昀樵"
  },
  "body": {
    "body": [
      {
        "bigtitle": "一、大學時期",
        "bigsections": [
          {
            "subtitle": "學長在大學時期就對語音產生興趣了嗎？是甚麼原因讓您有興趣呢？",
            "subsection": "我大學的時候修了語音實驗室的專題，就覺得對語音相關的資訊很感興趣，事後看來這是一個蠻好的決定，因為碩一時剛好是deep learning在語音開花的時候，也讓我多接觸到 deep learning 這個領域。"
          },
          {
            "subtitle": "在語音實驗室時做過哪些研究？請問內容與日後工作是否有相關性，以及對您的影響？",
            "subsection": "在語音實驗室時主要是做retrieval相關的東西，例如語意檢索(Semantic Retrieval)，也就是當你想要尋找的term不存在在文章中但該文章仍跟這個term 有關時，該如何尋找到這篇文章。\n    至於內容是否跟日後工作有關，其實碩士的研究通常跟未來的工作沒有直接的關係，除非做PhD，研究的東西才會跟工作比較有關聯性。碩士主要是培養做研究的能力，也就是教你如何藉由大量閱讀 Paper 和重置他人實驗來學習某個領域最尖端的知識，這其實是很重要的能力。"
          },
          {
            "subtitle": "為何會對新創事業感到有興趣？",
            "subsection": "大三的時候加入了創創學程，當時在創創學程開了非常多的眼界，然後認識了台大各系關於這方面的人才，日後發現這些人在今日的新創產業中仍非常的活躍。大四時跟外系的幾個朋友參加了一個創意競賽，當時其他同學有很好的發想，但不知道如何用程式寫出來，所以就找了身為電機系的我，最後大家一起完成了一個 prototype。之後同一群人也一起做了幾個 app 和產品，因為有各系各個領域的人，所以大家分工，我負責開發，有人負責宣傳。最後甚至跟這群人一起開了公司，甚至在學期中請假到矽谷募資，是個很有趣的經驗。"
          },
          {
            "subtitle": "系上的課業繁重，有什麼是鼓勵學弟妹在大學中一定要嘗試的事情？",
            "subsection": "我會鼓勵大家在各方面都要勇敢嘗試，不能只顧課業。事後看來，大學期間對我幫助最大的事情，在當時看來都是不知道對未來有什麼幫助的，只是覺得好玩就決定試試看。比如參加陽光椰子社、台大藝術季、創創學程、參加創意競賽、做 Side Project、開公司等等。另一方面對我幫助最大的是大學期間認識的朋友，每個人都有獨特的背景、故事和能力，從他們身上我得到了很多啟發。"
          }
        ]
      },
      {
        "bigtitle": "二、生涯規劃",
        "bigsections": [
          {
            "subtitle": "對於出國讀研、在臺讀研、直接工作的選擇?",
            "subsection": "其實在大學時，我對於這些路都有事先做一部分的準備，例如有當兵、準備研究所推徵，出國的部分也有去考 TOFEL、準備 GRE 等等。我最後選擇留在臺灣，很大的原因是我希望能夠陪著家人。另外，因為讀研究所可以培養與實際上的知識接軌的能力，而我當時知道自己仍需要培養這種能力，因此選擇讀碩士。\n    然而，我覺得在大學時自己沒有很積極地找已經出社會的學長姐詢問相關的建議。我也建議學弟妹可以多找大約 30 歲左右的學長姐諮詢，他們可以給予較為成熟的建議。我在申請哈佛 MBA 的時候發現管理學院的學生，會時常向年紀較近，或是已畢業一段時間的學長姐諮詢自己的職涯規劃，我覺得這是一個蠻好的決策輔助。"
          },
          {
            "subtitle": "當時是否曾考慮繼續就讀博士?",
            "subsection": "我當時沒有考慮讀博士，因為自己並非很想走純研究路線，我的興趣主要是在實務中應用這些前端知識。另一個考量是時間，博士通常會讀 4、5 年，這個機會成本也是要一起考量的。"
          },
          {
            "subtitle": "畢業後自行創業的考量?",
            "subsection": "其實在讀碩士的時候我就已經有創業的念頭，那時候已經和許多朋友進行很多 side projects，甚至還大膽地在學期中請假飛到美國矽谷募資、面試美國加速器等等，現在回想起來當時真的是一股衝勁。我覺得人生應該多多嘗試，才會知道自己到底想要什麼，尤其現在資源很多，想試就去試。若你覺得非做不可，那就放手去做吧！\n    但相反地，不要一味地跟風，要思考好再做決定。我覺得對學生來說，直接去風險太高。比較好的方法是做 side projects，如果這個 project 能夠做起來的話，再嘗試全職來做，我自己現在也一直都還有在做 side project。另一方面，我覺得學生通常在經驗和能力方面通常都較為不足，所以如果對新創感興趣的話，先加入一個有潛力的新創學習一下，也是一個好方法。"
          },
          {
            "subtitle": "今年選擇去哈佛念MBA的考量?",
            "subsection": "我覺得這是個增廣眼界的過程，回想起過去，常常人生中重要的轉捩點是在不同環境下遇到不同的人而產生的，而 MBA 就提供你一個不同的環境並能夠跟一群特別的人相處。\n    再來就是在亞洲創業的話，常常會覺得台灣新創產業有個天花板，因此覺得需要跟國際接軌，要學習如何去獲得國外的資源，例如眼界、經驗與資本，來突破這個天花板。"
          },
          {
            "subtitle": "可以說說現在對未來的規劃嗎?",
            "subsection": "下一個目標就是希望創業成功，並且有機會的話能夠回饋社會，找到自己能夠貢獻並幫助社會的地方。"
          }
        ]
      },
      {
        "bigtitle": "三、在17直播的經歷",
        "bigsections": [
          {
            "subtitle": "加入 17 直播的考量?",
            "subsection": "我會想加入 17 直播的原因有三個。第一是技術層面，我想加入的是有足夠技術深度與挑戰的公司，而 17 直播是臺灣使用人數最多的直播平台，再加上直播本身也是個有足夠技術挑戰的領域，所以 17 直播是個能提供足夠技術挑戰的公司。第二是創辦人，加入之前我與 17 的創辦人之一黃立成聊過幾次，我覺得他的想法、經驗與視野都有很值得學習的地方。第三是公司文化，我很喜歡新創公司那種自由、自治的風氣，每個人都把公司當成是自己的，大家都盡全力讓公司發展得更好，這是我很喜歡 17 這間公司的地方。"
          },
          {
            "subtitle": "在 17 直播中扮演的角色?",
            "subsection": "我在公司的職位是產品和技術副總，負責規劃產品方向、規劃技術架構和確保產品品質等等，也要負責管理團隊、建立團隊文化等等。"
          },
          {
            "subtitle": "聘用員工時如何判斷一個人的能力?",
            "subsection": "要判斷這名員工是否是公司想要的人才，我大概會從三個方向著手。\n    第一，是否具備硬實力，我通常會列出這個職位必須的技能，再逐項驗證。例如他如果是程式工程師，最重要的技能就是寫程式，我的做法通常是給他幾個程式題讓他當場寫。\n    第二，團隊合作，我必須知道這個人如何與團隊合作，以及判斷這個人是否好相處。我會觀察他在面試中的應對進退和過去經驗，比如是否有團隊精神，是否會太自我或是無法接受他人意見等等。\n    第三，如果是需要帶人的職位，我會確認領導能力，主要會問他一些過去建立與帶領團隊的經驗，以及問對方一些情境題，例如與老闆或員工意見不合的狀況，他如何解決。"
          },
          {
            "subtitle": "大學、碩士與工作的差距?",
            "subsection": "加入 17 直播之後所做的東西大部分是大學或碩士時沒有教過的，也就是說要從零開始學，自己找國外的資源閱讀或參加 conference，跟產業中厲害的人學習，比如說跟這領域的意見領袖聊天理解這個領域的大方向。\n    17直播剛開始做的時候主要是兩個領域，media streaming和distributed system(分散式系統)，這兩個當初在台大時沒有太多接觸，只能自己從網路上學，或者找會這些東西的人學，當時幾乎是邊學邊做，系統每幾天就會超載一次，壓力還蠻大的，但我覺得在大學基礎有打穩的話，這些技能學起來還蠻快的。建議學弟在大學時要把核心能力打穩，比如說如果未來要走 CS 的話，那現在應該把作業系統、資料結構、演算法、基本的幾種程式語言等等都學好，至於其他比較細節的東西，之後學起來會很快。至於哪些是核心能力，可以向業界的人聊天，請教學長姐或教授。"
          }
        ]
      },
      {
        "bigtitle": "四、給學弟妹的建議",
        "bigsections": [
          {
            "subtitle": "給未來想要進入新創產業的學弟妹的建議?",
            "subsection": "我覺得有三個面向可以講：興趣、技能、選擇。\n    首先就是你要有興趣，並且必須知道新創產業是有風險的，不要一窩蜂覺得新創很好就去加入。\n    再來是技能層面，加入新創產業前，自己要先想好要具備並培養怎麼樣的技能，如果你想進大公司 Google、Facebook，那你應該把大部分的時間投資在 coding 上。但是在新創產業裡，可能要稍微分散一點，對各方面都要略有了解，像是 coding 能力、溝通合作能力、對產品的 sense、對公司策略也要有想法，要能在公司裡找到自己的定位做出最大的貢獻，幫助公司成功。對個人而言，你要為自己未來的發展做規劃，如果創業失敗了，要確保自己這樣的技能在市場上是有退路的。\n    再來是選擇，選擇自己想要加入怎麼樣的新創公司，你可以想像你自己是創投公司。概略來講，他們首先可能會評估市場，評估市場對這個產品的需求、有無競爭力等等，再來要評估創辦人是否足夠優秀，跟團隊有無足夠的能力持續地走下去。而你自己在做選擇時，就是要像創投公司一樣思考值不值得把自己未來幾年的時間投資在這間公司上面。"
          },
          {
            "subtitle": "環境衝擊與建立新的交友圈",
            "subsection": "我覺得在大學時，建立多元交友圈是很有幫助的，每個學院的學生都有自己的文化、思考和做事的方式，在大學的時候多跟不同學院的同學接觸，對於開拓眼界是很有幫助的。台大在這方面提供蠻多方式的，比如修學程、跨系修課，參加各種社團等等。\n    比如我之前暑假到 Boston Consulting Group (BCG) 做 Part Time Assistant，就受到很不一樣的文化衝擊，在電機系我們通常把重點放在 code 的品質，但在 BCG 要學習如何思考商業問題、如何為公司創造價值、和如何跟主管與同事溝通等等，這些不一樣的思考方式後來在職場上對我幫助很大。"
          },
          {
            "subtitle": "您覺得您成功的關鍵是?",
            "subsection": "首先我是覺得我離成功還有蠻大一段距離。如果說回頭看過去幾年的話，我覺得在做決定時，比起選擇可預期的道路，我更喜歡多方嘗試各種方向，其中不乏風險高的方向，比如說加入早期的新創公司。我的感覺是按部就班地規劃未來的人生，反而無法跳脫現有的眼界，多方嘗試才更容易找到新機會和新方向。"
          }
        ]
      },
      {
        "bigtitle": "五、與台大電機系的連結",
        "bigsections": [
          {
            "subtitle": "電機系給您的歸屬感?",
            "subsection": "很多好朋友甚至現在一起合作的夥伴都是電機系同屆或上下屆的同學，電機系的老師也一直給我很多幫助，我現在也還是有跟比較熟的老師保持聯繫。"
          },
          {
            "subtitle": "覺得電機系的有什麼共同特質?",
            "subsection": "我覺得電機系的同學非常優秀，在各方面學習理解和創新能力都很強，在我們公司的電機系同學表現也很傑出。我覺得學弟妹們如果能更勇於多方嘗試、不要只走成功率高、低風險的路，電機系的同學能夠在更多元的領域做出好成績。"
          }
        ]
      }
    ]
  },
  "annotation": {
    "annotation": [
      {
        "job": "撰寫",
        "contributer": "吳建翰、余欣澄、莊永松、鄭謹譯"
      }
    ]
  },
  "id": "1909"
}
