module.exports = {
  title: ['1995級 徐瑞廷（BCG 波士頓顧問公司董事總經理）'],
  hashtags: [
    '系友專訪',
    '徐瑞廷',
    '1995級',
    'B80',
    'StanfordUniversity',
    'SantaClaraUniversity',
    'MBA',
    '史丹福大學電子工程學碩士',
    '聖塔克拉拉大學MBA',
    'BCG',
    '波士頓顧問公司合夥人暨董事總經理',
    'BCG台北辦公室負責人',
    '策略顧問方法與實務',
    'StrategyConsulting',
    '探索自己',
    '多想下一步跟下下步',
    '獨立思考',
  ],
  sections: [
    {
      bigtitle: '一、前言',
      sections: [
        {
          title: '致謝',
          section:
            '系學會很感謝 1995級林哲立系友 與 1995級丁建均教授的大力幫忙，讓我們邀請到徐瑞廷系友參加本次專訪。徐學長是史丹福大學電子工程學碩士 / 聖塔克拉拉大學 MBA，畢業後在BCG 波士頓顧問公司擔任台北辦公室負責人、合夥人暨董事總經理；除此之外，學長和 台大國企系李吉仁教授 也曾在2016年九月共同開授選修課程「策略顧問—方法與實務」 (Strategy Consulting: Approach and Practice, https://www.facebook.com/BCGinTaiwan/posts/1110247705713105 )現在讓我們一起看看徐學長的分享與心路歷程。',
        },
      ],
    },
    {
      bigtitle: '二、碩士時期',
      sections: [
        {
          title: '畢業後選擇的領域',
          section:
            '從台大電機畢業以後，當時對我來說最直接的選項就是出國念研究所，就是想出國看看。我希望申請到一流的學校，所以同樣申請電機系所。在申請國外學校時，並沒有細分電磁、自動控制等領域，是在Stanford讀研究所時才確定領域。我後來是攻讀IC design，主要也是因為IC design在當時的矽谷是熱門的領域。在Stanford上課和我在台大的經驗最大的不同，是很多上課的教材直接從業界取材。比如說上電路設計的時候，我們研究的電路樣本就是來自於幾家真實的公司，像是HP、DEC(Digital Equipment Corporation)，對我的衝擊很大。我了解到原來業界很多領先的電路是長這樣子，你可以想像那跟教科書有很大的不同。同時我也認識到，畢業後如果去這些公司，大概會是做哪些事情、我需要那些技能。加上IC design本身就很有意思，後來我在研究所花了很多時間研究IC design的課，畢業以後就直接去DEC設計CPU。大概是這個樣子，可以說我的選擇是受到很多研究所課堂的影響。',
        },
        {
          title: '當年最尊敬的恩師',
          section:
            '我的恩師有兩位教授：其中一位教授上的是電機系一門很難的課，卻可以把很難的課用很白話的方式講解，不會一開始就進入技術的細節，而是先給大家一個大的概念框架，再深入淺出的說明。我對他印象很深刻也很喜歡聽他講課。另外一位老師則是非常關心學生，從一些小的互動可以看出他有在觀察學生，然後在其他地方顯現他的觀察並投射到他的互動中。',
        },
        {
          title: '大學的成就',
          section:
            '我必須承認，大學時候的環境對我來說還是相對封閉，我也不知道畢業以後要做什麼、職場的要求是什麼，所以選擇的領域主要是當時學業上比較熱門的話題。大學期間選的專題是比較像無線通訊的，在90年代，行動通訊被認為是未來的趨勢。當初選擇的原因只是因為熱門，並沒有太多的想法。',
        },
        {
          title: '出國念研究所的意義',
          section:
            '這問題其實不太容易回答。很多事情沒有自己經歷過，我是不太能評論的，畢竟我只看到結果，卻沒有看到過程。我想將重點放在我自己在美國就讀研究所的過程中，遭遇到的幾個衝擊：第一個衝擊是，美國研究所的課程題材十分實用，就如先前所提，基本上是跟業界緊密相連。我後來才明白箇中緣故：因為這些研究所，尤其如Stanford，課程的修習者不單只有學生，也包括了很多業界人士。像我們當時修習的某門課程，現場修課人數約有100多位，但其實還即時與矽谷幾個大企業(如：HP辦公室)連線同步授課，因此老師實際上正向數百人授課。這個例子的意義何在呢？老師教課時傳授的知識與技術有用與否，會直接反映在學生對他的回饋上；換句話說，一門課的課程題材實用性不高，很可能會在開課幾次後因為評分過低，遭到淘汰。我覺得這樣的互動對師生都是有益的：對學校老師而言，他課上傳授的一定得朝著實用的方向去；然而在平常與學生的互動中，老師也得以了解哪些事是相關行業人士所注重的。而我們這類剛從大學部上來的學生，也能馬上跟業界接軌。總結以上所述，在我的認知中，與業界連結緊密是最大的不同。第二個衝擊則是，當時在美國念研究所，並非每間研究所都要求寫論文，甚至可以說大部分的研究所皆沒有寫論文的要求；需要寫論文的人，多半是在攻讀博士學位。所以我當時在Stanford讀了九個月左右，就拿到了碩士學位；但若在台灣的話，無論怎麼規劃，沒花上兩年大概不太容易畢業。還有很多尚未提及的差異，或大或小，畢竟美國與台灣之間有太多的不同了：地域上的變數、文化上的變數、校風的不同等，要仔細比較可能花上三個小時都還講不完呢！在我的印象中，最大的差異大概就是這兩項了。噢...對了，再提個也是令人印象深刻的差異好了！但我要再重申一次，我不知道這類的比較是否有意義。提到在美國念研究所，應該不難想像同學來自世界各國，對吧？更有趣的是，他們甚至還來自各年齡層：我那時有個同學，當時應該已經40多歲了，我跟他交情很好。他是位HP的工程師，之所以當個全職學生，來Stanford就讀研究所，純粹是因為已經在公司工作好一段時間，公司便送他來進修。相對地，我最年輕的同學似乎是15歲吧，來自中國的天才少年班。總之，同學之中有來自不同的國家、不同的年齡層，雖然可以說是反映了美國本身在人口組成上的多樣性，但也帶來了一定的刺激。然而這些差異是否會對職業生涯造成不同的影響呢？如果從結果來看，我倒不覺得有。對我自己來說，在畢業後跟行業接軌這方面，我確實是從Stanford畢業以後，才真的有一定可以找到工作的自信；相較之下，我從台大畢業時，並不是很確定能擔任哪些工作。當時還沒有104人力銀行，只能看報紙找工作。報紙上會寫出哪些大廠在徵工程師、需要哪些條件、要求懂哪些東西。我是大四時開始在關注，雖說沒有立即就業的意願，但出於好奇，都會看一下我符不符合這些企業招募人才的需求。那時候一看，感覺沒有一份工作我可以勝任，因為對於是否學過上面條列的東西，我不能確定，自然也不清楚自己是否高於徵才門檻。 但在Stanford待九個月後，情況就不同了：那時我習得的知識與技術都是行業會用到的。所以我一畢業馬上對「能去哪些公司」、「找到怎樣的工作」...等，抱有大致的了解以及強烈的預感。但是找工作只是職場上的第一步，而這第一步我到底踏得順不順、有沒有留下甚麼深遠影響，我如今已經自電機系畢業接近二十年了，現在回首仍是不好評估咧！依結果論－當然我得再三強調，以下純屬個人觀察，並非固定的通則－大致上是這樣：比較我這幾屆當初去美國念研究所的這幫人與留在台灣的人，後者反而在畢業以後有更多的機會進入上升氣流強烈的企業。譬如：聯發科大概是從1990年代後半開始崛起，我們同屆當時就有好幾位較早進入聯發科服務，甚至有人的工號是在100號以前。你可以想像他們之中，有人現在大概累積了不少的積蓄。這種實例一部分肯定得歸功於他們當初的判斷：認定那些公司前景看好，於是跟著公司一同崛起；但另一部分也不得不承認裡面有許多人生境遇與造化。回首看一看，留在台灣的人以及比較早回台灣的人，有一定比率在職場上確實取得滿大的成就，如果這問題是想要這類比較淺層的回答...。畢竟成就這件事，要看各人怎去定義與詮釋；我不想給你們不當的定義，因為人生成就不一定只能從職場獲得。雖說這類比較稍嫌淺層而狹隘，但如果繼續從職場切入，不少像我們讀完研究所後留在美國發展的人，總會遭遇一些亞洲人常常面臨的問題，這些問題不能完全貶為劣勢，但肯定讓人難以如魚得水：身處一個新的環境，語言的不通順、文化上的差異都需要你花上時間與精力來磨合。而在追求晉升的過程中，又會遇到一波障礙，像是不可避免的辦公室政治、揣摩上司與客戶的心意......等。很有可能今天同樣狀況發生在台灣，我們更容易發揮所長；但在美國卻會受到前述問題的侷限，手腳受縛。尤其身處在管理階級時，更能體會這些阻礙。所以我們這些當時在美國念了研究所，直接畢業進美國職場的人呢，隔了二十年左右來看，在企業裡很容易遇到瓶頸。在這些分享的實例中，哪些因素對於生涯有深遠影響、影響是好是壞，我始終認為不能輕易定論。因為如果單看這一代在職場上的境遇，我們很容易忽略美國本身有許多其他的優點：舉例來講，後代的教育環境、生活成長的環境...等，這方面台灣實在不能以同等級相比。所以回歸這問題的敘述，「會對生涯造成那些影響」要看你從哪些維度來觀察，但我認為在較狹隘的職場發展上，結果確實與當初所預想的不太一樣。本來想像去了國外，拿到了金飯碗，到了後來可能有更好的待遇，但是這種預期在我們這一屆看來，反而不太是這麼一回事。',
        },
      ],
    },
    {
      bigtitle: '三、初入職場',
      sections: [
        {
          title: '第一份工作',
          section:
            '很幸運地，在好學校，自然常會有公司來找好人才。我的第一份工作是在DEC做工程師，主要是負責ALPHA系列CPU。當時因為Digital是很大的趨勢，在課堂上也看過DEC的設計，因緣際會得到了這個工作。做了幾個月，我才發現設計這種大電路的分工非常細，和一開始的想像不太一樣，以為能有很大的彈性，可以設計出大電路，後來才發現是做小模組中的小模組。那時做的是DLL。大電路裡面有很多clock，要想辦法讓這些clock 同步，也就是DLL的功能。我離開的原因，主要是對工作的期待不太一樣。那也是我第一次面對自己：我到底喜不喜歡當工程師？我當時也是天人交戰，因為一路求學上來，很常都是因為成績考到，就去念了大家公認的好學校、好科系，沒有認真面對自己。我一直在思考到底自己要不要當工程師，後來經過很多考慮才決定離開，大概是這個樣子。',
        },
        {
          title: '創業經歷',
          section:
            '我在矽谷創過幾家Internet 的公司和一些e-commerce的公司，後來不再繼續的主因是2000年的泡沫。泡沫發生後資金很難募到，氛圍也滿恐慌的，不知道Internet公司是否能繼續存活、創造價值，還是只是一個風潮、泡沫。我從工程師跳到新創公司，才發現企業的經營有太多值得學習的地方，也才發現自己沒有準備好，索性冷靜一下，重新沈澱自己。',
        },
        {
          title: '您是一個好的工程師嗎？',
          section:
            '這個問題不容易回答。是不是一個好的工程師要從各種方面來看。從結果而言，應該不是太好，因為後來就沒再繼續鑽研。其實我覺得工程師最重要的就是解決問題的能力吧，只是大部分是別人已經定義好的問題，可能是PM、你的老闆給你的spec，而你的工作就是在專案裡讓產品達到這個spec。但我為什麼不是一個太好的工程師呢？我可以想像我如果在這個領域繼續待下來，應該會越來越感到不滿足。我比較喜歡看big picture的東西，看產品對客戶的影響，我比較喜歡這種東西，所以站在這角度來看，工程師可能無法滿足我這樣的需求，這是比較大的矛盾。',
        },
        {
          title: '曾經做過最好的專案',
          section:
            '這個很多，但是我不太能夠講細節。我們做過的專案常常可以創造重大的impact，很多都是上頭版新聞的。但是因為我們沒辦法透露客戶資訊，我只能描述大致的內容。譬如，有客戶想知道是否應繼續投資在原本的技術， 還是改投資在新技術上，這樣的決定牽涉的投資量是極大的。我們做了很多深入的分析，與客戶進行多輪討論後，說服客戶朝往某方向走，最後客戶也往該方向走，在新技術上有很多斬獲。這不完全能歸功於顧問公司，但我相信我們的分析與討論有重大的貢獻。也有一些案例是，成立了幾十年的大型組織，公司第一次想做大型的轉型，請我們幫他們做組織設計。因為是老牌公司，組織對轉型極為抗拒，我們用很多方法，對各部門和管理層做溝通，同時列舉其他遇到相同問題而轉型成功與失敗的案例，花了很長時間讓組織認可轉型的必要，當時也上了媒體。另外有很多企業會請我們幫他們思考未來三到五年的策略。舉例來說，一家公司一直認為自身的成長來自展店，因此不斷的展店，但根據我們的分析，才了解到展店反而造成了效益遞減，他們應該耕耘其他的東西，才能在三年內保持領先。後來經過討論也說服轉型，導致今天他還是保持領先地位。我在顧問產業十年多了，很榮幸能夠為很多企業創造價值，不僅對投資人，還有員工和成千上萬的家庭，這可能是我當工程師沒辦法做到的。',
        },
      ],
    },
    {
      bigtitle: '四、跨領域顧問生涯',
      sections: [
        {
          title: '從工程師進入到顧問業：面臨的考驗',
          section:
            '不知道各位對顧問這個行業理解多少？顧問跟工程師一樣，每天的工作都是在解決問題，不過解決問題的角度不太一樣。工程師大多是為了達到 spec ，而顧問要解決的是客戶的問題，也就是經營者的問題。經營者的問題很活，有時候是組織，有時候是利潤，也有時候是各種問題的綜合。例如，兩個公司合併了，然後兩邊都有不同的文化，誰都不服誰，該怎麼辦？有點像你在家裡遇到柴米油鹽醬醋茶，什麼都來。對我來說，剛進公司的大挑戰有幾個。第一個，我一開始是在北京辦公室，對我來說有很多新的東西，包括新的文化－我沒有在中國大陸工作過，一下子到北京這個全新的環境，同事大多是中國人，客戶也是，而且是國營企業的客戶，但是當時北京辦公室的老闆是個美國人。所以我一開始要學習新的文化，不僅是地區的文化，還有人的文化。我要很快速去適應那個環境，這是蠻大的挑戰。舉一些小東西，例如，打字、用詞、用語和講話的口氣，你可以想像我有多少東西要適應。再加上顧問業的步調非常快，一開始就預期你要很快有表現，就很快把你丟到很有挑戰性的專案裡，你要馬上證明你在整個專案團隊裡不是累贅，有辦法創造價值，有辦法幹活。可以想像，面對巨大的文化衝擊，還要一邊跟上工作的快節奏，你說有什麼挑戰？全部都是挑戰。一轉頭要講大陸中文，另一邊還要用英文跟老外老闆將客戶談論的東西精準傳達，左右都不是我習慣的環境。此外，身為顧問，每次的專案、每次服務的客戶，面對的問題都是全新的，我要有辦法要很快 pick up 新的知識，對工程師而言是很不太容易適應的。以前，我可以花比較長的時間針對一個問題做深入的研究，現在第一週就要你研究 供應鏈中的某個問題，你可能只看過書，沒有實務經驗，但下週就要跟客戶開會，短期內就要提出建議，這個壓力相當大，卻只是顧問業裡的常態。因此，對我來說，除了文化環境之外，顧問跟工程師工作內容的巨大差異是最大的挑戰。',
        },
        {
          title: '顧問業特質',
          section:
            '我覺得在顧問業，有件事情是恆久不變的，那就是學習曲線非常陡。不管你在哪裡，無論在哪一個位階，就算我今天做到這個位置，我還是要學習，我每天都在大量學習。只是我們學習的管道多一些，公司內部的知識共享做得比較好。我們公司在全球各地服務上千家公司，專案中的學習都會經過機密處理後在內部分享，也讓我們了解在各行各業、各個經營層最關心的議題是什麼，我們可以如何去幫助這些客戶。除了內部大量的學習途徑，我自己每周五會和很多組織領導人，包括來自企業、自政府等的領導者交流意，這些機會對我來說也是很好的學習。有些時候，和這些檯面上的人物交換意見，聽取他們的想法，和這些一流經營者面對面學習，超過讀十本經營的書。再加上公司同事其實都很聰明，內部不斷會研究最新的趨勢，對不同行業的衝擊提出看法，我有時也會加入討論去跟全世界一流的經營人才學習。所以有太多太多的機會可以學習。只要待在這個行業一天，你就不會停止學習，你可以說這一個挑戰，這也是一個好處。',
        },
        {
          title: '工作、家庭與娛樂',
          section:
            '關於work life balance，每個人怎麼去抓工作和家庭的平衡，因為每個人的環境不同，我不太有辦法去分享什麼。當然， work life balance 肯定是很重要的，每個人必須要花力氣想。我覺得電機系有一些人可能不喜歡輸，所以在職場上過度投入，忽略家庭這個要素。我不知道你們身旁有沒有這些人，這不能小看，一定要花心思時間去做，至於要怎麼做，我只能就我的狀況做分享，不確定能不能對大家帶來幫助。但是蠻奇妙的一點，有時候工作上無法突破之處，他的答案會在家庭，我的意思是說把這個平衡做好對你是有幫助的。可能你在家庭中，跟家人小孩相處的過程裡面，可以對公司的一些事情看得更清楚。有些時候是心態的轉換，對工作不這麼執著，反而能夠度過難關。工作和家庭是一體兩面，要花一點心思去想要扮演什麼角色，家庭可以給什麼樣的支援，你在工作之餘可以給家庭什麼。',
        },
        {
          title: '給學弟妹想要進入顧問業的建議',
          section:
            '首先，我們這行主要分三個主軸，我大概簡單講一下。第一個就是區域軸，我們在全球有超過80幾個辦公室，包括像台北、香港、北京、東京、名古屋等。另一個是行業軸，像我專精於科技業，有些人主要看消費品產業，有些人是工業品。還有一個軸是功能軸，與企業內部的職能較相關。我在功能軸上的專業是策略，有些人是組織，也有人是銷售與行銷，其中，有人更專精在更細的主題上，專門在做定價。另外也有科技優勢小組，主要與 IT 、數位相關的。這是比較大型的顧問公司裡常見的分工。在這個分工之下，台灣的求職者有什麼優勢與劣勢呢？我覺得實際上是沒有直接關係的， 因為這個行業要求的，以一個單純的管理諮詢顧問來講，不一定要求在某個地域、某個行業，或是某個功能裡面有深入的研究才能進來。我們其實要求在決問題能力上或領導力上或是團隊能力上要有很大潛力，再加上要跟我們公司的文化相適應。 當然前提是過去的學業及職場表現頂尖。在這個前提之下，能夠展現團隊、領導及問題解決能力，這些人我們都很歡迎。你說台灣求職者有什麼優勢劣勢，我覺得很多時候是個人。因此台灣求職者不是有太多優勢劣勢。當然，我是以顧問業的角度來回答的。',
        },
        {
          title: '顧問業近五年來的變化',
          section:
            '過去這幾年來最大變化在於，第一，環境變動越來越大，各行各業的環境變動劇烈。第二個就是我們的客戶進化很多，越來越強。客戶的公司裡有越來越多頂尖的 MBA人才進入，我們公司的顧問也有許多後來進入客戶的公司工作。現在管理顧問業越來越難靠方法論、靠工具在賣錢。 基本上，我們的方法論和工具都是半買半送，我們真正為客戶創造的價值反而在於剛剛講的那三個軸的深度。這個深度就是說，你是不是對某個議題有深入的看法，可能是某個產業的議題、某個功能或是某個區域的議題，這種深度是非常重要的。換句話說，你今天一定要 outsmart 你的客戶，你一定要比你的客戶更懂。舉例來說，假設你今天的客戶是一家中國的互聯網公司，他很懂中國互聯網。你如果要有辦法幫他做事情，你也要懂更多，比如美國的網路發展，或是你還懂日本和其他先進國家的發展，甚至印度、東南亞等比中國落後地區的互聯網發展。你的客戶今天可能在某個特定的領域是全世界最懂的，你很難outsmart 他，但是你要在其他地方 outsmart 他，才有辦法讓他覺得請你來有價值。 這種對知識寬度與深度的要求，是過去十年很難想像的。這對我們這個行業的影響就是，你今天的公司規模一定要夠大，才能夠在各種議題上面涵蓋地更廣更深。這對我們業界最立即的衝擊，就是對中小型的顧問公司帶來極大的壓力極大。最近幾年，很多小型的顧問公司被併購，成為大者恆大的趨勢，這是目前為止發生較大的變化。對於五年後十年後的未來，有很多不確定因素。另外很明顯的趨勢就是新科技的興起，包括大數據、AI 。很多人在思考是不是以後這些新科技會取代諮詢顧問？我個人是覺得機會不大。當然科技的某些部分對我們來講是威脅，但是更大的部分對我們來講是機會。我們有更強的定位基礎來利用這些科技幫助客戶解決問題。那客戶是不是未來就不需要管理顧問，而可以直接利用這些技術來解決問題呢？這個可能性不是不存在，但是比較小。原因是，在很多客戶縱使已具備這些科技，有很多基本的問題是不能用科技解決的。我隨便舉個例：透過不同的部門之間或人跟人之間的競爭、互動，怎麼樣讓一個組織更有效率，很難純粹從科技來解決。另外要怎麼去駕馭這些科技，不管是 AI 、 VR 、 AR，到底怎麼用，從哪個應用下手，要怎麼架構你的組織，才能讓你的組織接受這些科技。這是科技不會告訴你答案，需要人去思考的問題。此外，因為我們做了大量的研究，也和互聯網公司有大量的互動，我們知道這些新型的公司怎麼運用這些科技，可以將這些經驗應用在比較傳統的產業裡。另一方面，顧問公司身為公正的第三方，我們在幫客戶做組織變革的時候，會比較有超然的立場。如果今天是人事部來做變革，通常會遇到最大的阻礙就是，人家會說「你今天為什麼不先刮自己的鬍子，為什麼來刮我這個部門的」，這提供了外部顧問公司一個進入的機會。只是以上所述的趨勢，對顧問公司也是挑戰。如果你還是套用傳統架構來解決問題，不一定可以成功運用這些新型的科技。以 BCG 的例子來講，這幾年其實為了未來做了很多佈局。我們在建立很多傳統沒有的能力。例如，公司內部成立了數據分析團隊，這個團隊現在以一個瘋狂的速度在成長，其背景和我們傳統的諮詢顧問有很大的不同，很多是數學相關領域或是數據科學家出身的，也有些人是在搞新創的。你可以想像我們公司裡面有些像矽谷裡面的創業家，在幫助我們大型的客戶創業。我們也有一幫人在搞投資的。像這種跟傳統顧問不一樣 背景的人才，是我們現在透過各種組織一直在建立的。可以想像五年後、十年後的 BCG 會長什麼樣子，一定會很不同。 現在是以諮詢顧問為中心，身旁有很多組織來支持核心，讓我們來服務客戶，像是一個同心圓。十年後公司更像聯合國，有一幫人專門做顧問，跟客戶接觸然後解決問題的，一些人做分析等等，會像我剛剛講的聯合國的概念。 我認為必須這樣做，未來才能適應這些新科技、不確定性的環境，繼續幫助企業客戶成長，這是我的看法。',
        },
        {
          title: '是否該繼續進修',
          section:
            '這個問題很難回答。像我剛剛說的，因為公司越來越像聯合國，我們招募人才時很看重diversity 。我們非常需要各種不同背景的人進來，這裡面包括 PhD 、在工作職場上有五到十年經驗的，甚至有些是在職場上待了二三十年的資深專家，我們也很歡迎。我們雇用的人才背景越來越多樣化。你說 PhD 還是職場經驗重要，兩者對我們來說都重要，只是進來後的角色會不一樣，職涯發展和訓練也會不一樣。博士生可能頭腦非常好，思路非常清晰，邏輯能力非常強，但是對產業背景相對不熟悉，可能需要商業上的培訓，或是給他更長的時間去適應整個顧問環境。另外針對一些資深的職場人士，他可能花了十五年在做數位行銷，他進來我們可能會給他比較專職的，可能一進來就是數位行銷專家，而不是單純的顧問，會有不同的職涯路徑，扮演不同角色。因此你問題哪個重要，其實都很重要，只是不同背景的人，他的職涯發展、角色以及受到的訓練等都不同。',
        },
      ],
    },
    {
      bigtitle: '五、結語',
      sections: [
        {
          title: '給大學部的建議',
          section:
            '可以說是我的私心的偏見，對我來說，對於台大電機，我還是相信你們是全台灣最優秀的其中一群人，不是說其他人不優秀，只是你們一定是裡面最聰明的一部份。我不知道你們這屆是不是還有一些人，是因為分數才選擇電機的。我假設還是有一部份的人，並不是因為真的很愛電機才進來的。我想經過高中的教育，大概很多人都還不清楚什麼是電機，我想你們不是每個人都是經過深思熟慮的結果，是分數夠就進來了。我的意思是，你們其實可以在大學階段多去探索不同的路，可以是在電機領域，或這個領域之外，早點去面對自己。現在很多學生會延畢、出國交換，也許就是其中的一個表現。 我會蠻鼓勵你們多去探索自己，不要太受限於我們傳統教育體制之下給我們的結果，因為到一個時間點，一定會後悔，不知道是什麼時候，也可能是三四十歲，你開始想「我的人生到底在幹嘛？」，那個時候才要把過去的人生打翻，我覺得就有點可惜了。這是我的建議，多去探索自己。第二步就是，提早去為下一步或下下步打算。大學時期，很容易被眼前的課業限制住。大家都是好學生，不想輸別人，因此花很多時間把眼前的功課弄好，可是沒有花時間思考自己下一步是什麼。下一步是什麼？中期可能就是研究所，長期可能就是你的職涯選擇。以中期來說，我舉例，假設你大一大二 就決定要去 MIT 或是某學校繼續念電機，為了達到這個目標，你需要做什麼事情，大學的成績是怎麼算的，學校的要求是什麼，這類的事情你要提早弄清楚。像我們當年算 GPA ，發現國外的學校只看 GPA ，不看原始分數，然後我們那個時候 80 分以上就是 4.0 ，下面開始有 3.7 ， 3.3 等等。我發現原來我只要每科都考 80 分以上就好，但我自己雖然有不少科目90幾分，卻因為一些沒有興趣的科目只有60分而拉低平均。我的重點是，早點知道遊戲規則，你就會有更多的時間去準備，而非時間快到了才趕著去看。我後來最大的反省就是，我當年花太少時間去研究我下一步要幹嘛。 現在我在世界各地做招募活動，發現很多大學生從大一大二就開始思考他們的職涯，而我也遇過一些台大學生已經大四了，都還沒開始想這個問題。這是一樣的邏輯。舉例來說，如果你對顧問業有興趣，你可以先去了解這個行業在人才招募上在乎的因素是什麼，如果顧問公司看重實習經驗，你卻在大四時才發現這件事情，你就很難去和同儕競爭，很可惜。所以我給的第二個建議就是，提早為下一步做準備。這不會花很多時間，早點去探索未來職業的要求是什麼，早點去準備。最後，我覺得電機系的學生，相較於其他系的學長比起來，就是 … 比較乖了些。好學生嘛。我不是要你們做壞學生，但是我要建議的事情跟你們做壞學生有點類似。不要去太相信一些人家給你的規則。電機系很強的一點，就是你把規則講出來，他可以在規則之內做的最好。但是有些特質你們是沒有被測試的，就是破壞規則的能力。放眼望去，那些在科技行業成功的人，每個人都是破壞規則才成功的 。我覺得你們在學生時代，可以開始思考，並不是要你們到處破壞系上的規則，甚至上街頭抗議什麼的，我不是這個意思。我覺得要做的是獨立思考，你要去挑戰很多事情，包括學業，學校的導師跟你講的規則，你的學長跟你講的規則，譬如說潛規則是怎麼樣，怎麼樣才有辦法進哪個學校，怎麼樣才能進哪間公司，都聽一半就好。聽一半的意思不是不尊重對方，而是你要思考，真的是這個樣子嗎，為什麼是這樣子呢，是不是有其他方法等等，就是獨立思考的能力。我覺得電機系的同學腦筋都很好，只是有時候你的思考結果好不好，不是在於你的腦筋好，而是在於心態。如果覺得老師講的就是王道，學長講的就是王道，就像一隻牛，從小把牠放在牛圈裡面，將圍籬通電。老牛被電了幾次後，跟小牛說，欸這個圍籬不要碰，會被電到。然後你就相信了，你沒有去嘗試被電過，怎麼知道這個電了會不會痛，或者這個圍籬是不是 24 小時都通電？說不定被電的同時你能突破，衝出圍籬獲得自由，有自己的一片天地。很多時候時空環境在變，只會給不斷挑戰現狀的人機會， 挑戰現存的事實跟常識，然後大步的向前走。這個當然也是管理顧問其中一個挑戰，因為我們工作的一部分就是去挑戰客戶的常識，所以我們的行業經常得這麼做。不過另外一方面，我會希望跟你們共勉，就是我相信在電機系，很多人有機會在本行領導台灣，走向下一個階段，而不是背負著很大的 legacy，覺得台灣的行業一直走向 成本削減。台灣的電機行業走向低成本代表著一個階段，理論上這是你們的機會，你們是有機會跟未來的，你們應該反過來看這件事情，前提是不能被過去的常識、慣習，或是大家認為的東西綁住。所以第三個就是獨立思考。所以，我的建議總共有三個，一、探索自己，二、多想下一步跟下下步，三、獨立思考。主要就是這三個吧，希望對你們有幫助。',
        },
        {
          title: '一句話談談電機系給您的歸屬感',
          section:
            '歸屬感不敢說，但是我以身為台大電機的一份子為榮。我真心覺得台大電機得天獨厚。以台灣來說，電機是特別值得向世界驕傲的產業，那麼在電機領域，全台灣最好的學校就是台大電機。我相信現在台灣在世界上取得的很多地位，跟台大電機密不可分，我想我不需要一一去談有哪些偉大的前輩為我們打下的基礎。總之，能夠沾點光，能夠身為台大電機一份子，是我一輩子的榮耀，哪怕我現在做的事情跟電機沒有直接的關係，我覺得這個是我永遠不會忘記的。',
        },
      ],
    },
  ],

  annotation: ['特別感謝：徐瑞廷', '撰寫：廖宜倫 黃暐倫 楊耀程 孫裕修 林恆陞'],
  id: 'column_1601',
}
