module.exports = {
    title:['1992級 梁維仁（元大證券香港區總經理、花旗環球證券臺灣區總經理）'],
    hashtags:['系友專訪', '梁維仁', '1992級', 'B77', '金融工程', 'CarnegieMellonUniversity', 'ComputationalFinance', 'MS', 'MBA', '元大證券', '花旗環球證券', '總經理', '外資交易', 'optionpricingmodel', '跨領域', 'justdoit' ],
    sections:[
        {
            bigtitle:'一、Emphasize',
            sections:[
                {
                    title:'多才多藝的人',
                    section:'我從台南北上讀書，鄉下人進城，覺得系上每個人都好厲害。很會讀書是基本功夫，其他課外活動例如搞社團的、運動的，連打電動都打到極致，覺得系上的高手實在太多了，讓我大開眼界，這也是念電機最大的收穫，每個人在不同領域都很厲害，真的蠻佩服同學們的。台大是一個非常棒的地方，高手雲集，從別人身上看到自己不足的地方，也更有機會找到自己的優勢。“人”是我覺得念電機系這段時光最寶貴的經驗。'
                },
                {
                    title:'各式各樣的課',
                    section:'我現在的專業算是金融業，在大學時的課外活動跟金融都非常遙遠，電機系本身的課業就已經很繁重。當時有參加一些社團，基本上是吃喝玩樂團之一。不過多辦活動，觸及到流程的安排與管理也對於自己的成長有所幫助。大三大四的時候已經打算出國，不像其他同學需要全心準備碩士班考試，於是我花了很多時間去修了其他學院開給自己系上的課，例如經濟系的經濟學原理跟個經，心理系的普通心理學、社會心理學，財金系的投資學，擴增了自己的眼界。 至於為什麼會走到金融這一行，說來也是誤打誤撞。大四時去修了財金系必修的投資學，開始接觸到例如CAPM等財金學的重要理論，需要統計與其他數理概念。我發現我相當喜歡運用數學去解決財金領域的問題，也就帶領我先走上碩士班雙修MBA與MS in Computational Finance的路子。衍生性金融商品需要處理許多非線性的問題，同時需要數理和金融知識，畢業後也就順理成章地走上當時投資銀行界中最夯的幾個領域之一，數理也成了我最重要的核心技能，電機系的訓練非常的 crucial。隨著年資的增長逐漸走上管理職，還是深覺除了數理的的核心技能之外，培養全方位能力的重要性，變得更為明顯。至於大學推薦的課程，我個人覺得理則學或是語言邏輯之類的很值得推薦。過去我們年代有哲學系老師開的課，不知道現在還有沒有。歷史系呂世浩老師的課非常熱門，引導大家如何思考與判斷，都是屬於這類的基本功夫。無論科學或文史，邏輯思考都會是一個最基本的訓練，萬流歸宗。最後，有一句廣告標語我相當認同，｢ just do it ｣，不要｢ just talk ｣。'
                }
            ]
        },
        {
            bigtitle:'二、Explore',
            sections:
            [
                {
                    title:'畢業方向',
                    section:'其實那時候也沒有很確定。我知道自己的抽象思考 (電磁學，哈!) 比較弱，實作是明顯的強項，個性上比較喜歡廣而淺、而不是鑽而深。所以那時候決定去讀商學院，不過又選擇了數理比較強的CarnegieMellon，拿了兩個碩士，除了MBA，另外一個degree是財務數學，發揮我們在數理的所長。幸好這樣的academic background支持我進入金融業，說來也是有些運氣成份。'
                },
                {
                    title:'申請困難',
                    section:'CMU接受了我的申請，我還是被一些名校例如MIT，Stanford，Harvard 等reject。我覺得很公平，畢竟很多申請人的學經歷都超強的，GPA 4.0、GMAT 780、工作超過五年的，只能儘量修練自己。'
                },
                {
                    title:'跨領域',
                    section:'專領域跟跨領域都要克服很多挑戰。跨領域中，整合可以算是最大的挑戰。儘管無法所有相關的領域都能精通，但至少有幾個領域必須是自己的核心技能。其他領域至少也必須能夠與專業人士溝通。'
                },
                {
                    title:'出國環境',
                    section:'融入當然還是會有一定難度啦，我們本來就是外國人的身分，不過還是個性因素主導。脫離了舒適圈，大家還不都適應過來了，時間一久自然就習慣了。缺點就是花很多錢吧，優點的話主要還是眼界。我們電機系真的很棒，有一流的師資陣容跟研究環境，全球的排名也是很前面。留在系上繼續深造，一來省錢，二來可以跟著熟識的老師不間斷地繼續深入作研究。但是國外唸書的話，可以體驗不同的文化、同學，然後又遇到一群也是很厲害的人。外國的好手也多，到美國之後也能了解不同環境做人做事的方法。只能說各有優缺點，有時還是要靠一點運氣，可能幾年後或幾十年後才會證明當初的選擇。'
                },
                {
                    title:'先備知識',
                    section:'書本上資源很多，不過以初學而言，自修的方式比較不容易有系統性。因此我更推薦去修課，例如修財金或經濟系必修的核心課程，包括投資學、公司理財、經濟學原理這類課程。我大學時期其實不太認同“玩”股票，但卻投入了證券業，依靠的還是金融相關學歷跟工程上興趣。我在美國讀書時，一時覺得好玩，用C++ coding了option pricing model，再用當時流行的JavaCafe設計了介面將這個model放到網路上。畢業前曾飛到新加坡面試工作，看到主管桌上厚厚一疊履歷原本覺得沒有希望了，但是跟主管吃飯的時候突然想到自己寫過一些程式，在公司電腦上的IE示範給主管看，主管眼睛一亮，他也成了我第一位主管。基於興趣，我努力的把一件事做好，幸運降臨，就這麼簽了我第一份聘僱合約。'
                }
            ]
        },
        {
            bigtitle:'三、Establish',
            sections:
            [
                {
                    title:'金融工程概念',
                    section:'金融工程是用數學方法去解決金融界實際遇到的問題。以選擇權 (認購權證) 為例，選擇權的payout是非線性的，要做定價時需要一些數學模式，像是stochastic calculus、boundary condition。這些演算也會牽涉到programming、algorithm。如同我們用數學解決電機中的問題，金融工程是以數學與電腦解決金融上的問題。'
                },
                {
                    title:'金融工程前景',
                    section:'很可惜，我覺得在台灣前景不佳。主要是規管限制金融商品在台灣的發行，因此金融工程人員多數在香港、新加坡、東京、上海等地發展。台灣的金融業還停留在手工階段，沒有連結科技、效率、與系統化，所以常常出紕漏。這方面要進步不是那麼容易，特別是已經落後了許多，而全球各金融中心也持續進步。這是對於台灣本地的金融工程發展前景而言。對於對金融工程有興趣的同學，發展的前景還是不錯的。'
                }
            ]
        },
        {
            bigtitle:'四、Expand',
            sections:
            [
                {
                    title:'工作態度',
                    section:'進入職場之前，我對於股票債券期貨等等金融商品完全沒有經驗，進入職場後才開始學習如何當交易員。對新入行員工面對一個新工作，態度還是最重要，必須要努力創造自己的價值。我在做第一份工作的時候，覺得公司真好，竟然付我薪水讓我進公司來學習，當然很快地我也開始直接幫公司增加收入，相對應地公司也很慷慨地支付我工作獎金，這完全是一個互贏的概念。'
                },
                {
                    title:'累積經驗',
                    section:'在證券公司工作，每個部門的專業分界非常大。我覺得總經理只是一個管理職的頭銜，以調合部門運作為主。在管理職之前的交易員資歷，在業界的影響力其實更大。當時我手上的台股交易量，大到全市場的百分之五。當時的主管也很信任，在買賣的時候他不會過問，就是一個互相的信任。但是我也必須要完全按照公司的規範去進行，每年的利潤相當不錯，也很穩定。大家如果真的有心要往金融界發展，還是要找到自己的興趣。總經理這種職位無法強求，價值也比不上某個領域的專精。當初剛入行時對於這個行業也是一知半解，進去之後才慢慢學，積極去expose yourself讓別人來認可自己的價值，要differentiate yourself。'
                },
                {
                    title:'適應壓力',
                    section:'金融交易是個壓力極大的工作，如果神經太小條，太容易被情緒影響，做這行也許不是那麼適合。做事要仔細，心則要放寬一點，看到漲跌不能太緊張，不然身體受不了。交易員這種高壓行業也做不了多久，大概就是十幾二十年了。外資交易員手頭上都有幾十億幾百億的資金，純粹是按照我們的判斷去建立投資部位，目標在儘量降低風險的情況之下增加交易獲利。當然這樣的授權金額相當大，在台灣的公司不太可能發生。'
                },
                {
                    title:'享受辛苦',
                    section:'1997年來到香港，剛去的時候舉目無親，廣東話不會講，一直到一年後才第一次跟在港台灣人一起吃飯聚會，和現在香港到處都是台灣人的情況是完全不同。每天的生活就是早上七點出發，路上買一個麵包和咖啡到公司；中午在公司吃便當；晚上八點下班，路上順便買個便當打發晚餐，每天就這樣的routine。連週末都拼命看書補充不足，研究公司的文件。辛苦是辛苦，不過還是很enjoy這份工作，值得付出很多的心力。'
                }
            ]
        },
        {
            bigtitle:'五、Encourage',
            sections:
            [
                {
                    title:'大學部建議',
                    section:'基本上還是希望能夠 Follow your heart 之餘，還是要 Just do it，不要虛擲光陰。再來就是健康很重要，無論是什麼工作，心臟要夠強、體力要夠好。'
                }
            ]
        }
    ],
    
    
    annotation:['特別感謝：梁維仁','撰寫：藍珮瑜 Steven Huang 林昱嘉 陳柏瑞'],
    id:'column_1602'
}