module.exports = {
    title:['2006級 楊奕軒 （研究員/教授 @ 中研院資創中心）'],
    hashtags:['系友專訪', '楊奕軒', '2006級', 'B91', '台大電信所博士', '中央研究院', '資訊科技創新研究中心', '研究員', '教授', '音樂資訊', '音樂生成', '音樂情緒', '音源分離'],
    sections:[
        {
            bigtitle:'一、生涯規劃',
            sections:[
                {
                    title:'在學時什麼時候開始決定投入音樂資訊這個領域的？為何會想要投入？',
                    section:'我剛進入電機系時，覺得自己來到最強的地方，大家都很厲害，發現很多人高中就會寫程式，普物、微積分也整本都讀完了。那時就拼命一股腦地努力追上去，尤其是大一那時，特別在乎成績，想把每一個科目都兼顧好。但是後來漸漸地發現我對電子學比較沒興趣，剛好在大二升大三的暑假，申請到系上的獎學金，去美國密西根州立大學 (Michgan State University)做兩個月資工領域的交換學生，在那邊進行一些研究之後，理解到IC產業並非電機系出路的唯一解。原本曾因為不熟悉程式，而有些下意識地排斥寫程式，結果在這次難得的機緣下開始感到興趣，也在大三上開始選修許多資工系的課，並前後加入李琳山老師、陳宏銘老師的實驗室參與專題研究，並在後者一直做到博班畢業。其實我國高中時是學美術的，不是學音樂的，從小沒有機會去學音樂，會做音樂對我來說完全是個意外。剛好大四上時陳宏銘老師實驗室剛好有了個與音樂情緒相關的新研究題目，做到後來蠻有心得的，就一直做音樂的題目了。我在想，大家如果要做多媒體相關的研究，第一個想到的應該是電腦視覺 (computer vision)，因為應用廣、出路也多。做影像的話，別人比較不會覺得你在做冷門的題目。但是我是想法很多的人，就覺得說大家都在做影像，就不想跟著做一樣的。雖說如此，我在博二、博三也有猶豫過，也有想過要不要做一些影像相關的，就也發了一些影像的論文。後來出國開會，遇到一位國外音樂資訊的資深教授，跟他聊了一下這個問題，那時他說做有興趣的東西就好了，不用一定要跟風做比較多人做的研究領域。'
                },
                {
                    title:'為何會踏入學界並選擇在中研院當教授？',
                    section:'剛上大學的時候，覺得讀電機系好像就應該去業界賺錢。記得有次系上有個「 與教授有約」的活動，有位教授問底下二三十位參加的同學說「誰之後想當教授？」結果好像只有一兩個人舉手。那時我心裡還覺得很奇怪，怎麼會有人想當教授。但後來做研究越來越有興趣，才發現學術之路也許比想像中更適合自己。之所以選擇在中研院，主要是因為我很喜歡中研院的氣氛。雖然以外界的眼光來看，中研院研究員的名氣不比大學教授響亮，但在中研院工作可以幫助很多想出國的人。而且在我實驗室的學生(或是研究助理)大多是對音樂有所興趣、且想讓自己變得更強才加入的，並不是以拿到文憑為目的。我不需要費力地去推他們、或是勉強他們做他們不喜歡做的事，而可以讓他們以自己的興趣和熱誠來做研究。我也不覺得我自己是個老闆，而是跟大家一起努力的夥伴。我覺得這種感覺很棒。另外在學術界工作主要的好處就是自主權，可以自己決定自己想做什麼。研究跟生活也有適當的平衡。'
                },
                {
                    title:'對大學部學生的修課、以及領域選擇建議？',
                    section:'老實說因為每個都有自己不同的考量，很難說甚麼課比較適合誰，但是建議大家多修課摸索自己的興趣，而且避免修修營養學分浪費時間。雖然因為剛從高中出來仍保有競爭意識，覺得自己和別人還在賽跑，會在意其他人在幹嘛、修了甚麼課，這樣的想法都很難免。但是，過幾年後回過頭來看，會發現這其實沒甚麼意義的，只要選擇自己所愛就好。你的選擇還會受制於家庭背景、價值觀。以家庭背景而言，有些人爸媽是教授、有些人爸媽是在業界工作，很自然會耳濡目染類似的價值觀。有些人希望追求經濟自由、有些人希望擁有自己工作的自主權、有些人則希望工作與生活能有適當的平衡，真的會差滿多的。但是，也沒必要受到原生家庭的影響，而是可以在大學期間多接觸人，多接觸不同的想法，並讓自己有機會去嘗試看看。只是一直念書的話真的太可惜了。其實大學期間最重要的是知道自己要甚麼，就算發現有路走錯了、好像落後同學了，也沒關係，大不了再走回來，都來得及。我很喜歡我以前一位交大大學部畢業的研究助理。他大學時間花了很多時間在玩音樂跟賽車，導致GPA並不是很好看。但是他在我實驗室擔任研究助理的那一年半的時間裡，他發現音樂研究與他的興趣很相符，因此他做起研究來比許多人花上更多時間，後來的表現甚至比很多臺大畢業來我實驗室的學弟妹還好。而且，由於他不是那種讀書競爭的個性，他也比一般人懂得去照顧實驗室後進的學弟妹。現在他在美國名校念碩士，並得到在知名企業實習一年的機會，我覺得除了努力之外，這也需要歸功於他知道、或是願意去了解自己想要甚麼。在中研院，有些人會來這邊一兩年轉換跑道 (例如由IC產業離職)，之後再重新去國外念碩士。我們的人生不是線性的，你不用一直想說要跟別人比，意義並不大。重點是有沒有給自己機會，去找到自己喜歡做的事情。一旦找到之後，再去做其實都還來得及。雖說如此，我覺得我好像也不是很知道自己想要什麼，就是碰到什麼就去把它做好，這或許也是一種類型的人吧。'
                },
                {
                    title:'回到大學畢業當時如果可以出國會想出國嗎？',
                    section:'我會覺得應該要出國阿，離開熟悉的環境去到一個新的地方，總是能讓自己更加地成長。臺灣也需要更多的人走出去，把新的東西帶回來。我自己當初是因為女朋友(現在的老婆)的關係，選擇留在臺大並直攻博士。我並不後悔這樣的決定，因為留在臺灣讓我有更多的時間陪自己的家人。但是客觀來說，能夠有機會出國總是件好事。我當時如果單身的話，應該也會出國。出國不代表你就不回來了，我是希望有出國的人將來能考慮回來，幫助我們臺灣。像我自己沒有特別喜歡去美國，因為我每次去歐美一些國家，會覺得生活環境很好，他們的人民也都過得很好的生活，可是那就不是我的國家，他們憑什麼過那麼好(笑)。一個國家要強，首重教育跟技術創新。如果最強的人都想留在美國生活，那美國當然是越來越強。'
                }
            ]
        },
        {
            bigtitle:'二、音樂資訊領域詳談',
            sections:
            [
                {
                    title:' 教授做的音樂是純音樂還是有歌詞的音樂呢？',
                    section:'我們主要是做有歌詞的音樂為主。過去比較多做音樂當中聲音信號的分析，近期比較多做跟樂譜有關的「音樂生成」 (music generation)的研究。做音樂研究的好處是可以聽很多音樂，而且建出來的模型 (model)的結果是可以聽的。過去做音樂情緒辨識的時候，就會同時考慮聲音和歌詞。近來在做音樂生成，也很有興趣能同時產生詞曲，或是給詞填曲、給曲填詞。(問：音樂情緒辨識是指電腦聽了之後可以判斷音樂是屬於憂傷的還是快樂的嗎？)對，那時候就是做這樣的題目。'
                },
                {
                    title:'用機器生成音樂有沒有可能超越人類呢？對這件事的看法？',
                    section:'現在大家在講AI，會分強AI、弱AI，那我們現在在做的這個東西可能比較像是弱AI，它只是一個工具、或說是一個玩具。你們對機器學習 (machine learnig)稍微有了解的話就可以理解，我們只是給它聽很多很多的音樂，然後讓它去學其中輸入(input)與輸出(output)之間的規則，並沒辦法讓電腦像人腦那樣思考。以音樂生成來說，大家會覺得這是個聽起來滿AI的題目。但我們現在在做的東西是這樣：以前音樂人在作曲的時候，他是打開一個作曲軟體的介面，然後就寫，慢慢寫慢慢作曲。那我們是希望他寫了一些些之後，我們可以給他自動產生一些feedback。譬如說他寫了主旋律，我們就推薦這個音樂人伴奏、和弦要怎麼配；如果他寫了前面幾個小節，我們幫他接下去。可是在幫他接的時候，可能會提供他很多種各式各樣的建議，不是說就只有一種答案而已。因為我們是用機器學習去做的，所以能給音樂人很多種建議，然後他自己再去挑，等於我們只是輔助他去做這個事情。能夠達成這樣的輔助，是因為機器已經在資料裡面聽過很多音樂，所以電腦可以去學樂器跟樂器之間的和聲、樂器跟樂器間的關係、前面跟後面音樂是怎麼發展的一些關係，所以它有辦法去模仿、學到人類作曲時後的一些規則，然後去創作。可是以目前的技術而言，電腦就只是這樣子而已，它沒有辦法做到所謂的強AI。我們在說的AI是指要讓電腦像人類一樣，我們人透過五官去接受一些信號、做一些處理，然後再做一些判斷。人類會有我們的意志、情感、個性等等，這些東西在我剛剛講的AI作曲裡面都還沒有，它比較像是一個工具，就是你給它一些輸入，它就吐給你一些輸出。它並沒有意志，沒有辦法知道這個作曲家在做這個音樂的時候，他在想些什麼，或是他是為了達成什麼什麼目的。像是我們人活在世上其實是有很多動機的，比如說生存的動機；或是social的動機，譬如說我們想要受歡迎、想要被愛、或想要被尊敬；或者是認知上面的動機，譬如說我想要追求成就感、我想要獲得知識，可是這些東西電腦都沒有。電腦其實就只是你怎麼program它，它就怎麼去做事情。所以，以工具而言，電腦會比人類強，就像AlphaGo一樣。一部分原因是因為電腦不會累，而且記性極佳，可以較容易地去從數據資料裡面去找出一些軌跡。可是如果是音樂的話，涉及到一些創意，或是要有「溫度」，就是這個音樂是你感覺得到那個作曲家在想些什麼。但是，我們資料裡面並沒有這些標註，資料就只是原譜而已，並不知道作曲家當初在想些什麼。或是說，這些東西很難讓電腦去學得到。所以我的意思是，以目前音樂作曲的研究來講還很難做到，它只是個工具，它不是真的是個AI。它能不能幫助作曲家呢？有可能可以。可是能不能取代？我覺得應該還很難。目前看到許多用AI輔助做出來的專輯，其實人的參與還是占了大部分。(問： 如果做過音樂情緒辨識，那就算是強AI了嗎？)那也不是，音樂情緒辨識一樣就只是判斷什麼輸入要給什麼輸出而已。我們的訓練資料裡面會告訴你說這首歌是什麼情緒，那首歌是什麼情緒，所以電腦就去抓這些音檔裡面的一些什麼特徵會跟目標的輸出有連結。所以你給它一首新的歌，它就可以估測情緒。它其實只是在抓那個pattern而已，它自己本身並沒有意志。'
                },
                {
                    title:'做音樂生成是如何做evaluation的呢？',
                    section:'(註：我們現在大部分人類的問題都是有答案的，所以可以很清楚的知道一個generation的結果是好還是不好。但問題是，在音樂創作的那種部分，沒辦法直接比分數。大家現在的研究都很喜歡比performance、比數字。那如果現在我們要做這種研究時，除了做問卷、或是讓使用者現場來體驗，不然也沒辦法告訴其他人這有多好，那要怎麼辦？)音樂創作的話一定要讓人來聽才可以。可是人來聽的話很花時間，所以我們會設計一些量化的、可以算出來的指標。比如說，我們可以從真實音樂裡面去算一些統計量，例如什麼音後面容易接什麼音…等等，這種統計量，然後再去看產生出來的音樂的統計分布跟那個像不像。又或者，我們可以去計算生成的音樂是否有重複性，再去看這樣的重複性是否跟真實音樂的重複性的等級接近：一方面不同小節的音樂應該要有些重複、才會有連貫性；但另一方面有不能完全一樣，否則會很無聊。所以重複性不是越高或越低越好，而是要跟真實音樂的分布接近。透過這些量化的指標，我們可以觀察模型訓練的狀況，然後把一些不好的過濾掉。但這些指標無法反映人在真實聽得時候的感覺，因此最後還是必須給人聽，才能評估好壞。我們實驗室目前有跟KKBOX合作，與他們的的音樂人和製作人一起討論，以改進我們的模型。以音樂作曲來講，它成功與否應該是看開發出來的作曲程式是否真的幫助作曲人作出會暢銷的音樂，不過是減輕他們的工作、或是幫忙提供靈感，可能都是貢獻。如果我們的目標定得更明確，比如說你想要創作出新的音樂，因為目前我們的創作音樂都是從既有音樂學的，那就有可能跳脫不出那個框框。如果是這麼明確的一個評量標準的話，有一種方法是，譬如說可以先把既有音樂分成好幾個類別，然後去訓練一個分類器，分類器在一首音樂輸入時，可以去分類它是屬於哪一個流派、哪一個人的風格。如果我們創作出來的音樂，會使得這個分類器完全無法分辨，譬如說分類器覺得預先設定的十個類別都equally likely，那就代表它可能是一個新的類別，或是介於中間。諸如此類針對novelty的評估也是有人在研究。另外我們有在做「聲源分離」( source separation)，把音樂裡面的人聲跟非人聲的部分分開，它也有一些算準確率的方法，但是那一樣不能反映人的聽覺。所以模型訓練好了之後，我們會用我們的耳朵去聽。有時候數字上會看到有差別、聽起來卻沒差；或是數字上沒差、聽起來卻有差。所以我們的研究就是要常常要親自去聽。而且機器學習會有訓練資料(training data)跟測試資料(test data)。像我們的data如果是訓練在英文歌的，我們就會故意把它測在中文歌、日文歌上面，去看它是否真的所有的歌都表現很好。這些都是屬於做研究的一些眉角，你們以後應該就會慢慢學到。指導教授或學長姊會跟你們講怎麼去設計實驗、怎麼去評估、怎麼去改進研究。'
                },
                {
                    title:'教授於deep learning 就像煉金術有甚麼看法？',
                    section:'(註：可能修改一個參數就會讓model無法train起來？)機器學習其實分理論派和應用派，我們是做比較應用方面的。做理論的人會去改進deep learning裡面的東西，他們就不是把 deep learning 當煉金術在看吧。然後我覺得講deep learning 像煉金術的人，可能多少本來就對 deep learning 有些反感吧。我覺得真的要會用 deep learning ，你必須了解它背後的原理是甚麼，調參數很重要，但那只是門檻而已。就是「會用」跟你「能夠設計出新方法」也是存在著一定的gap的。我覺得需要能夠知道那些類神經網路架構的特性是甚麼，例如當你加一些不同的設計進去的時候(像是 skip connection 或是 residual)，你有辦法知道為甚麼會成功、為什麼會失敗，並且跟你跑出來的結果去做連結。也就是說，必須要去懂它背後的原理，那些東西也是知識，所以我並沒有排斥 deep learning，也不覺得他只是煉金術。'
                }
            ]
        },
        {
            bigtitle:'三、做研究的經驗與建議',
            sections:
            [
                {
                    title:'教授曾經和國外許多之知名的教授和學者一起做研究，這些經歷帶給教授哪些收穫？',
                    section:'透過這些經歷，我會期待自己用國際級的標準來做研究，而不是當國內王。會想要讓其他國家的學者，聽到你的名字就知道你在做什麼，甚至想到一個研究題目就會想到你的名字。有這樣的目標，自然而然會去把研究做好。如果有機會參與一些大型計畫就參與，沒有也沒關係。不需要特別去追求些什麼曝光度、或是名利。把自己有興趣的事情做好，盡量花足夠的時間跟實驗室的人討論他們的研究，幫助他們變得更好。'
                },
                {
                    title:'教授的研究成果非常的多產及豐富，我們好奇教授您有經歷過低潮期嗎？',
                    section:'其實還好耶。我覺得一來是抗壓性、二來是正面思考。人生要做很多選擇，我會確認我做的選擇是我喜歡的，但如果後來覺得過程或是成果沒那麼好，我會找些理由去安慰自己說「嗯，這個東西應該還是有些價值在裡面，其實也沒那麼差」，就是去看正面的部分。以研究來說，正面結果和負面結果有時候是一樣有趣的，研究論文也不能只是報喜不報憂。'
                },
                {
                    title:'教授是怎麼找到研究的靈感？',
                    section:'研究通常是越做會越有心得。剛開始比較不熟的時候就是靠多跟老師或是學長姐討論，千萬不要悶著頭自己蠻幹。學會與別人討論、與別人分享是很重要的，需要建立表達的能力。慢慢有一些自信心之後，就會越來越有想法想試。如果你對某個題目真的有興趣，就可以多找論文來看。我發現我實驗室裡面，研究做得特別好的，他們會主動去抓論文來看，而且常常看得比我還快。也就是說，研究做得好的人通常也看很多論文，有時候靈感就是從那邊來的。我自己當初在做音樂情緒的研究的時候，很多靈感也是從心理學那邊的論文來的，所以也不一定是只讀自己研究領域的論文。'
                },
                {
                    title:'教授有曾經考慮過音樂資訊以外的領域嗎？',
                    section:'這前面有稍微提過了，我曾經有為了自己畢業之後可否順利找到工作擔心過。因為音樂的研究確實比較小眾。來了中研院之後，也會覺得把我們這些如果機器學習的知識應用在其他領域 (例如綠能、或是氣候變遷)，或是會有更大的影響力。但一方面這樣想，另一方面又覺得音樂研究很有趣，彷彿有種使命感，就覺得應該繼續做下去，所以目前還沒有想要換領域。另外，也可能由於我是一位基督徒的關係，並不會特別想汲汲營營追求什麼。我珍賞心中這種平安的感覺。'
                },
                {
                    title:'教授認為研究對您做重要的是什麼？',
                    section:'應該是成就感、以及好奇心被滿足的感覺吧！能發現一些新的東西、或是做出一些被其他人覺得有用或是有趣的研究真的很好。這或許是大部分喜歡學術研究的人的通貌。'
                },
                {
                    title:'假設我們在做專題的時候，自己的想法跟教授的想法有點出入，像是教授不支持你的研究方法等等，應該要怎麼辦？',
                    section:'首先要試著溝通。表達與溝通能力是我們成長過程中比較沒有被訓練到的，但出社會之後充滿許多人與人意見不同的時候，就需要表達與溝通能力。再者，也許可以考慮換實驗室。以大學專題生來說，因為重點是發現自己的興趣，所以應該是希望可以盡量從那個實驗室學到東西。要是覺得不適合，其實不用勉強。我這裡說的不是淺嘗則止、說換就換，而是要誠實地評估自己的表現，找出能夠給實驗室貢獻、又能讓自己成長的方式。如果用單純只是拿學分的心態在進行專題研究，就實在是太可惜了。通常會建議做老師或是實驗室擅長的題目。有些老師會願意讓專題生去做一些比較不確定的題目，若對自己有自信、也覺得還能跟老師或學長討論，那也是可以試試看。一樣，這沒有標準答案，完全因每個人的興趣和個性而定。不過，在進一間實驗室前的確可以多蒐集一些情報，確定實驗室的風氣與自己期待的是否相符。以個性而言，有人喜歡自己獨立一些、有人喜歡跟很多人討論。基本上我覺得多討論總是好的，所以我建議去討論風氣比較興盛的實驗室。在實驗室裏面，就是儘量找人討論，他剛開始不理你也沒關係，就是找他討論，然後一起去吃飯之類，拉近關係，這樣會學得比較快。不要只是想著自己、也可以想想怎麼樣幫助實驗室的其他人。自己若將來成為實驗室比較資深的學長姊了，也要樂於與學弟妹分享，帶動討論的氣氛。然後修課成績其實不是很重要，除非你們想出國去一流名校念書，不然的話多嘗試一些東西其實比較重要。我知道很多人甚至會修兩個專題，或是在台大修一個專題、到中研院再找一個實驗室做(沒有學分的)專題研究。也有人花在專題上的時間比修課的時間還多。我覺得這是量力而為，不過有時候動手做真的滿有趣的。做研究其實並不是以發論文為目標，而是以讓自己成長為目標。發論文是種公認的量化的指標，但也不用因為自己沒發論文、同學有發論文，而否定自己。重點還是看自己是否有成長。在找研究所或是工作面試的時候，能不能答得出自己做過些什麼、喜歡什麼、曾經解過怎麼樣的難題，有時候反而是更重要的。'
                },
                {
                    title:'大學部做專題這件事情，您覺得它最重要的收穫是甚麼？',
                    section:'我覺得以career來說，能夠做一些跟研究相關、開創性的事情，會比較有趣。就算是去公司，也可以參與一些比較有研發性質的題目，並不一定都只是routine的工作。大學生參與專題研究，就是給你這麼一個機會，讓你經歷研發的過程。因為書本上的東西都是以前人研究的成果，那都是人家已經知道的，做研究就是要做沒人做過的研究。當你研究做到一個程度之後，你會發現前面已經沒什麼人了。單看你在研究的題目，全世界鑽的比你深的人沒幾個，到了那個時候就會覺得很有趣。就算還不到那個程度，但光你寫的東西能夠動起來，也是蠻厲害的。再來，會不會做研究跟會不會念書是兩回事，所以不要因為課業成績不好就覺得悲觀。若因為自己的成績落在班上排名的後面就喪失自信，那實在是太可惜了。長遠來看，大家都是同輩當中最聰明的一群人，所以就嘗試看看吧。當然，做研究只是人生諸多選項一個而已，不喜歡做研究的話，也完全沒有問題。'
                },
                {
                    title:'要怎麼樣不為了發paper做研究？',
                    section:'(註：假如你想做的題目不是很好發paper，是不是應該改做不是很有用卻可以發一堆小paper的題目？)剛開始很難免會為了發論文而做研究，因為大家難免希望從發表論文中得到肯定和信心。但是，有些研究難度就是比較高，需要較多的時間研究、其中也會遭遇許多挫折。這種時候，就要能夠忍受一些寂寞，也就是研究時間會拉比較長。要是覺得有趣、也覺得自己能力夠強，那還是可以挑戰看看。你自己都知道題目夠難，能做出來的人都還是能夠發論文，只是發的快或慢的問題。我很喜歡一句話，「跑得快不代表跑得遠」，就看你要當跑得快的人還是跑得遠的人。所以這很難講。你可能跑得很快、發了些還OK的論文；你也可以選擇耕耘久一些，發一篇高水準的論文。那到底誰比較厲害？其實很難講，不一定。比較沒把握的話，可以從一些較小的題目開始，慢慢有經驗之後再挑戰大的。或者，可以先設定一些目標，例如要投稿哪個會議，再根據該會議地截稿時間往前推算，看可以做哪些事情。這都可以跟指導教授討論，但每個實驗室的風氣可能不同，建議還是要找自己合得來的實驗室。'
                },
                {
                    title:'教授是如何訓練您的學生？',
                    section:'如果你是問我怎麼訓練學生的話，我會說國際觀很重要，所以我會常常讓他們去參加會議。如果是博士生的話，我會幫他們找機會去國外待一陣子，不要博士期間整段時間都待在臺灣。 反過來說，如果你的問題是：做為一個學生，我如果將來進一個實驗室，要怎麼樣可以比較快融入那個實驗室，比較快做的好？則我有兩個建議：第一個是，你們從高中一直到大學，其實都沒有面對過所謂的老闆。所以進到一個實驗室，當你老闆會對你有進度的要求的時候，你會有些壓力，可能會體驗到一些出社會的感覺。你在學校修課教授又不會拿你怎麼樣，頂多把你當掉而已，那是你念書不念書的問題。可是做研究的時候你需要直接面對你的指導教授，以及從他而來的壓力。像我之前說的，每個人適合的老師不一樣，要求高的老師可能可以讓你學到比較多東西，但你要學會與這樣的壓力共處。在一個氣氛較輕鬆的實驗室也是可以做好研究，但那就要學會自我要求。總之是抱著上進的心情，不求只是利己，而是希望自己跟實驗室可以一起變得更好。分享真的是很重要的。大家都生長在臺灣，都是臺灣未來的棟樑。可以的話不要一直存著競爭心態，而是大家有什麼訊息或收穫，就儘量多分享。同儕間、學長姐學弟妹間、甚至將來出社會之後跟同事之間，都懷抱著這樣的心情，而不是只是把別人壓過去讓自己出頭。不吝於分享、也不吝於尋求別人的幫忙。大家一起變好，那我們臺灣就會跟著變的更好。'
                }
            ]
        }
    ],
    
    
    annotation:['特別感謝：楊奕軒','撰寫： 莊永松 莊鎧爾 琉琉 何驊凌 蔡易霖'],
    id:'column_1807'
}