module.exports = {
  title: [
    '1994級 陳維超 （Skywatch Inc. Co-founder、Skywatch Inc. Co-founder、英業達 Head of AI Center）',
  ],
  hashtags: [
    '系友專訪',
    '陳維超',
    '1994級',
    'b79',
    'Skywatch',
    'Inventec',
    'NVIDIA',
    'Computer_Graphics',
    'Nokia_Research',
    'GPU_Programming',
    '電腦繪圖',
    '電腦視覺',
    '虛擬實境',
    '雲端視訊監控',
    'IoT',
  ],
  sections: [
    {
      bigtittle: '一、跟求學時有關的問題',
      sections: [
        {
          title: '談到電機系的歸屬感，請問對當年的電機系有什麼樣的回憶呢？',
          section:
            '老實說，對大學校內的印象比較模糊。\n高中到大學有很大的轉變，很多東西變成要自己去主動尋找，而不是被動接受（pull v.s. push）。至少大學前三年，感覺很多同學還沒有找到主動尋找的習慣，包含我自己也不是很確定想做什麼。因為這樣，在系外做的事情反而比較有感，像是騎腳踏車環島，或是寫程式打工的經驗。還有，系上似乎呈現 M 形分佈：有幾個人超愛讀書，非常認真，就是大家口中的「神」，也有一些人超愛玩，玩得很認真。這兩類的人加起來大概佔 10~15%。除此以外的同學，普遍來說比較害羞一點。',
        },
        {
          title: '大學時有什麼志向或興趣嗎？',
          section:
            '大一大二時對音樂很有興趣，常常在練鋼琴，自認練到跟音樂系程度差不多，反而沒有動機想把修習的課程做得很完美。\n而大三大四開始修習專題，開始有一些啟發。以前常常解短而簡單的問題，如同考試題目之類的，沒幾分鐘就解完了，而研究卻是會花上好幾年的時間。考試時的常見心態就是先答簡單的問題，放棄難的，研究反而是相反的。這種心態如果沒轉換過來，人生可能就會一直做簡單的選擇，例如找挑戰性低的工作。開始做專題以後，發現我喜歡解大問題，也發現自己有耐力把較大的問題，切成一塊塊的小問題來解。',
        },
        {
          title: '當時做過那些方面的研究？有什麼樣的學習心得嗎？',
          section:
            '大三時，我跟我的導師陳秋麟教授做電力相關的專題，寫程式做出電力系統的介面來，成效似乎不錯。還有，之前覺得很權威的高端研究，透過專題發現研究變得其實不那麼難親近；雖然還不一定能馬上發明出東西來，但至少看得懂。\n大四跟著很聰明的賴飛羆（ㄆㄧˊ）教授做專題，那時其實是因為老師人好就加入了，所以親民很重要！實驗室有各種專題，但主要是 IC 設計、CAD 電路設計類的，會用到很多電子電路知識。讀碩士時繼續跟著賴教授做電路，結果做了一年覺得動機不強，暑假就出國流浪了兩個月，回台灣時腦子突然變得比較靈活了，然後就在碩二換了研究方向，我就以電腦繪圖結合相對論，在ACM Transactions on Graphics 發表了一篇論文。',
        },
      ],
    },
    {
      bigtittle: '二、跟從台大電機畢業時相關的問題',
      sections: [
        {
          title: '教授是先在台大讀完 MS 才去北卡攻讀 Ph.D.，選擇這樣做，有什麼考量嗎？',
          section:
            '有句話說：「出國就像出麻疹，一輩子出過一次就好了」！其實當時想出國，源於碩士時幾個月出國流浪，想要更認識這個世界，另外在大學時旁聽過資工系歐陽明教授的課，受過一些啟發，後來決定走上電腦繪圖的領域，歐陽明教授推薦北卡，因為那邊的教授與校友們，有許多是在電腦繪圖領域擁有很高地位的權威。',
        },
        {
          title: '在北卡羅萊納讀 Ph.D. 的歷程中，影響您很多的有什麼呢？',
          section:
            '我對於在北卡讀博士時的印象相當深刻。可能一方面由於隻身一人在國外生活，需要打開全部的感官去認識與適應新世界；另一方面也是因為讀博士時做的研究比較吸引人，能感覺到修課是為了要解決問題所需獲得的技能，而非只為了滿足畢業學分。有一些科目過去在大學時學得不夠扎實，到了美國因此再去修一次，才覺得有學好的感覺。在那裡修課時，不會被要求做大量的作業，但是需要更多的時間去完成，學習規劃並且漸次解決問題，還要能團隊合作。相對而言，他們的文化上對於作弊抄襲等就幾乎不能容忍；對於分數，可以寬鬆，但對於道德，就十分嚴格了。這種榮譽制度（Honor Code）由相信人的角度出發，然後犯錯時給予嚴重的逞罰；我們台灣則是以不相信人的角度出發，訂定嚴格的制度，但遇到有道德瑕疵時，反而不大逞罰。美國這方面或許這是我們可以學習的地方。',
        },
        {
          title:
            '教授畢業後曾先在美國矽谷工作(NVIDIA系統架構師、Nokia Research資深研究員)，那時的經驗對您的影響是甚麼？有無一些印象深刻的事？',
          section:
            '和求學時不同，在NVIDIA雖然待遇優渥，但和研究所相比，當下覺得成長速度有限。剛進入NVIDIA時，分配到測試晶片的工作，經常半夜還要跑測試程式，十分辛苦。審慎考慮之後，決定繼續待在這家公司，為了減輕負擔，想到一個辦法，做了個系統將電腦測試自動化，這樣就可以減輕工作的繁忙程度了，最後這系統還變成了公司重要的系統，由一個團隊來接續維護。我覺得這件事情有趣的地方是體會到，懶惰是發明之本，因為真正的工程師是無法忍受無聊的工作的，一定要發明工具來讓自己懶惰一點的。後來擔任了較高的職位，開始帶領團隊把GPU 做成運算的工具（GPGPU），因為 GPU 很快，只用來跑遊戲有點可惜，當時團隊就將 GPU 擴充成可使用程式語言來控制 GPU 的運算，從最初的 Cg 到一起開發出前幾代支援 CUDA 的晶片。\n讀完博士之後，總覺得應該要繼續發表論文，否則就好像不是研究員了。但在 NVIDIA比較難有發表論文的機會，只能做一些規模比較小的東西。因此後來在朋友介紹之下，成為第一批進入矽谷 NOKIA Palo Alto 研究室的人。當時的自由度相當高，行動運算在那個時候相當熱門，我也投入了相關研究，做影像辨識、和GPS有關的 location-base services 服務等等，是很有趣的經驗。經過兩年半，寫了很多的論文，反而覺得專注研究、不做產品有點空虛了。不過這段時間的經驗又讓我更知道怎麼帶學生發表論文、怎麼做系統、怎麼把系統和研究結合、如何帶團隊等等。每個階段自己有明顯的成長，感覺還不錯！',
        },
        {
          title: '碩士畢業跟博士畢業，這兩者在業界做的工作會有什麼差異嗎？',
          section:
            '我覺得在矽谷沒有太大的差異，但在台灣差異就大了，會稱呼「X博」、「Y博」，名片也常印出 Ph.D. 經歷，好像唸了博士就變成不一樣的人，這我比較不理解。讀不讀 Ph.D.，跟職場表現也不一定有正相關，但唸博士一定會改變、影響到自己，例如我自己就會對發表的文章精確度要求比較高，比較喜歡技術論文，而比較不會想出現在新聞稿裡面。',
        },
      ],
    },
    {
      bigtittle: '三、跟從事現在這個工作時有關的問題',
      sections: [
        {
          title:
            '當初是怎麼創辦 Skywatch Inc. 的呢？是否願意分享雲端視訊監控與 IoT結合的潛力所在？',
          section:
            'Skywatch 當時是在與共同創辦人楊吉評（台大電機系同屆同學）討論後，決定結合自身影像分析領域的專業，與吉評在台灣硬體產業累積的人脈與資源，一同來創立的。我本來初始的想法是想要專注於影像分析與相關的服務，但評估世界的情勢與本地的優勢後，我們決定善用台灣硬體資源優勢，不侷限在影像分析的部分，使 Skywatch 結合軟硬，提供整體的分析、儲存與影像管理系統服務。',
        },
        {
          title: '相較於其他專做智慧家庭的公司或是其他新創公司，為什麼 Skywatch 會具有優勢？',
          section:
            '我認為有兩個主要因素使 Skywatch 能以相對精簡的規模，完成許多大公司難以達到的目標。第一點是策略靈活度與執行效率，讓我們能夠發揮較少的時間與人力，並借重本地硬體的優勢，來完成高品質的產品；第二點是 IoT 產品需要時間部署，並需與客戶成長與調整。近來的新創公司多仰賴創投資金大量挹注，但短時間若無法爆炸性成長的話，可能在產品成熟前，無法轉型為穩定成長的公司。Skywatch 是在穩定成長期，就沒有這類問題了。',
        },
        {
          title: '現今台灣創業環境有什麼問題？',
          section:
            '目前最大的問題在於傳統投資人對現今新創公司模式的不熟悉與不信任，新創生態系統不完善。上一波成功的新創公司常是由大公司底下的部門獨立後再上市的。而近期的新創公司則師法矽谷模式，在創業前期需要挹注足夠的資金，才有存活的機會。如果缺乏成功案例的話，投資人卻步不敢再進一步投資，就更無法再孕育新產業，陷入投資人缺乏標的、新創團隊缺少資金的惡性循環。',
        },
        {
          title:
            '好像也有其他做智慧監視器的新創（例如 UmboCV），Skywatch 如何面對競爭呢（查到有篇報導說技術比別人傑出）？以及有什麼樣的合作夥伴（例如硬體廠商）？',
          section:
            '新創公司的產品之間通常不會、也不需要相互競爭。我認為創業的思維在於考慮全市場的需求，包括中國、歐洲、美國，之後決定產品定位，並專注於提升自己的產品，最終決定該如何服務客人。如果只在台灣與相關的公司相互競爭，是會容易迷失產品與研發方向的。',
        },
        {
          title: '教授在創業之後的主要工作內容是什麼（例如：技術研發或是管理等）？',
          section:
            '我同時是技術長和董事長，在技術方面還是會做一些研究、算點數學，但已經不太有機會寫 production code 了，因為 too old, too slow (笑)，而且常常管理的急迫性是比較大的。管理當然不是那種「你去做這個、做那個」命令式的管理；我認為主要工作其實是 unblock 和 align。Unblock 就是幫團隊排除阻礙，並提供需要的幫助，同時自己也不該成為團隊的阻礙。Align 就是協助團隊不同成員的想法思維達成合理的一致性與協同性。團隊都是聰明人，沒有誰一定要聽誰的，但一定要協商，確保做出的結果可以同步。',
        },
        {
          title: '電腦視覺在學術界以及產業界有什麼重要但還沒突破的點？',
          section:
            '目前在做的比較多是由機器取代一個人類，例如物體辨識等。當然有些像是自駕車的應用，因為本身有很大的價值，是一定要努力突破的。除此之外，我覺得更有潛力的應該是超越人類的 （super human） AI ，例如前一陣子有入侵校園的案件，那 AI 應該要可以即時在大量影像串流裡，偵測出可能的入侵者並予以追蹤。另外一點是，現在人對 AI 的恐懼是因為不確定 AI 是不是可以負責或解釋的（accountable & explainable），像是自駕車撞到東西，要能知道為什麼發生這種事故，這時可解釋的 AI 就很重要。另外當然是有常識的、與符合人類共存的 AI （例如符合阿西莫夫機器人三定律等）的新道德規範等等，這些也都還有很長的路要走。',
        },
      ],
    },
    {
      bigtitle: '四、結尾問題',
      sections: [
        {
          title: '學長對大神有什麼看法',
          section:
            '大神同學當然都很厲害，頭腦很好，但常有個共通點，就是講話大多數人聽不懂。IQ 雖然高，但是溝通能力有時候成為與其他人合作、或是發表研究成果時的阻礙。我在台灣的碩士論文有上百條公式，美國寫的博士論文反而只有3條 —— 這不是哪篇比較難，而是在台灣寫的時候搞得艱深，同學會「看不懂->有神快拜<(_ _)>」，但在美國時就被教育成發表就是要讓別人看懂，爭取和別人合作的機會，這樣影響力（impact）才會大。因此表達能力真的很重要，這是我認為台灣學生普遍較為缺乏、可以想辦法成長的部分。',
        },
        {
          title: '給大學部學弟妹的一些建議？(有無後悔在大學時來不及做的事情？)',
          section:
            '我只有一個比較廣泛性的建議。我發現在台灣當大學生，似乎都比較「混」：讀書做研究不起勁，連玩起來也不認真。國外的教育可能比較注重運動，年輕人不管做什麼事，認真起來能量都滿大的，所以鼓勵同學把身體搞好，work hard, play harder。',
        },
      ],
    },
  ],
  annotation: ['特別感謝：陳維超'],
  id: 'column_1808',
}
