module.exports = {
    title:['2008級 鄭恆之（Technical Lead Manager @ Google Brain）'],
    hashtags:['系友專訪' ,'鄭恆之' ,'2007級' ,'B93' ,'Google' ,'MachineLearning' ,'SiliconValley' ,'CMU' ,'PhD'],
    sections:[
        {
            bigtitle:'一、大學時期',
            sections:[
                {
                    title:'大學中印象最深刻的經驗及對未來的影響',
                    section:'先從社團說起，我大學時參加台大合唱團，大二時擔任男高音聲部部長，大三開始擔任指揮。每週都要帶領約一百人的團練習，訓練到領導能力及溝通能力(鼓勵團員一起來練習、向團員傳達自己對於音樂詮釋與團練模式的想法)。比較特殊的經驗是在國家音樂廳當指揮，有了這種大規模presentation的經驗，讓我之後都不容易怯場。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;另外，我在合唱團交到女朋友，也就是現在的老婆。從大學的時候，我們就常常討論彼此的興趣、課業，後來討論到生涯規劃，就包括去美國念博士班，雖然到美國之後相隔兩地長達五年，但是仍互相鼓勵，最後一起到加州工作、結婚，她在Facebook工作，我在Google工作。所以情場也是很重要的，鼓勵大家嘗試。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;除了社團以外，我也參加許多系上的活動。參加過三次野台、擔任過一次電機音樂會總召，也參加過電機之夜和電機營。大學參加這些活動帶給我最大的收穫，首先是表達與溝通能力，這是在進入研究所之後，尤其是到美國進入職場之後相當重要的核心能力，但是台灣的教育常常缺乏這方面的訓練，在社團尤其是當幹部的話，較能夠訓練到這部分。有了表達與溝通能力之後，要進一步擁有領導能力，包括如何在團體中具有影響力，還有如何讓大家目標一致，一起完成一件事情。最後是創意，多嘗試不同面向的事情可以增進自己的創意。'
                    
                },
                {
                    title:'決定研究主題及未來職涯方向',
                    section:'這跟修課及所做的專題息息相關。我當初修信號與系統時，就覺得很喜歡，這門課最神奇的就是可以把很多資訊量儲存在信號中藉此傳遞、解讀。由於修了李琳山教授的信號與系統，所以就跟著琳山教授做專題，主題是語音辨識。後來在Homer做的主題是音樂信號處理，這可以跟我對音樂的興趣相結合，把研究與自己的興趣相結合，會讓研究比較具有獨特性，因為別人不一定想做這主題，而且做自己喜歡的事總是較有動力。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;在Homer的時候，我曾跟楊奕軒學長合作過，他幫助我很多，讓我學到，獨立做研究和做已經設計好的實驗非常的不同。那時候常常做一些未知的題目，像是一開始做和弦辨識，這跟我當時喜歡彈吉他有關，和弦影響一首歌給人的感覺，所以我想要從這個小題目做起，也是那時接觸到machine learning ，覺得很喜歡，我對人類如何接收訊息並學習，然後教機器學習非常有興趣，所以就愈來愈往那方向走。'
                }
            ]
        },
        {
            bigtitle:'二、博士時期',
            sections:
            [
                {
                    title:'美國與台灣的文化衝擊',
                    section:'美國相對台灣而言對於師生之間的輩分差異不會太過拘泥，以課堂演講為例：當學生已經將教室的空位坐滿後，即使是 60 歲以上高齡的資深教授晚到也必須和其他遲來的學生一起席地而坐，雖然心中有想要讓座的想法，不過在觀察週遭同學和教授的反應後，發覺在美國先來後到的觀念還是大於師生間的輩分關係。模糊的輩分關係更讓我之後在與教授和公司上級交流時，以平等的地位溝通，更能直截了當的表達自己的想法，不需要特別顧慮輩分而保留心中想說的話。尤其在職場上，清楚、簡短而且明確的表達想法，對於自己在公司決策的影響力非常重要。'
                },
                {
                    title:'業界和學界的研究內容差異',
                    section:'兩者在於研究方法是相同的，最主要的差異在於「目標的定義」和「對於成功的衡量標準」，因為這兩項的不同會造成最佳化的方向不同。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;學界主要重視在領域的創新程度，而業界以 Google 為例，最重要的是研究的結果對於產品是否具有決定性的影響力。我自己的專業領域是機器學習，有些學界研究可能會以增加模型的複雜度，來達到某些程度的創新；然而在業界會同時實用性，若複雜模型需要耗費過多資源和時間來維持運作，那相對於簡單的模型就不會是好選擇。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;總而言之，在不同地方研究會受到目標定義而依循不同的研究方向和方法。'
                }
            ]
        },
        {
            bigtitle:'三、工作時期',
            sections:
            [
                {
                    title:'留在美國工作的決定',
                    section:'對於是否留在美國其實不斷的改變，大學的時候不清楚美國的狀況，很難去做規劃，因而沒有預設。後來才看出要做Machine Learning、Research等在美國機會很多，相較而言在台灣蠻缺乏的。雖然台灣有很優秀的Startup從事Machine Learning，但真的與矽谷難以比擬。是否留在美國還是要看領域，當時大學沒有事先規劃，但接觸越多，知道產業狀態，也就能給自己目標與做決定。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;另外，在美國工作，要確保拿到簽證，主要是自身能力的特殊性。一個國家給外國人工作簽證，通常是因為他的能力本國人難以取代，有需求去發簽證雇用他。像在美國STEM，Science, Technology, Engineering and Math，這種理工科人才會在學生簽證後給比較長的實習時間，申請到的工作簽證機率也比較高。另外薪水超過一定門檻的工作拿到的機會也較高，因為薪水高大致上代表在當地就業市場的價值高，意即這樣的人才比較難尋。未來像是入門程式設計這類越來越多人學習的技能，自己可以貢獻的特殊性可能會越來越小，所以最好除了程式外，還要有其他領域的專業會更好。'
                },
                {
                    title:'進入 Google 的契機和工作內容',
                    section:'一開始我是藉由實習得到轉正職的機會，並且參與 Google Brain 的研究計畫。工作內容分成主要分三個階段，第一階段在 2014 年，此時在建構 Large-Scale Machine Learning Platform，實際內容涵蓋 Data Pipeline、利用分散式系統建立快速訓練的平台、利用平行化的技巧做快速的預測和推論。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;第二階段是從 2015 年到 2017 年，此時將 Deep Learning 導入原先沒有使用機器學習的產品上，例如 Google Search、Google Play、Google System 和 Youtube。除此之外還有從自己的專案「Wide & Deep Learning」開始研究，後來有實際應用在產品上，最終對外界開源 Tensorflow 1.0，被其他學術單位和公司所使用。這個時期讓我發現在 Google 內部做的研究，事實上不只能影響公司產品也能遍及全世界。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;第三階段主要在做「Neural Sequential Interaction Modeling」，也就是透過一連串使用者和系統的互動來學習，例如對話系統、Google Duplex Assistant。另外，雖然很多產品都開始導入 end-to-end 的學習方法，但考量到 Rule-based method 能精準控制的特性，仍會採用能確保特定嚴重錯誤不會在系統中發生，整體而言是雜揉 Deep Learning 和 Rule-based method 的混合系統。'
                },
                {
                    title:'Google技術突破的浪潮發展方向',
                    section:'近年發展的 Deep Learning 能從 Data 裡面自動抽取出很好的 high level feature，做 Perception 的任務作得特別好，而接下來的挑戰是從這些feature當中去做reasoning，如：從對話中抽出feature後去回答問題。由於reasoning是需要common sense的，亦即對世界有基本瞭解(如：影像需符合物理規則，人說的話必須make sense)，知道什麼是合理/不合理，這如果能藉由人類給的knowledge base/rule直接學習，而非只能從大量data輸入輸出學到，可能會有比較大的突破。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;另外像是自然語言處理(NLP)還有很多挑戰，它與電腦視覺(CV)的其中一項差異是，因為影像pixel的分布是自然界生成的規則，其實動物也有辨識能力。反之語言則是人類發明特有的，造成了人類與動物的差異，所以教機器學語言可能是更複雜、更艱難的任務。'
                },
                {
                    title:'進入Google Brain等研究機構所需要的能力與特質',
                    section:'我們重視的能力特質有technical跟non-technical的部分：\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;Technical的部分，研究經驗跟在業界的應用經驗都會加分，除了會做研究(有publication)，也需要知道業界的研究方向要如何調整，才會對產品有好的實際幫助與影響力，當然寫程式、軟體工程的基本能力也是非常重要。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;Non-technical第一個看的是，一個人是否有成長型思維(growth mindset)，它的相反固定型思維(fixed mindset)是覺得天賦已既定，是天生被給予的，也因此只作自己擅長的，不作自己不擅長的。growth mindset則認為任何事情都是學得來的，與先天無關，無論是硬實力或軟實力。這方面可以看一個人一路走來的軌跡，有沒有一直在進步，進步的速率如何。有恆毅力，長期認真做事、成長，與未來的表現常常是有正相關，我們也會傾向優先考慮有這樣特質的人。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;第二是動力，通常我們會問說面試者接下來自己的目標，越是能能說出目標及明確原因的人，通常會比較有動力，有內在動力自己去前進，想要進步成長，最終的表現也常常會更好。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;另外溝通表達能力還有領導力也很重要，比較會錄取傾向collaboration跟team work，而非單打獨鬥的人。'
                },
                {
                    title:'近年Deep Learning走紅，Data Scientist職位變多，盛況在未來會不會有所飽和？不如碼農般穩定？',
                    section:'我的看法是相反，research會一直有需求，但是research的內容會一直在演進，所以必須要適應力很強，有調整很快的心理準備。例如在過去幾年，光是會調deep learning model參數，可能就可以滿足工作需求，但是現在有AutoML等技術出現，可以自動優化model並且取代了調參數的人力，所以做研究的人就必須繼續往前做更難的研究。譬如AutoML雖然在supervised task上表現好，但如果是剛剛所提到需要機器去reasoning的task，還有更多問題需要解決，也需要更多人去研究。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;而碼農缺，可能不像大家想的有固定需求，例如現在有研究領域是作 Program Synthesis，從 Pseudocode 成出 code 等等，用來輔助、加快並取代code中重複的部分，當程式生成越來越成功，其實碼農缺就會減少了，而研究會一直會有需求。碼農這個詞也暗指了不需要過多思考，只要專心老實的寫code，自然取代性比較高。機器可以取代人類反應很快就能處理的任務，因此鼓勵大家立志往比較深入的研究去走，會比較長遠。'
                }
            ]
        },
        {
            bigtitle:'四、未來規劃',
            sections:
            [
                {
                    title:'規劃職涯的方式',
                    section:'我在職涯規劃上，基本上大學申請研究所的時候思考一次，研究所快畢業的時候也思考一次。到了工作之後，幾乎每一兩個月都會跟主管以及員工討論在職涯上的規劃。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;我覺得有幫助的是常常問自己喜歡的是什麼，很常做選擇，很常逼自己把原因寫下來。我個人在做重要決定時，會去想決定的核心價值，通常都有優缺點，每個選擇都有好壞，最後的選擇還是與價值觀有關，訓練自己嚴格的排序並說出為什麼，就能較輕易的決定。根據當下有的資訊做出最好的判斷，自己也不會猶豫、後悔，只會全心投入。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;此外，我覺得要找一個終極的目標，我的目標就是期許自己能夠在人工智慧這個研究領域成為一個成功的領導人，以人工智慧影響其他不同的產業，並且讓這些產業產生重大、正向的改變。我希望人類在未來能夠與人工智慧有效合作，提高創造力與生產力。同時，我也希望我能成為一個有遠見以及有影響力的人。由於自己對於舞台表演藝術的熱愛，我也喜歡將自己的想法傳達給觀眾，因此我也想要透過寫書或演講的方式，來影響更多人，也希望能夠幫助他們做出正向的改變。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;我現階段的規劃是希望能從帶領一個實驗室，成長到帶領某個領域之下的多個實驗室，並且影響多這項重大產品事業的走向。如果有好的機會的話，在未來嘗試創業也是有可能的。'
                },
                {
                    title:'職涯發展迅速的關鍵',
                    section:'我認為溝通表達能力是一件很重要的事情。臺灣的理工學生，技術面都已經很強了，但是在口頭報告上，卻沒有辦法完整地將自己所知道的內容表達出來。練習口頭表達也會讓你變得比較不怕去爭取機會。在職場上，不要放過任何機會，並且每次都以高品質建立個人品牌，這樣別人也比較容易將任務交給你完成；而每當你完成一項任務，就會再有新的工作機會出現，而每次你都全力以赴，做好自己的工作並且能整地表達，我認為這是一件很重要的事情。'
                }
            ]

        },
        {
            bigtitle:'五、給學弟妹的建議',
            sections:
            [
                {
                    title:'及早建立個人品牌',
                    section:'建立起自己的品牌，找到屬於自己獨特的主題（T型人才的長腳，也就是自己的專長），然後持續經營，有助於在申請博士或未來申請工作的時候，在眾多申請者中脱穎而出。像我當初就覺得我的主題與多媒體信號的處理和理解有關，所以大三、大四就開始經營這方面，修了很多語音、影像辨識等等相關的課，也做了專題，所以在這方面累積了很多經驗，對未來申請幫助很大。申請博士班的時候，有各種不同主題的實驗室供我們選擇，雖然不一定找得到跟自己最初主題完全一樣的實驗室，但是提早經營自己的主題還是可以幫助我們找到主題最接近興趣的實驗室。'
                },
                {
                    title:'大學課業很繁重，學長鼓勵學弟妹一定要嘗試的事情',
                    section:'我很鼓勵大家可以多嘗試，去社團訓練領導力與創意等。另外，我認為我在大學時比較沒有做，但鼓勵大家去嘗試的，是實習。我認為可以多嘗試不同的實習，尤其是要出國的學弟妹們，可以先考慮在臺灣有實習的工作經驗，先行體驗臺灣的工作環境與工作文化，再到國外實習並且學習不同的環境與文），這樣比較能夠知道各個不同工作的優缺點。這有點像是蒐集 Data 來 Train 自己的感覺，否則如果沒有足夠的經驗，很容易產生盲點而影響未來的發展。'
                },
                {
                    title:'畢業後需掌握能力或特質',
                    section:'數學基礎很重要，如果是做研究，後面很多都是基本數學基礎再去學習。還有研究能力，也就是去找新問題解的能力，因為大部分課程都是在教解問題，這也是工程師必備的，但找值得解的問題就進入到研究，而這可以在專題研究學到。\n&nbsp;&nbsp;&nbsp;&nbsp&nbsp;&nbsp;高EQ，樂觀積極的態度，因為一定會有很多挫折，不要讓自己進入負面循環。高EQ對領導力也很重要，首先要先察覺自己的情緒，將自己維持在能保持高生產力的情緒狀態，進一步要能察覺團體的情緒。'
                }
            ]
        }

    ],
    
    
    annotation:['特別感謝：鄭恆之','撰寫：俞建琁、王廷峻、莊永松、吳建翰、鄭謹譯、李筠婕','校稿彙整：李筠婕'],
    id:'column_1912'
}